#pragma once
#include <cstdint>
#include <cstddef>

namespace ElleFiesta::Proto {

#pragma pack(push, 1)

struct NETPACKET {
    NETCOMMAND netcmd;
    uint8_t _pad_at_0000[2];
    uint8_t data[0];
};
static_assert(sizeof(NETPACKET) == 2, "NETPACKET size drift");

struct NETPACKETHEADER { uint8_t data[2]; };
static_assert(sizeof(NETPACKETHEADER) == 2, "NETPACKETHEADER size drift");

struct NETPACKETZONEHEADER { uint8_t data[6]; };
static_assert(sizeof(NETPACKETZONEHEADER) == 6, "NETPACKETZONEHEADER size drift");

struct PROTO_NC_ACT_ACTIONBYITEM_ACK { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_ACT_ACTIONBYITEM_ACK) == 3, "PROTO_NC_ACT_ACTIONBYITEM_ACK size drift");

struct PROTO_NC_ACT_ACTIONBYITEM_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_ACTIONBYITEM_REQ) == 1, "PROTO_NC_ACT_ACTIONBYITEM_REQ size drift");

struct PROTO_NC_ACT_ANIMATION_LEVEL_CHANGE_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_ACT_ANIMATION_LEVEL_CHANGE_CMD) == 3, "PROTO_NC_ACT_ANIMATION_LEVEL_CHANGE_CMD size drift");

struct PROTO_NC_ACT_ANIMATION_START_CMD {
    uint8_t _pad_at_0000[2];
    wchar_t sAnimationIndex[32];
};
static_assert(sizeof(PROTO_NC_ACT_ANIMATION_START_CMD) == 34, "PROTO_NC_ACT_ANIMATION_START_CMD size drift");

struct PROTO_NC_ACT_ANIMATION_STOP_CMD {
    uint8_t _pad_at_0000[2];
    wchar_t sAnimationIndex[32];
};
static_assert(sizeof(PROTO_NC_ACT_ANIMATION_STOP_CMD) == 34, "PROTO_NC_ACT_ANIMATION_STOP_CMD size drift");

struct PROTO_NC_ACT_AUTO_WAY_FINDING_USE_GATE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_AUTO_WAY_FINDING_USE_GATE_ACK) == 2, "PROTO_NC_ACT_AUTO_WAY_FINDING_USE_GATE_ACK size drift");

struct PROTO_NC_ACT_AUTO_WAY_FINDING_USE_GATE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_AUTO_WAY_FINDING_USE_GATE_REQ) == 1, "PROTO_NC_ACT_AUTO_WAY_FINDING_USE_GATE_REQ size drift");

struct PROTO_NC_ACT_CHANGEMODE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_CHANGEMODE_REQ) == 1, "PROTO_NC_ACT_CHANGEMODE_REQ size drift");

struct PROTO_NC_ACT_CHAT_REQ {
    uint8_t _pad_at_0000[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_CHAT_REQ) == 2, "PROTO_NC_ACT_CHAT_REQ size drift");

struct PROTO_NC_ACT_CREATECASTBAR { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_CREATECASTBAR) == 2, "PROTO_NC_ACT_CREATECASTBAR size drift");

struct PROTO_NC_ACT_EFFECT_MESSAGE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_EFFECT_MESSAGE_CMD) == 4, "PROTO_NC_ACT_EFFECT_MESSAGE_CMD size drift");

struct PROTO_NC_ACT_EMOTICON_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_EMOTICON_CMD) == 1, "PROTO_NC_ACT_EMOTICON_CMD size drift");

struct PROTO_NC_ACT_EVENT_CODE_ACTION_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_ACT_EVENT_CODE_ACTION_CMD) == 6, "PROTO_NC_ACT_EVENT_CODE_ACTION_CMD size drift");

struct PROTO_NC_ACT_FOLDTENT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_FOLDTENT_ACK) == 2, "PROTO_NC_ACT_FOLDTENT_ACK size drift");

struct PROTO_NC_ACT_GATHERCOMPLETE_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_GATHERCOMPLETE_ACK) == 4, "PROTO_NC_ACT_GATHERCOMPLETE_ACK size drift");

struct PROTO_NC_ACT_GATHERSTART_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_ACT_GATHERSTART_ACK) == 6, "PROTO_NC_ACT_GATHERSTART_ACK size drift");

struct PROTO_NC_ACT_GATHERSTART_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_GATHERSTART_REQ) == 2, "PROTO_NC_ACT_GATHERSTART_REQ size drift");

struct PROTO_NC_ACT_MOVEFAIL_ACK {
    SHINE_XY_TYPE back;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_MOVEFAIL_ACK) == 8, "PROTO_NC_ACT_MOVEFAIL_ACK size drift");

struct PROTO_NC_ACT_MOVEFAIL_CMD {
    SHINE_XY_TYPE back;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_MOVEFAIL_CMD) == 8, "PROTO_NC_ACT_MOVEFAIL_CMD size drift");

struct PROTO_NC_ACT_MOVESPEED_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_MOVESPEED_CMD) == 4, "PROTO_NC_ACT_MOVESPEED_CMD size drift");

struct PROTO_NC_ACT_MOVEWALK_CMD {
    SHINE_XY_TYPE from;
    uint8_t _pad_at_0000[8];
    SHINE_XY_TYPE to;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_MOVEWALK_CMD) == 16, "PROTO_NC_ACT_MOVEWALK_CMD size drift");

struct PROTO_NC_ACT_NOTICE_CMD_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_ACT_CHAT_REQ cmd;
};
static_assert(sizeof(PROTO_NC_ACT_NOTICE_CMD_SEND) == 5, "PROTO_NC_ACT_NOTICE_CMD_SEND size drift");

struct PROTO_NC_ACT_NPCCLICK_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_NPCCLICK_CMD) == 2, "PROTO_NC_ACT_NPCCLICK_CMD size drift");

struct PROTO_NC_ACT_NPCMENUOPEN_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_NPCMENUOPEN_ACK) == 1, "PROTO_NC_ACT_NPCMENUOPEN_ACK size drift");

struct PROTO_NC_ACT_NPCMENUOPEN_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_NPCMENUOPEN_REQ) == 2, "PROTO_NC_ACT_NPCMENUOPEN_REQ size drift");

struct PROTO_NC_ACT_NPC_ACTION_CMD { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_ACT_NPC_ACTION_CMD) == 7, "PROTO_NC_ACT_NPC_ACTION_CMD size drift");

struct PROTO_NC_ACT_NPC_MENU_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_NPC_MENU_CMD) == 1, "PROTO_NC_ACT_NPC_MENU_CMD size drift");

struct PROTO_NC_ACT_OBJECT_EFFECT_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_ACT_OBJECT_EFFECT_CMD) == 6, "PROTO_NC_ACT_OBJECT_EFFECT_CMD size drift");

struct PROTO_NC_ACT_OBJECT_SOUND_CMD {
    uint8_t _pad_at_0000[2];
    uint8_t sSoundFileName[32];
};
static_assert(sizeof(PROTO_NC_ACT_OBJECT_SOUND_CMD) == 34, "PROTO_NC_ACT_OBJECT_SOUND_CMD size drift");

struct PROTO_NC_ACT_PARTYCHAT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_PARTYCHAT_ACK) == 2, "PROTO_NC_ACT_PARTYCHAT_ACK size drift");

struct PROTO_NC_ACT_PARTYCHAT_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_ACT_PARTYCHAT_ACK ack;
};
static_assert(sizeof(PROTO_NC_ACT_PARTYCHAT_ACK_SEND) == 5, "PROTO_NC_ACT_PARTYCHAT_ACK_SEND size drift");

struct PROTO_NC_ACT_PARTYCHAT_REQ {
    uint8_t _pad_at_0000[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_PARTYCHAT_REQ) == 2, "PROTO_NC_ACT_PARTYCHAT_REQ size drift");

struct PROTO_NC_ACT_PARTYCHAT_CMD {
    Name5 talker;
    uint8_t _pad_at_0000[20];
    PROTO_NC_ACT_PARTYCHAT_REQ chat;
};
static_assert(sizeof(PROTO_NC_ACT_PARTYCHAT_CMD) == 22, "PROTO_NC_ACT_PARTYCHAT_CMD size drift");

struct PROTO_NC_ACT_PITCHTENT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_PITCHTENT_ACK) == 2, "PROTO_NC_ACT_PITCHTENT_ACK size drift");

struct PROTO_NC_ACT_PLAY_SOUND_CMD {
    uint8_t _pad_at_0000[2];
    uint8_t FileName[0];
};
static_assert(sizeof(PROTO_NC_ACT_PLAY_SOUND_CMD) == 2, "PROTO_NC_ACT_PLAY_SOUND_CMD size drift");

struct PROTO_NC_ACT_PRODUCE_CAST_FAIL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_PRODUCE_CAST_FAIL_ACK) == 2, "PROTO_NC_ACT_PRODUCE_CAST_FAIL_ACK size drift");

struct PROTO_NC_ACT_PRODUCE_CAST_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_PRODUCE_CAST_REQ) == 2, "PROTO_NC_ACT_PRODUCE_CAST_REQ size drift");

struct PROTO_NC_ACT_PRODUCE_MAKE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_PRODUCE_MAKE_CMD) == 4, "PROTO_NC_ACT_PRODUCE_MAKE_CMD size drift");

struct PROTO_NC_ACT_REINFORCEMOVEBYPATH_CMD {
    uint8_t _pad_at_0000[6];
    SHINE_XY_TYPE_______0_bytes___ path;
};
static_assert(sizeof(PROTO_NC_ACT_REINFORCEMOVEBYPATH_CMD) == 6, "PROTO_NC_ACT_REINFORCEMOVEBYPATH_CMD size drift");

struct PROTO_NC_ACT_REINFORCE_RUN_CMD {
    SHINE_XY_TYPE xy;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_REINFORCE_RUN_CMD) == 8, "PROTO_NC_ACT_REINFORCE_RUN_CMD size drift");

struct PROTO_NC_ACT_REINFORCE_STOP_CMD {
    SHINE_XY_TYPE loc;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_REINFORCE_STOP_CMD) == 8, "PROTO_NC_ACT_REINFORCE_STOP_CMD size drift");

struct PROTO_NC_ACT_RIDE_FAIL_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_RIDE_FAIL_CMD) == 2, "PROTO_NC_ACT_RIDE_FAIL_CMD size drift");

struct PROTO_NC_ACT_RIDE_FEEDING_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_RIDE_FEEDING_ACK) == 2, "PROTO_NC_ACT_RIDE_FEEDING_ACK size drift");

struct PROTO_NC_ACT_RIDE_FEEDING_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_ACT_RIDE_FEEDING_REQ) == 1, "PROTO_NC_ACT_RIDE_FEEDING_REQ size drift");

struct PROTO_NC_ACT_RIDE_HUNGRY_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_RIDE_HUNGRY_CMD) == 2, "PROTO_NC_ACT_RIDE_HUNGRY_CMD size drift");

struct PROTO_NC_ACT_RIDE_ON_CMD {
    CHARBRIEFINFO_RIDE__RideInfo ride;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_ACT_RIDE_ON_CMD) == 2, "PROTO_NC_ACT_RIDE_ON_CMD size drift");

struct PROTO_NC_ACT_ROAR_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_ROAR_ACK) == 2, "PROTO_NC_ACT_ROAR_ACK size drift");

struct PROTO_NC_ACT_ROAR_REQ {
    uint8_t _pad_at_0000[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_ROAR_REQ) == 2, "PROTO_NC_ACT_ROAR_REQ size drift");

struct PROTO_NC_ACT_SCRIPT_MSG_CMD {
    uint8_t _pad_at_0000[2];
    uint8_t sScriptMsgIndex[32];
    uint8_t nlen[5];
    uint8_t sContent[0];
};
static_assert(sizeof(PROTO_NC_ACT_SCRIPT_MSG_CMD) == 39, "PROTO_NC_ACT_SCRIPT_MSG_CMD size drift");

struct PROTO_NC_ACT_SCRIPT_MSG_WORLD_CMD {
    uint8_t _pad_at_0000[2];
    uint8_t sScriptMsgIndex[32];
    uint8_t nlen[5];
    uint8_t sContent[0];
};
static_assert(sizeof(PROTO_NC_ACT_SCRIPT_MSG_WORLD_CMD) == 39, "PROTO_NC_ACT_SCRIPT_MSG_WORLD_CMD size drift");

struct PROTO_NC_ACT_SETITEMHEALEFFECT___unnamed_type_flag_ {
    uint32_t  isheal;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_ACT_SETITEMHEALEFFECT___unnamed_type_flag_) == 1, "PROTO_NC_ACT_SETITEMHEALEFFECT___unnamed_type_flag_ size drift");

struct PROTO_NC_ACT_SETITEMHEALEFFECT {
    uint8_t _pad_at_0000[2];
    PROTO_NC_ACT_SETITEMHEALEFFECT___unnamed_type_flag_ flag;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_ACT_SETITEMHEALEFFECT) == 5, "PROTO_NC_ACT_SETITEMHEALEFFECT size drift");

struct PROTO_NC_ACT_SHOUT_CMD {
    uint8_t _pad_at_0000[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_SHOUT_CMD) == 2, "PROTO_NC_ACT_SHOUT_CMD size drift");

struct PROTO_NC_ACT_SHOW_CINEMATIC_CMD {
    uint8_t _pad_at_0000[2];
    uint8_t pText[0];
};
static_assert(sizeof(PROTO_NC_ACT_SHOW_CINEMATIC_CMD) == 2, "PROTO_NC_ACT_SHOW_CINEMATIC_CMD size drift");

struct PROTO_NC_ACT_SOMEEONEJUMP_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEEONEJUMP_CMD) == 2, "PROTO_NC_ACT_SOMEEONEJUMP_CMD size drift");

struct PROTO_NC_ACT_SOMEONECHANGEMODE_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONECHANGEMODE_CMD) == 3, "PROTO_NC_ACT_SOMEONECHANGEMODE_CMD size drift");

struct PROTO_NC_ACT_SOMEONECHAT_CMD___unnamed_type_flag_ {
    uint32_t  GMColor;
    uint32_t  chatwin;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONECHAT_CMD___unnamed_type_flag_) == 1, "PROTO_NC_ACT_SOMEONECHAT_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_ACT_SOMEONECHAT_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_ACT_SOMEONECHAT_CMD___unnamed_type_flag_ flag;
    uint8_t _pad_at_0005[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONECHAT_CMD) == 7, "PROTO_NC_ACT_SOMEONECHAT_CMD size drift");

struct PROTO_NC_ACT_SOMEONEEMOTICONSTOP_CMD {
    uint8_t _pad_at_0000[2];
    STOPEMOTICON_DESCRIPT emoticon;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEEMOTICONSTOP_CMD) == 5, "PROTO_NC_ACT_SOMEONEEMOTICONSTOP_CMD size drift");

struct PROTO_NC_ACT_SOMEONEEMOTICON_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEEMOTICON_CMD) == 3, "PROTO_NC_ACT_SOMEONEEMOTICON_CMD size drift");

struct PROTO_NC_ACT_SOMEONEFOLDTENT_CMD {
    uint8_t _pad_at_0000[2];
    CHARBRIEFINFO_NOTCAMP shape;
    uint8_t _tail[43];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEFOLDTENT_CMD) == 45, "PROTO_NC_ACT_SOMEONEFOLDTENT_CMD size drift");

struct PROTO_NC_ACT_SOMEONEGATHERCANCEL_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEGATHERCANCEL_CMD) == 4, "PROTO_NC_ACT_SOMEONEGATHERCANCEL_CMD size drift");

struct PROTO_NC_ACT_SOMEONEGATHERCOMPLETE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEGATHERCOMPLETE_CMD) == 4, "PROTO_NC_ACT_SOMEONEGATHERCOMPLETE_CMD size drift");

struct PROTO_NC_ACT_SOMEONEGATHERSTART_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEGATHERSTART_CMD) == 6, "PROTO_NC_ACT_SOMEONEGATHERSTART_CMD size drift");

struct PROTO_NC_ACT_SOMEONEMOVEWALK_CMD___unnamed_type_moveattr_ {
    uint32_t  direct;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEMOVEWALK_CMD___unnamed_type_moveattr_) == 2, "PROTO_NC_ACT_SOMEONEMOVEWALK_CMD___unnamed_type_moveattr_ size drift");

struct PROTO_NC_ACT_SOMEONEMOVEWALK_CMD {
    uint8_t _pad_at_0000[2];
    SHINE_XY_TYPE from;
    uint8_t _pad_at_0002[8];
    SHINE_XY_TYPE to;
    uint8_t _pad_at_000a[10];
    PROTO_NC_ACT_SOMEONEMOVEWALK_CMD___unnamed_type_moveattr_ moveattr;
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEMOVEWALK_CMD) == 22, "PROTO_NC_ACT_SOMEONEMOVEWALK_CMD size drift");

struct PROTO_NC_ACT_SOMEONEPITCHTENT_CMD {
    uint8_t _pad_at_0000[2];
    CHARBRIEFINFO_CAMP camp;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEPITCHTENT_CMD) == 14, "PROTO_NC_ACT_SOMEONEPITCHTENT_CMD size drift");

struct PROTO_NC_ACT_SOMEONEPRODUCE_CASTCUT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEPRODUCE_CASTCUT_CMD) == 2, "PROTO_NC_ACT_SOMEONEPRODUCE_CASTCUT_CMD size drift");

struct PROTO_NC_ACT_SOMEONEPRODUCE_CAST_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEPRODUCE_CAST_CMD) == 4, "PROTO_NC_ACT_SOMEONEPRODUCE_CAST_CMD size drift");

struct PROTO_NC_ACT_SOMEONEPRODUCE_MAKE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONEPRODUCE_MAKE_CMD) == 4, "PROTO_NC_ACT_SOMEONEPRODUCE_MAKE_CMD size drift");

struct PROTO_NC_ACT_SOMEONERIDE_OFF_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONERIDE_OFF_CMD) == 2, "PROTO_NC_ACT_SOMEONERIDE_OFF_CMD size drift");

struct PROTO_NC_ACT_SOMEONERIDE_ON_CMD {
    uint8_t _pad_at_0000[2];
    CHARBRIEFINFO_RIDE__RideInfo ride;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONERIDE_ON_CMD) == 4, "PROTO_NC_ACT_SOMEONERIDE_ON_CMD size drift");

struct PROTO_NC_ACT_SOMEONESHOUT_CMD___unnamed_type_flag_ {
    uint32_t  GMColor;
    uint32_t  isMob;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONESHOUT_CMD___unnamed_type_flag_) == 1, "PROTO_NC_ACT_SOMEONESHOUT_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_ACT_SOMEONESHOUT_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_ACT_SOMEONESHOUT_CMD___unnamed_type_speaker_ speaker;
    uint8_t _pad_at_0001[20];
    PROTO_NC_ACT_SOMEONESHOUT_CMD___unnamed_type_flag_ flag;
    uint8_t _pad_at_0016[1];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONESHOUT_CMD) == 23, "PROTO_NC_ACT_SOMEONESHOUT_CMD size drift");

struct PROTO_NC_ACT_SOMEONESPEEDCHANGE_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_ACT_SOMEONESPEEDCHANGE_CMD) == 3, "PROTO_NC_ACT_SOMEONESPEEDCHANGE_CMD size drift");

struct PROTO_NC_ACT_SOMEONESTOP_CMD {
    uint8_t _pad_at_0000[2];
    SHINE_XY_TYPE loc;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONESTOP_CMD) == 10, "PROTO_NC_ACT_SOMEONESTOP_CMD size drift");

struct PROTO_NC_ACT_SOMEONEWALK_CMD {
    uint8_t _pad_at_0000[2];
    SHINE_XY_TYPE from;
    uint8_t _pad_at_0002[8];
    SHINE_XY_TYPE to;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEWALK_CMD) == 18, "PROTO_NC_ACT_SOMEONEWALK_CMD size drift");

struct PROTO_NC_ACT_SOMEONEWHISPER_CMD___unnamed_type_flag_ {
    uint32_t  GMColor;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEWHISPER_CMD___unnamed_type_flag_) == 1, "PROTO_NC_ACT_SOMEONEWHISPER_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_ACT_SOMEONEWHISPER_CMD {
    uint8_t _pad_at_0000[1];
    Name5 talker;
    uint8_t _pad_at_0001[20];
    PROTO_NC_ACT_SOMEONEWHISPER_CMD___unnamed_type_flag_ flag;
    uint8_t _pad_at_0016[1];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_SOMEONEWHISPER_CMD) == 23, "PROTO_NC_ACT_SOMEONEWHISPER_CMD size drift");

struct PROTO_NC_ACT_STOP_REQ {
    SHINE_XY_TYPE loc;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_STOP_REQ) == 8, "PROTO_NC_ACT_STOP_REQ size drift");

struct PROTO_NC_ACT_WALK_REQ {
    SHINE_XY_TYPE from;
    uint8_t _pad_at_0000[8];
    SHINE_XY_TYPE to;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_ACT_WALK_REQ) == 16, "PROTO_NC_ACT_WALK_REQ size drift");

struct PROTO_NC_ACT_WEDDING_AGREEMENT_DIVORCE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_WEDDING_AGREEMENT_DIVORCE_ACK) == 2, "PROTO_NC_ACT_WEDDING_AGREEMENT_DIVORCE_ACK size drift");

struct PROTO_NC_ACT_WEDDING_COMPULSORY_DIVORCE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_WEDDING_COMPULSORY_DIVORCE_ACK) == 2, "PROTO_NC_ACT_WEDDING_COMPULSORY_DIVORCE_ACK size drift");

struct PROTO_NC_ACT_WEDDING_COUPLE_ENTRANCE_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_COUPLE_ENTRANCE_RNG) == 16, "PROTO_NC_ACT_WEDDING_COUPLE_ENTRANCE_RNG size drift");

struct PROTO_NC_ACT_WEDDING_HALL_GUEST_ENTER_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_ACT_WEDDING_HALL_GUEST_ENTER_ACK) == 2, "PROTO_NC_ACT_WEDDING_HALL_GUEST_ENTER_ACK size drift");

struct PROTO_NC_ACT_WEDDING_HALL_GUEST_ENTER_READY_ACK {
    uint8_t _pad_at_0000[2];
    Name5 GroomID;
    uint8_t _pad_at_0002[20];
    Name5 BrideID;
    uint8_t _pad_at_0016[44];
    tm tm_EnterStart;
    uint8_t _pad_at_0042[36];
    tm tm_WeddingStart;
    uint8_t _pad_at_0066[36];
    tm tm_WeddingEnd;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_HALL_GUEST_ENTER_READY_ACK) == 174, "PROTO_NC_ACT_WEDDING_HALL_GUEST_ENTER_READY_ACK size drift");

struct PROTO_NC_ACT_WEDDING_HALL_RESERV_ACK {
    uint8_t _pad_at_0000[10];
    tm tm_ReservedTime;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_HALL_RESERV_ACK) == 46, "PROTO_NC_ACT_WEDDING_HALL_RESERV_ACK size drift");

struct PROTO_NC_ACT_WEDDING_PROPOSEACK_ACK {
    uint8_t _pad_at_0000[3];
    wchar_t response_word[37];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_PROPOSEACK_ACK) == 40, "PROTO_NC_ACT_WEDDING_PROPOSEACK_ACK size drift");

struct PROTO_NC_ACT_WEDDING_PROPOSEACK_REQ {
    uint8_t _pad_at_0000[2];
    wchar_t propose_word[37];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_PROPOSEACK_REQ) == 39, "PROTO_NC_ACT_WEDDING_PROPOSEACK_REQ size drift");

struct PROTO_NC_ACT_WEDDING_PROPOSEREQ_ACK {
    uint8_t _pad_at_0000[4];
    wchar_t response_word[37];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_PROPOSEREQ_ACK) == 41, "PROTO_NC_ACT_WEDDING_PROPOSEREQ_ACK size drift");

struct PROTO_NC_ACT_WEDDING_PROPOSEREQ_REQ {
    uint8_t _pad_at_0000[2];
    wchar_t propose_word[37];
};
static_assert(sizeof(PROTO_NC_ACT_WEDDING_PROPOSEREQ_REQ) == 39, "PROTO_NC_ACT_WEDDING_PROPOSEREQ_REQ size drift");

struct PROTO_NC_ACT_WEDDING_SOMEONE { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_ACT_WEDDING_SOMEONE) == 4, "PROTO_NC_ACT_WEDDING_SOMEONE size drift");

struct PROTO_NC_ACT_WHISPERFAIL_ACK {
    uint8_t _pad_at_0000[2];
    Name5 receiver;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_ACT_WHISPERFAIL_ACK) == 22, "PROTO_NC_ACT_WHISPERFAIL_ACK size drift");

struct PROTO_NC_ACT_WHISPERSUCCESS_ACK {
    uint8_t _pad_at_0000[1];
    Name5 receiver;
    uint8_t _pad_at_0001[21];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_WHISPERSUCCESS_ACK) == 22, "PROTO_NC_ACT_WHISPERSUCCESS_ACK size drift");

struct PROTO_NC_ACT_WHISPER_REQ {
    uint8_t _pad_at_0000[1];
    Name5 receiver;
    uint8_t _pad_at_0001[21];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_ACT_WHISPER_REQ) == 22, "PROTO_NC_ACT_WHISPER_REQ size drift");

struct PROTO_NC_ANNOUNCE_W2C_CMD {
    ANNOUNCE_MESSAGE AnnounceMessage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_ANNOUNCE_W2C_CMD) == 2, "PROTO_NC_ANNOUNCE_W2C_CMD size drift");

struct PROTO_NC_ANNOUNCE_Z2W_CMD {
    ANNOUNCE_MESSAGE AnnounceMessage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_ANNOUNCE_Z2W_CMD) == 2, "PROTO_NC_ANNOUNCE_Z2W_CMD size drift");

struct PROTO_NC_AVATAR_CREATEDATAFAIL_ACK {
    Name5 charid;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATEDATAFAIL_ACK) == 22, "PROTO_NC_AVATAR_CREATEDATAFAIL_ACK size drift");

struct PROTO_NC_AVATAR_CREATEDATASUC_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_AVATARINFORMATION_______0_bytes___ avatar;
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATEDATASUC_ACK) == 1, "PROTO_NC_AVATAR_CREATEDATASUC_ACK size drift");

struct PROTO_NC_AVATAR_CREATE_REQ {
    uint8_t _pad_at_0000[1];
    Name5 name;
    uint8_t _pad_at_0001[20];
    PROTO_AVATAR_SHAPE_INFO char_shape;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATE_REQ) == 25, "PROTO_NC_AVATAR_CREATE_REQ size drift");

struct PROTO_NC_AVATAR_CREATEDATA_REQ {
    NETPACKETHEADER netpacketheader;
    uint8_t _pad_at_0002[6];
    PROTO_NC_AVATAR_CREATE_REQ clientdata;
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATEDATA_REQ) == 33, "PROTO_NC_AVATAR_CREATEDATA_REQ size drift");

struct PROTO_NC_AVATAR_CREATEDATA_REQ_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_CREATEDATA_REQ req;
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATEDATA_REQ_SEND) == 36, "PROTO_NC_AVATAR_CREATEDATA_REQ_SEND size drift");

struct PROTO_NC_AVATAR_CREATEFAIL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_AVATAR_CREATEFAIL_ACK) == 2, "PROTO_NC_AVATAR_CREATEFAIL_ACK size drift");

struct PROTO_NC_AVATAR_CREATEFAIL_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_CREATEFAIL_ACK ack;
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATEFAIL_ACK_SEND) == 5, "PROTO_NC_AVATAR_CREATEFAIL_ACK_SEND size drift");

struct PROTO_NC_AVATAR_CREATESUCC_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_AVATARINFORMATION avatar;
    uint8_t _tail[130];
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATESUCC_ACK) == 131, "PROTO_NC_AVATAR_CREATESUCC_ACK size drift");

struct PROTO_NC_AVATAR_CREATESUCC_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_CREATESUCC_ACK ack;
};
static_assert(sizeof(PROTO_NC_AVATAR_CREATESUCC_ACK_SEND) == 134, "PROTO_NC_AVATAR_CREATESUCC_ACK_SEND size drift");

struct PROTO_NC_AVATAR_ERASEDATAFAIL_ACK {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_AVATAR_ERASEDATAFAIL_ACK) == 4, "PROTO_NC_AVATAR_ERASEDATAFAIL_ACK size drift");

struct PROTO_NC_AVATAR_ERASEDATASUC_ACK {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[13];
};
static_assert(sizeof(PROTO_NC_AVATAR_ERASEDATASUC_ACK) == 15, "PROTO_NC_AVATAR_ERASEDATASUC_ACK size drift");

struct PROTO_NC_AVATAR_ERASEDATA_REQ {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[13];
};
static_assert(sizeof(PROTO_NC_AVATAR_ERASEDATA_REQ) == 15, "PROTO_NC_AVATAR_ERASEDATA_REQ size drift");

struct PROTO_NC_AVATAR_ERASEDATA_REQ_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_ERASEDATA_REQ req;
};
static_assert(sizeof(PROTO_NC_AVATAR_ERASEDATA_REQ_SEND) == 18, "PROTO_NC_AVATAR_ERASEDATA_REQ_SEND size drift");

struct PROTO_NC_AVATAR_ERASEFAIL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_AVATAR_ERASEFAIL_ACK) == 2, "PROTO_NC_AVATAR_ERASEFAIL_ACK size drift");

struct PROTO_NC_AVATAR_ERASEFAIL_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_ERASEFAIL_ACK ack;
};
static_assert(sizeof(PROTO_NC_AVATAR_ERASEFAIL_ACK_SEND) == 5, "PROTO_NC_AVATAR_ERASEFAIL_ACK_SEND size drift");

struct PROTO_NC_AVATAR_ERASESUC_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_AVATAR_ERASESUC_ACK) == 1, "PROTO_NC_AVATAR_ERASESUC_ACK size drift");

struct PROTO_NC_AVATAR_ERASESUC_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_ERASESUC_ACK ack;
};
static_assert(sizeof(PROTO_NC_AVATAR_ERASESUC_ACK_SEND) == 4, "PROTO_NC_AVATAR_ERASESUC_ACK_SEND size drift");

struct PROTO_NC_AVATAR_ERASE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_AVATAR_ERASE_REQ) == 1, "PROTO_NC_AVATAR_ERASE_REQ size drift");

struct PROTO_NC_AVATAR_GUILD_DATA_ACK {
    uint8_t _pad_at_0000[9];
    GUILD_CLIENT_______0_bytes___ Guild;
};
static_assert(sizeof(PROTO_NC_AVATAR_GUILD_DATA_ACK) == 9, "PROTO_NC_AVATAR_GUILD_DATA_ACK size drift");

struct PROTO_NC_AVATAR_GUILD_DATA_REQ {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_AVATAR_GUILD_DATA_REQ) == 7, "PROTO_NC_AVATAR_GUILD_DATA_REQ size drift");

struct PROTO_NC_AVATAR_GUILD_DATA_REQ_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_AVATAR_GUILD_DATA_REQ req;
};
static_assert(sizeof(PROTO_NC_AVATAR_GUILD_DATA_REQ_SEND) == 10, "PROTO_NC_AVATAR_GUILD_DATA_REQ_SEND size drift");

struct PROTO_NC_AVATAR_GUILD_MEMBER_DATA_ACK {
    uint8_t _pad_at_0000[14];
    GUILD_MEMEBER_INFO_______0_bytes___ MemberList;
};
static_assert(sizeof(PROTO_NC_AVATAR_GUILD_MEMBER_DATA_ACK) == 14, "PROTO_NC_AVATAR_GUILD_MEMBER_DATA_ACK size drift");

struct PROTO_NC_AVATAR_GUILD_MEMBER_DATA_REQ {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[9];
};
static_assert(sizeof(PROTO_NC_AVATAR_GUILD_MEMBER_DATA_REQ) == 11, "PROTO_NC_AVATAR_GUILD_MEMBER_DATA_REQ size drift");

struct PROTO_NC_AVATAR_RENAME_ACK {
    uint8_t _pad_at_0000[1];
    Name5 NewName;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_AVATAR_RENAME_ACK) == 23, "PROTO_NC_AVATAR_RENAME_ACK size drift");

struct PROTO_NC_AVATAR_RENAME_DB_ACK {
    NETPACKETHEADER NetPacketHeader;
    uint8_t _pad_at_0002[5];
    Name5 NewName;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_AVATAR_RENAME_DB_ACK) == 29, "PROTO_NC_AVATAR_RENAME_DB_ACK size drift");

struct PROTO_NC_AVATAR_RENAME_DB_REQ {
    NETPACKETHEADER NetPacketHeader;
    uint8_t _pad_at_0002[5];
    Name5 NewName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_AVATAR_RENAME_DB_REQ) == 27, "PROTO_NC_AVATAR_RENAME_DB_REQ size drift");

struct PROTO_NC_AVATAR_RENAME_REQ {
    uint8_t _pad_at_0000[1];
    Name5 NewName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_AVATAR_RENAME_REQ) == 21, "PROTO_NC_AVATAR_RENAME_REQ size drift");

struct PROTO_NC_BAT_ABSTATEINFORM_CMD {
    ABSTATEINDEX abstate;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_ABSTATEINFORM_CMD) == 8, "PROTO_NC_BAT_ABSTATEINFORM_CMD size drift");

struct PROTO_NC_BAT_ABSTATEINFORM_NOEFFECT_CMD {
    ABSTATEINDEX abstate;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_ABSTATEINFORM_NOEFFECT_CMD) == 8, "PROTO_NC_BAT_ABSTATEINFORM_NOEFFECT_CMD size drift");

struct PROTO_NC_BAT_ABSTATERESET_CMD {
    uint8_t _pad_at_0000[2];
    ABSTATEINDEX abstate;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_BAT_ABSTATERESET_CMD) == 6, "PROTO_NC_BAT_ABSTATERESET_CMD size drift");

struct PROTO_NC_BAT_ABSTATESET_CMD {
    uint8_t _pad_at_0000[2];
    ABSTATEINDEX abstate;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_BAT_ABSTATESET_CMD) == 6, "PROTO_NC_BAT_ABSTATESET_CMD size drift");

struct PROTO_NC_BAT_ABSTATE_ERASE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_ABSTATE_ERASE_ACK) == 2, "PROTO_NC_BAT_ABSTATE_ERASE_ACK size drift");

struct PROTO_NC_BAT_ABSTATE_ERASE_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_ABSTATE_ERASE_REQ) == 2, "PROTO_NC_BAT_ABSTATE_ERASE_REQ size drift");

struct PROTO_NC_BAT_APCHANGE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_APCHANGE_CMD) == 4, "PROTO_NC_BAT_APCHANGE_CMD size drift");

struct PROTO_NC_BAT_AREADOTDAMAGE_CMD {
    uint8_t _pad_at_0000[5];
    PROTO_NC_BAT_AREADOTDAMAGE_CMD__targetinfo_______0_bytes___ target;
};
static_assert(sizeof(PROTO_NC_BAT_AREADOTDAMAGE_CMD) == 5, "PROTO_NC_BAT_AREADOTDAMAGE_CMD size drift");

struct PROTO_NC_BAT_AREADOTDAMAGE_CMD__targetinfo { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_BAT_AREADOTDAMAGE_CMD__targetinfo) == 12, "PROTO_NC_BAT_AREADOTDAMAGE_CMD__targetinfo size drift");

struct PROTO_NC_BAT_ASSIST_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_ASSIST_ACK) == 2, "PROTO_NC_BAT_ASSIST_ACK size drift");

struct PROTO_NC_BAT_ASSIST_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_ASSIST_REQ) == 2, "PROTO_NC_BAT_ASSIST_REQ size drift");

struct PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_damage_ {
    uint32_t  iscritical;
    uint32_t  damage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_damage_) == 2, "PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_damage_ size drift");

struct PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_flag_ {
    uint32_t  actioncode;
    uint32_t  isresist;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_flag_) == 1, "PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_BASH_HITTED_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_damage_ damage;
    PROTO_NC_BAT_BASH_HITTED_CMD___unnamed_type_flag_ flag;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_HITTED_CMD) == 13, "PROTO_NC_BAT_BASH_HITTED_CMD size drift");

struct PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_damage_ {
    uint32_t  iscritical;
    uint32_t  damage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_damage_) == 2, "PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_damage_ size drift");

struct PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_flag_ {
    uint32_t  actioncode;
    uint32_t  isresist;
    uint32_t  isImmune;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_flag_) == 1, "PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_BASH_HIT_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_damage_ damage;
    PROTO_NC_BAT_BASH_HIT_CMD___unnamed_type_flag_ flag;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_HIT_CMD) == 13, "PROTO_NC_BAT_BASH_HIT_CMD size drift");

struct PROTO_NC_BAT_BASH_MISSED_CMD___unnamed_type_flag_ {
    uint32_t  actioncode;
    uint32_t  ismissed;
    uint32_t  isshieldblock;
    uint32_t  isresist;
    uint32_t  isImmune;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_MISSED_CMD___unnamed_type_flag_) == 1, "PROTO_NC_BAT_BASH_MISSED_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_BASH_MISSED_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_BASH_MISSED_CMD___unnamed_type_flag_ flag;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_MISSED_CMD) == 5, "PROTO_NC_BAT_BASH_MISSED_CMD size drift");

struct PROTO_NC_BAT_BASH_MISS_CMD___unnamed_type_flag_ {
    uint32_t  actioncode;
    uint32_t  ismissed;
    uint32_t  isshieldblock;
    uint32_t  isImmune;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_MISS_CMD___unnamed_type_flag_) == 1, "PROTO_NC_BAT_BASH_MISS_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_BASH_MISS_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_BASH_MISS_CMD___unnamed_type_flag_ flag;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_BASH_MISS_CMD) == 5, "PROTO_NC_BAT_BASH_MISS_CMD size drift");

struct PROTO_NC_BAT_CEASE_FIRE_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_CEASE_FIRE_CMD) == 2, "PROTO_NC_BAT_CEASE_FIRE_CMD size drift");

struct PROTO_NC_BAT_CLIENT_MOB_KILL_ANNOUNCE_CMD {
    MobKillAnnounceType nTextIndex;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_BAT_CLIENT_MOB_KILL_ANNOUNCE_CMD) == 4, "PROTO_NC_BAT_CLIENT_MOB_KILL_ANNOUNCE_CMD size drift");

struct PROTO_NC_BAT_DOTDAMAGE_CMD { uint8_t data[13]; };
static_assert(sizeof(PROTO_NC_BAT_DOTDAMAGE_CMD) == 13, "PROTO_NC_BAT_DOTDAMAGE_CMD size drift");

struct PROTO_NC_BAT_EXPGAIN_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_EXPGAIN_CMD) == 6, "PROTO_NC_BAT_EXPGAIN_CMD size drift");

struct PROTO_NC_BAT_EXPLOST_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_EXPLOST_CMD) == 4, "PROTO_NC_BAT_EXPLOST_CMD size drift");

struct PROTO_NC_BAT_FAMEGAIN_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_FAMEGAIN_CMD) == 4, "PROTO_NC_BAT_FAMEGAIN_CMD size drift");

struct PROTO_NC_BAT_HIT_REQ { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BAT_HIT_REQ) == 3, "PROTO_NC_BAT_HIT_REQ size drift");

struct PROTO_NC_BAT_HPCHANGE_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_HPCHANGE_CMD) == 6, "PROTO_NC_BAT_HPCHANGE_CMD size drift");

struct PROTO_NC_BAT_LEVELUP_CMD {
    uint8_t _pad_at_0000[3];
    CHAR_PARAMETER_DATA newparam;
    uint8_t _tail[232];
};
static_assert(sizeof(PROTO_NC_BAT_LEVELUP_CMD) == 235, "PROTO_NC_BAT_LEVELUP_CMD size drift");

struct PROTO_NC_BAT_LPCHANGE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_LPCHANGE_CMD) == 4, "PROTO_NC_BAT_LPCHANGE_CMD size drift");

struct PROTO_NC_BAT_MOBSLAYER_CMD {
    uint8_t _pad_at_0000[3];
    uint32_t slayers[0];
};
static_assert(sizeof(PROTO_NC_BAT_MOBSLAYER_CMD) == 3, "PROTO_NC_BAT_MOBSLAYER_CMD size drift");

struct PROTO_NC_BAT_PKINPKFIELD_CLIENT_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_BAT_PKINPKFIELD_CLIENT_CMD) == 8, "PROTO_NC_BAT_PKINPKFIELD_CLIENT_CMD size drift");

struct PROTO_NC_BAT_PKINPKFIELD_WMS_CMD { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_BAT_PKINPKFIELD_WMS_CMD) == 10, "PROTO_NC_BAT_PKINPKFIELD_WMS_CMD size drift");

struct PROTO_NC_BAT_REALLYKILL_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_REALLYKILL_CMD) == 4, "PROTO_NC_BAT_REALLYKILL_CMD size drift");

struct PROTO_NC_BAT_REFLECTIONDAMAGE_CMD { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_BAT_REFLECTIONDAMAGE_CMD) == 14, "PROTO_NC_BAT_REFLECTIONDAMAGE_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_CASTABORT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_CASTABORT_ACK) == 2, "PROTO_NC_BAT_SKILLBASH_CASTABORT_ACK size drift");

struct PROTO_NC_BAT_SKILLBASH_CAST_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_CAST_REQ) == 4, "PROTO_NC_BAT_SKILLBASH_CAST_REQ size drift");

struct PROTO_NC_BAT_SKILLBASH_FLD_CAST_REQ {
    uint8_t _pad_at_0000[2];
    SHINE_XY_TYPE locate;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_FLD_CAST_REQ) == 10, "PROTO_NC_BAT_SKILLBASH_FLD_CAST_REQ size drift");

struct PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_flag_ {
    uint32_t  isdamage;
    uint32_t  iscritical;
    uint32_t  ismissed;
    uint32_t  isshieldblock;
    uint32_t  isheal;
    uint32_t  isenchant;
    uint32_t  isresist;
    uint32_t  IsCostumWeapon;
    uint8_t _pad_at_0000[1];
    uint32_t  isDead;
    uint32_t  IsCostumShield;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_flag_) == 2, "PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_SKILLBASH_HITTED_CMD {
    uint8_t _pad_at_0000[4];
    SHINE_XY_TYPE targetpoint;
    uint8_t _pad_at_0004[8];
    PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_flag_ flag;
    uint8_t _pad_at_000e[11];
    PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_target________0_bytes___ target;
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HITTED_CMD) == 25, "PROTO_NC_BAT_SKILLBASH_HITTED_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_target_ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_target_) == 8, "PROTO_NC_BAT_SKILLBASH_HITTED_CMD___unnamed_type_target_ size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_BLAST_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_BLAST_CMD) == 6, "PROTO_NC_BAT_SKILLBASH_HIT_BLAST_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_CMD {
    uint8_t _pad_at_0000[3];
    SHINE_XY_TYPE targetpoint;
    uint8_t _pad_at_0003[8];
    PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target________0_bytes___ target;
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_CMD) == 11, "PROTO_NC_BAT_SKILLBASH_HIT_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_ {
    uint32_t  isdamage;
    uint32_t  iscritical;
    uint32_t  ismissed;
    uint32_t  isshieldblock;
    uint32_t  isheal;
    uint32_t  isenchant;
    uint32_t  isresist;
    uint32_t  IsCostumWeapon;
    uint8_t _pad_at_0000[1];
    uint32_t  isDead;
    uint32_t  isCostumShield;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_) == 2, "PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target_ {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_ flag;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target_) == 14, "PROTO_NC_BAT_SKILLBASH_HIT_CMD___unnamed_type_target_ size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD {
    uint8_t _pad_at_0000[9];
    PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage_______0_bytes___ target;
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD) == 9, "PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage___unnamed_type_flag_ {
    uint32_t  isdamage;
    uint32_t  iscritical;
    uint32_t  ismissed;
    uint32_t  isshieldblock;
    uint32_t  isheal;
    uint32_t  isenchant;
    uint32_t  isresist;
    uint32_t  IsCostumWeapon;
    uint8_t _pad_at_0000[1];
    uint32_t  isDead;
    uint32_t  isImmune;
    uint32_t  IsCostumShield;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage___unnamed_type_flag_) == 2, "PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage___unnamed_type_flag_ flag;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage) == 14, "PROTO_NC_BAT_SKILLBASH_HIT_DAMAGE_CMD__SkillDamage size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_FLD_START_CMD {
    uint8_t _pad_at_0000[2];
    SHINE_XY_TYPE targetloc;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_FLD_START_CMD) == 12, "PROTO_NC_BAT_SKILLBASH_HIT_FLD_START_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_HIT_OBJ_START_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_HIT_OBJ_START_CMD) == 6, "PROTO_NC_BAT_SKILLBASH_HIT_OBJ_START_CMD size drift");

struct PROTO_NC_BAT_SKILLBASH_OBJ_CAST_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBASH_OBJ_CAST_REQ) == 4, "PROTO_NC_BAT_SKILLBASH_OBJ_CAST_REQ size drift");

struct PROTO_NC_BAT_SKILLBLAST_LIGHTNINGWAVE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLBLAST_LIGHTNINGWAVE_CMD) == 8, "PROTO_NC_BAT_SKILLBLAST_LIGHTNINGWAVE_CMD size drift");

struct PROTO_NC_BAT_SKILLCAST_FAIL_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLCAST_FAIL_ACK) == 1, "PROTO_NC_BAT_SKILLCAST_FAIL_ACK size drift");

struct PROTO_NC_BAT_SKILLCAST_REQ { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLCAST_REQ) == 5, "PROTO_NC_BAT_SKILLCAST_REQ size drift");

struct PROTO_NC_BAT_SKILLCAST_SUC_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLCAST_SUC_ACK) == 1, "PROTO_NC_BAT_SKILLCAST_SUC_ACK size drift");

struct PROTO_NC_BAT_SKILLENCHANT_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLENCHANT_REQ) == 4, "PROTO_NC_BAT_SKILLENCHANT_REQ size drift");

struct PROTO_NC_BAT_SKILLSMASH_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLSMASH_CMD) == 5, "PROTO_NC_BAT_SKILLSMASH_CMD size drift");

struct PROTO_NC_BAT_SKILLSMASH_ENCHANT_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLSMASH_ENCHANT_CMD) == 3, "PROTO_NC_BAT_SKILLSMASH_ENCHANT_CMD size drift");

struct PROTO_NC_BAT_SKILLSMASH_HIT_CMD___unnamed_type_damage_ {
    uint32_t  isdead;
    uint32_t  iscritical;
    uint32_t  damage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLSMASH_HIT_CMD___unnamed_type_damage_) == 2, "PROTO_NC_BAT_SKILLSMASH_HIT_CMD___unnamed_type_damage_ size drift");

struct PROTO_NC_BAT_SKILLSMASH_HIT_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_BAT_SKILLSMASH_HIT_CMD___unnamed_type_damage_ damage;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SKILLSMASH_HIT_CMD) == 7, "PROTO_NC_BAT_SKILLSMASH_HIT_CMD size drift");

struct PROTO_NC_BAT_SKILLSMASH_HITTED_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SKILLSMASH_HIT_CMD hitted;
};
static_assert(sizeof(PROTO_NC_BAT_SKILLSMASH_HITTED_CMD) == 9, "PROTO_NC_BAT_SKILLSMASH_HITTED_CMD size drift");

struct PROTO_NC_BAT_SKILLSMASH_MISS_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BAT_SKILLSMASH_MISS_CMD) == 3, "PROTO_NC_BAT_SKILLSMASH_MISS_CMD size drift");

struct PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted____unnamed_type_damage_ {
    uint32_t  isdead;
    uint32_t  iscritical;
    uint32_t  damage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted____unnamed_type_damage_) == 2, "PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted____unnamed_type_damage_ size drift");

struct PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted_ {
    PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted____unnamed_type_damage_ damage;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted_) == 3, "PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted_ size drift");

struct PROTO_NC_BAT_SMASH_HITTED_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SMASH_HITTED_ACK___unnamed_type_hitted_ hitted;
};
static_assert(sizeof(PROTO_NC_BAT_SMASH_HITTED_ACK) == 5, "PROTO_NC_BAT_SMASH_HITTED_ACK size drift");

struct PROTO_NC_BAT_SMASH_HIT_ACK___unnamed_type_damage_ {
    uint32_t  isdead;
    uint32_t  iscritical;
    uint32_t  damage;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_SMASH_HIT_ACK___unnamed_type_damage_) == 2, "PROTO_NC_BAT_SMASH_HIT_ACK___unnamed_type_damage_ size drift");

struct PROTO_NC_BAT_SMASH_HIT_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SMASH_HIT_ACK___unnamed_type_damage_ damage;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SMASH_HIT_ACK) == 5, "PROTO_NC_BAT_SMASH_HIT_ACK size drift");

struct PROTO_NC_BAT_SMASH_MISS_ACK { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BAT_SMASH_MISS_ACK) == 3, "PROTO_NC_BAT_SMASH_MISS_ACK size drift");

struct PROTO_NC_BAT_SMASH_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_SMASH_REQ) == 2, "PROTO_NC_BAT_SMASH_REQ size drift");

struct PROTO_NC_BAT_SOMEONEBASH_HIT_CMD { uint8_t data[13]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONEBASH_HIT_CMD) == 13, "PROTO_NC_BAT_SOMEONEBASH_HIT_CMD size drift");

struct PROTO_NC_BAT_SOMEONEBASH_MISS_CMD { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONEBASH_MISS_CMD) == 7, "PROTO_NC_BAT_SOMEONEBASH_MISS_CMD size drift");

struct PROTO_NC_BAT_SOMEONEDAMAGED_LARGE_CMD { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONEDAMAGED_LARGE_CMD) == 7, "PROTO_NC_BAT_SOMEONEDAMAGED_LARGE_CMD size drift");

struct PROTO_NC_BAT_SOMEONEDAMAGED_SMALL_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONEDAMAGED_SMALL_CMD) == 6, "PROTO_NC_BAT_SOMEONEDAMAGED_SMALL_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_CASTCUT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_CASTCUT_CMD) == 2, "PROTO_NC_BAT_SOMEONESKILLBASH_CASTCUT_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_CAST_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_CAST_CMD) == 6, "PROTO_NC_BAT_SOMEONESKILLBASH_CAST_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_FLD_CAST_CMD {
    uint8_t _pad_at_0000[4];
    SHINE_XY_TYPE loc;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_FLD_CAST_CMD) == 12, "PROTO_NC_BAT_SOMEONESKILLBASH_FLD_CAST_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD {
    uint8_t _pad_at_0000[4];
    SHINE_XY_TYPE targetpoint;
    uint8_t _pad_at_0004[9];
    PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target________0_bytes___ target;
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD) == 13, "PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_ {
    uint32_t  isdamage;
    uint32_t  ismissed;
    uint32_t  isheal;
    uint32_t  isenchant;
    uint32_t  damagedisplay;
    uint32_t  isDead;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_) == 1, "PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target_ {
    uint8_t _pad_at_0000[10];
    PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target____unnamed_type_flag_ flag;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target_) == 13, "PROTO_NC_BAT_SOMEONESKILLBASH_HIT_CMD___unnamed_type_target_ size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_HIT_FLD_START_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SKILLBASH_HIT_FLD_START_CMD castinfo;
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_HIT_FLD_START_CMD) == 14, "PROTO_NC_BAT_SOMEONESKILLBASH_HIT_FLD_START_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_HIT_OBJ_START_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SKILLBASH_HIT_OBJ_START_CMD castinfo;
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_HIT_OBJ_START_CMD) == 8, "PROTO_NC_BAT_SOMEONESKILLBASH_HIT_OBJ_START_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLBASH_OBJ_CAST_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLBASH_OBJ_CAST_CMD) == 6, "PROTO_NC_BAT_SOMEONESKILLBASH_OBJ_CAST_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLCASTCUT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLCASTCUT_CMD) == 2, "PROTO_NC_BAT_SOMEONESKILLCASTCUT_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLCAST_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLCAST_CMD) == 6, "PROTO_NC_BAT_SOMEONESKILLCAST_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLENCHANT_REQ {
    uint8_t _pad_at_0000[2];
    PROTO_NC_BAT_SKILLENCHANT_REQ skillenchant;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLENCHANT_REQ) == 8, "PROTO_NC_BAT_SOMEONESKILLENCHANT_REQ size drift");

struct PROTO_NC_BAT_SOMEONESKILLSMASH_DAMAGED_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLSMASH_DAMAGED_CMD) == 6, "PROTO_NC_BAT_SOMEONESKILLSMASH_DAMAGED_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLSMASH_DEAD_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLSMASH_DEAD_CMD) == 6, "PROTO_NC_BAT_SOMEONESKILLSMASH_DEAD_CMD size drift");

struct PROTO_NC_BAT_SOMEONESKILLSMASH_ENCHANT_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESKILLSMASH_ENCHANT_CMD) == 6, "PROTO_NC_BAT_SOMEONESKILLSMASH_ENCHANT_CMD size drift");

struct PROTO_NC_BAT_SOMEONESMASH_DAMAGED_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_BAT_SOMEONESMASH_DAMAGED_CMD) == 5, "PROTO_NC_BAT_SOMEONESMASH_DAMAGED_CMD size drift");

struct PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD___unnamed_type_flag_ {
    uint32_t  isMissed;
    uint32_t  isCostumCharged;
    uint32_t  isCostumShieldCharged;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD___unnamed_type_flag_) == 1, "PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD___unnamed_type_flag_ flag;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD) == 13, "PROTO_NC_BAT_SOMEONESWING_DAMAGE_CMD size drift");

struct PROTO_NC_BAT_SOULCOLLECT_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BAT_SOULCOLLECT_CMD) == 3, "PROTO_NC_BAT_SOULCOLLECT_CMD size drift");

struct PROTO_NC_BAT_SPCHANGE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_SPCHANGE_CMD) == 4, "PROTO_NC_BAT_SPCHANGE_CMD size drift");

struct PROTO_NC_BAT_SUMEONELEVELUP_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_BAT_SUMEONELEVELUP_CMD) == 4, "PROTO_NC_BAT_SUMEONELEVELUP_CMD size drift");

struct PROTO_NC_BAT_SUMEONESKILLCUT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_SUMEONESKILLCUT_CMD) == 2, "PROTO_NC_BAT_SUMEONESKILLCUT_CMD size drift");

struct PROTO_NC_BAT_SWING_DAMAGE_CMD___unnamed_type_flag_ {
    uint32_t  iscritical;
    uint32_t  isresist;
    uint32_t  ismissed;
    uint32_t  isshieldblock;
    uint32_t  isCostumCharged;
    uint32_t  isDead;
    uint32_t  isDamege2Heal;
    uint32_t  isImmune;
    uint8_t _pad_at_0000[1];
    uint32_t  isCostumShieldCharged;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BAT_SWING_DAMAGE_CMD___unnamed_type_flag_) == 2, "PROTO_NC_BAT_SWING_DAMAGE_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BAT_SWING_DAMAGE_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_BAT_SWING_DAMAGE_CMD___unnamed_type_flag_ flag;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_BAT_SWING_DAMAGE_CMD) == 16, "PROTO_NC_BAT_SWING_DAMAGE_CMD size drift");

struct PROTO_NC_BAT_SWING_START_CMD { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_BAT_SWING_START_CMD) == 9, "PROTO_NC_BAT_SWING_START_CMD size drift");

struct PROTO_NC_BAT_TARGETCHANGE_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_TARGETCHANGE_CMD) == 2, "PROTO_NC_BAT_TARGETCHANGE_CMD size drift");

struct PROTO_NC_BAT_TARGETINFO_CMD { uint8_t data[30]; };
static_assert(sizeof(PROTO_NC_BAT_TARGETINFO_CMD) == 30, "PROTO_NC_BAT_TARGETINFO_CMD size drift");

struct PROTO_NC_BAT_TARGET_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_TARGET_REQ) == 2, "PROTO_NC_BAT_TARGET_REQ size drift");

struct PROTO_NC_BAT_TOGGLESKILL_OFF_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_TOGGLESKILL_OFF_CMD) == 2, "PROTO_NC_BAT_TOGGLESKILL_OFF_CMD size drift");

struct PROTO_NC_BAT_TOGGLESKILL_ON_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BAT_TOGGLESKILL_ON_CMD) == 2, "PROTO_NC_BAT_TOGGLESKILL_ON_CMD size drift");

struct PROTO_NC_BAT_WORLD_MOB_KILL_ANNOUNCE_CMD {
    MobKillAnnounceType nTextIndex;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_BAT_WORLD_MOB_KILL_ANNOUNCE_CMD) == 4, "PROTO_NC_BAT_WORLD_MOB_KILL_ANNOUNCE_CMD size drift");

struct PROTO_NC_BOOTH_BUYREFRESH_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BOOTH_BUYREFRESH_CMD) == 3, "PROTO_NC_BOOTH_BUYREFRESH_CMD size drift");

struct PROTO_NC_BOOTH_CLOSE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BOOTH_CLOSE_ACK) == 2, "PROTO_NC_BOOTH_CLOSE_ACK size drift");

struct PROTO_NC_BOOTH_ENTRY_BUY_ACK {
    uint8_t _pad_at_0000[5];
    PROTO_NC_BOOTH_ENTRY_BUY_ACK__BoothItemList_______0_bytes___ items;
};
static_assert(sizeof(PROTO_NC_BOOTH_ENTRY_BUY_ACK) == 5, "PROTO_NC_BOOTH_ENTRY_BUY_ACK size drift");

struct PROTO_NC_BOOTH_ENTRY_BUY_ACK__BoothItemList { uint8_t data[13]; };
static_assert(sizeof(PROTO_NC_BOOTH_ENTRY_BUY_ACK__BoothItemList) == 13, "PROTO_NC_BOOTH_ENTRY_BUY_ACK__BoothItemList size drift");

struct PROTO_NC_BOOTH_ENTRY_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BOOTH_ENTRY_REQ) == 2, "PROTO_NC_BOOTH_ENTRY_REQ size drift");

struct PROTO_NC_BOOTH_ENTRY_SELL_ACK {
    uint8_t _pad_at_0000[5];
    PROTO_NC_BOOTH_ENTRY_SELL_ACK__BoothItemList_______0_bytes___ items;
};
static_assert(sizeof(PROTO_NC_BOOTH_ENTRY_SELL_ACK) == 5, "PROTO_NC_BOOTH_ENTRY_SELL_ACK size drift");

struct PROTO_NC_BOOTH_ENTRY_SELL_ACK__BoothItemList {
    uint8_t _pad_at_0000[10];
    SHINE_ITEM_STRUCT item;
    uint8_t _tail[103];
};
static_assert(sizeof(PROTO_NC_BOOTH_ENTRY_SELL_ACK__BoothItemList) == 113, "PROTO_NC_BOOTH_ENTRY_SELL_ACK__BoothItemList size drift");

struct PROTO_NC_BOOTH_ITEMTRADE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BOOTH_ITEMTRADE_ACK) == 2, "PROTO_NC_BOOTH_ITEMTRADE_ACK size drift");

struct PROTO_NC_BOOTH_ITEMTRADE_REQ { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_BOOTH_ITEMTRADE_REQ) == 5, "PROTO_NC_BOOTH_ITEMTRADE_REQ size drift");

struct PROTO_NC_BOOTH_OPEN_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BOOTH_OPEN_ACK) == 2, "PROTO_NC_BOOTH_OPEN_ACK size drift");

struct PROTO_NC_BOOTH_OPEN_REQ___unnamed_type_flag_ {
    uint32_t  issell;
    uint32_t  itemnum;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BOOTH_OPEN_REQ___unnamed_type_flag_) == 1, "PROTO_NC_BOOTH_OPEN_REQ___unnamed_type_flag_ size drift");

struct PROTO_NC_BOOTH_OPEN_REQ {
    STREETBOOTH_SIGNBOARD signboard;
    uint8_t _pad_at_0000[30];
    PROTO_NC_BOOTH_OPEN_REQ___unnamed_type_flag_ flag;
    PROTO_NC_BOOTH_OPEN_REQ__BoothItem_______0_bytes___ items;
};
static_assert(sizeof(PROTO_NC_BOOTH_OPEN_REQ) == 31, "PROTO_NC_BOOTH_OPEN_REQ size drift");

struct PROTO_NC_BOOTH_OPEN_REQ__BoothItem { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_BOOTH_OPEN_REQ__BoothItem) == 12, "PROTO_NC_BOOTH_OPEN_REQ__BoothItem size drift");

struct PROTO_NC_BOOTH_REFRESH_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BOOTH_REFRESH_REQ) == 2, "PROTO_NC_BOOTH_REFRESH_REQ size drift");

struct PROTO_NC_BOOTH_SEARCH_BOOTH_CLOSED_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BOOTH_SEARCH_BOOTH_CLOSED_CMD) == 2, "PROTO_NC_BOOTH_SEARCH_BOOTH_CLOSED_CMD size drift");

struct PROTO_NC_BOOTH_SEARCH_BOOTH_POSITION_ACK {
    uint8_t _pad_at_0000[4];
    SHINE_XY_TYPE BoothPosition;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_BOOTH_SEARCH_BOOTH_POSITION_ACK) == 12, "PROTO_NC_BOOTH_SEARCH_BOOTH_POSITION_ACK size drift");

struct PROTO_NC_BOOTH_SEARCH_BOOTH_POSITION_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BOOTH_SEARCH_BOOTH_POSITION_REQ) == 6, "PROTO_NC_BOOTH_SEARCH_BOOTH_POSITION_REQ size drift");

struct PROTO_NC_BOOTH_SEARCH_ITEM_LIST_CATEGORIZED_ACK {
    uint8_t _pad_at_0000[3];
    BoothItemInfo_______0_bytes___ ItemList;
};
static_assert(sizeof(PROTO_NC_BOOTH_SEARCH_ITEM_LIST_CATEGORIZED_ACK) == 3, "PROTO_NC_BOOTH_SEARCH_ITEM_LIST_CATEGORIZED_ACK size drift");

struct PROTO_NC_BOOTH_SEARCH_ITEM_LIST_CATEGORIZED_REQ {
    MarketSearch Category;
    uint8_t _tail[6];
};
static_assert(sizeof(PROTO_NC_BOOTH_SEARCH_ITEM_LIST_CATEGORIZED_REQ) == 6, "PROTO_NC_BOOTH_SEARCH_ITEM_LIST_CATEGORIZED_REQ size drift");

struct PROTO_NC_BOOTH_SOMEONECLOSE_CMD {
    uint8_t _pad_at_0000[2];
    CHARBRIEFINFO_NOTCAMP shape;
    uint8_t _tail[43];
};
static_assert(sizeof(PROTO_NC_BOOTH_SOMEONECLOSE_CMD) == 45, "PROTO_NC_BOOTH_SOMEONECLOSE_CMD size drift");

struct PROTO_NC_BOOTH_SOMEONEINTERIORSTART_CMD {
    uint8_t _pad_at_0000[2];
    STREETBOOTH_SIGNBOARD signboard;
    uint8_t _tail[30];
};
static_assert(sizeof(PROTO_NC_BOOTH_SOMEONEINTERIORSTART_CMD) == 32, "PROTO_NC_BOOTH_SOMEONEINTERIORSTART_CMD size drift");

struct PROTO_NC_BOOTH_SOMEONEOPEN_CMD {
    uint8_t _pad_at_0000[2];
    CHARBRIEFINFO_CAMP tent;
    uint8_t _pad_at_0002[13];
    STREETBOOTH_SIGNBOARD signboard;
    uint8_t _tail[30];
};
static_assert(sizeof(PROTO_NC_BOOTH_SOMEONEOPEN_CMD) == 45, "PROTO_NC_BOOTH_SOMEONEOPEN_CMD size drift");

struct PROTO_NC_BRIEFINFO_ABSTATE_CHANGE_CMD {
    uint8_t _pad_at_0000[2];
    ABSTATE_INFORMATION info;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_ABSTATE_CHANGE_CMD) == 14, "PROTO_NC_BRIEFINFO_ABSTATE_CHANGE_CMD size drift");

struct PROTO_NC_BRIEFINFO_ABSTATE_CHANGE_LIST_CMD {
    uint8_t _pad_at_0000[3];
    ABSTATE_INFORMATION_______0_bytes___ infoList;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_ABSTATE_CHANGE_LIST_CMD) == 3, "PROTO_NC_BRIEFINFO_ABSTATE_CHANGE_LIST_CMD size drift");

struct PROTO_NC_BRIEFINFO_BRIEFINFODELETE_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_BRIEFINFO_BRIEFINFODELETE_CMD) == 2, "PROTO_NC_BRIEFINFO_BRIEFINFODELETE_CMD size drift");

struct PROTO_NC_BRIEFINFO_BUILDDOOR_CMD {
    uint8_t _pad_at_0000[4];
    SHINE_COORD_TYPE coord;
    uint8_t _pad_at_0004[10];
    Name8 blockindex;
    uint8_t _tail[34];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_BUILDDOOR_CMD) == 48, "PROTO_NC_BRIEFINFO_BUILDDOOR_CMD size drift");

struct PROTO_NC_BRIEFINFO_CHANGEDECORATE_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_BRIEFINFO_CHANGEDECORATE_CMD) == 5, "PROTO_NC_BRIEFINFO_CHANGEDECORATE_CMD size drift");

struct PROTO_NC_BRIEFINFO_CHANGEUPGRADE_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_BRIEFINFO_CHANGEUPGRADE_CMD) == 6, "PROTO_NC_BRIEFINFO_CHANGEUPGRADE_CMD size drift");

struct PROTO_NC_BRIEFINFO_CHANGEWEAPON_CMD {
    PROTO_NC_BRIEFINFO_CHANGEUPGRADE_CMD upgradeinfo;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_CHANGEWEAPON_CMD) == 9, "PROTO_NC_BRIEFINFO_CHANGEWEAPON_CMD size drift");

struct PROTO_NC_BRIEFINFO_CHARACTER_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_LOGINCHARACTER_CMD_______0_bytes___ chars;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_CHARACTER_CMD) == 1, "PROTO_NC_BRIEFINFO_CHARACTER_CMD size drift");

struct PROTO_NC_BRIEFINFO_DOOR_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_BUILDDOOR_CMD_______0_bytes___ doors;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_DOOR_CMD) == 1, "PROTO_NC_BRIEFINFO_DOOR_CMD size drift");

struct PROTO_NC_BRIEFINFO_DROPEDITEM_CMD___unnamed_type_attr_ {
    uint32_t  rareness;
    uint32_t  looting;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_DROPEDITEM_CMD___unnamed_type_attr_) == 1, "PROTO_NC_BRIEFINFO_DROPEDITEM_CMD___unnamed_type_attr_ size drift");

struct PROTO_NC_BRIEFINFO_DROPEDITEM_CMD {
    uint8_t _pad_at_0000[4];
    SHINE_XY_TYPE location;
    uint8_t _pad_at_0004[10];
    PROTO_NC_BRIEFINFO_DROPEDITEM_CMD___unnamed_type_attr_ attr;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_DROPEDITEM_CMD) == 15, "PROTO_NC_BRIEFINFO_DROPEDITEM_CMD size drift");

struct PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD___unnamed_type_flag_ {
    uint32_t  loop;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD___unnamed_type_flag_) == 1, "PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD {
    uint8_t _pad_at_0000[2];
    Name8 effectname;
    uint8_t _pad_at_0002[32];
    SHINE_COORD_TYPE coord;
    uint8_t _pad_at_0022[13];
    PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD___unnamed_type_flag_ flag;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD) == 48, "PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD size drift");

struct PROTO_NC_BRIEFINFO_EFFECT_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_EFFECTBLAST_CMD_______0_bytes___ effects;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_EFFECT_CMD) == 1, "PROTO_NC_BRIEFINFO_EFFECT_CMD size drift");

struct PROTO_NC_BRIEFINFO_INFORM_CMD {
    uint8_t _pad_at_0000[2];
    NETCOMMAND ReceiveNetCommand;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_INFORM_CMD) == 6, "PROTO_NC_BRIEFINFO_INFORM_CMD size drift");

struct PROTO_NC_BRIEFINFO_ITEMONFIELD_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_DROPEDITEM_CMD_______0_bytes___ items;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_ITEMONFIELD_CMD) == 1, "PROTO_NC_BRIEFINFO_ITEMONFIELD_CMD size drift");

struct CHARTITLE_BRIEFINFO { uint8_t data[4]; };
static_assert(sizeof(CHARTITLE_BRIEFINFO) == 4, "CHARTITLE_BRIEFINFO size drift");

struct PROTO_NC_BRIEFINFO_LOGINCHARACTER_CMD {
    uint8_t _pad_at_0000[2];
    Name5 charid;
    uint8_t _pad_at_0002[20];
    SHINE_COORD_TYPE coord;
    uint8_t _pad_at_0016[11];
    PROTO_AVATAR_SHAPE_INFO shape;
    uint8_t _pad_at_0021[4];
    PROTO_NC_BRIEFINFO_LOGINCHARACTER_CMD___unnamed_type_shapedata_ shapedata;
    uint8_t _pad_at_0025[47];
    STOPEMOTICON_DESCRIPT emoticon;
    uint8_t _pad_at_0054[3];
    CHARTITLE_BRIEFINFO chartitle;
    ABNORMAL_STATE_BIT abstatebit;
    uint8_t _pad_at_005b[111];
    wchar_t sAnimation[32];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_LOGINCHARACTER_CMD) == 239, "PROTO_NC_BRIEFINFO_LOGINCHARACTER_CMD size drift");

struct PROTO_NC_BRIEFINFO_MAGICFIELDINFO_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_MAGICFIELDSPREAD_CMD_______0_bytes___ magicfield;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_MAGICFIELDINFO_CMD) == 1, "PROTO_NC_BRIEFINFO_MAGICFIELDINFO_CMD size drift");

struct PROTO_NC_BRIEFINFO_MAGICFIELDSPREAD_CMD {
    uint8_t _pad_at_0000[6];
    SHINE_XY_TYPE location;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_MAGICFIELDSPREAD_CMD) == 16, "PROTO_NC_BRIEFINFO_MAGICFIELDSPREAD_CMD size drift");

struct PROTO_NC_BRIEFINFO_MINIHOUSEBUILD_CMD {
    uint8_t _pad_at_0000[2];
    CHARBRIEFINFO_CAMP camp;
    uint8_t _pad_at_0002[12];
    Name5 charid;
    uint8_t _pad_at_000e[20];
    SHINE_COORD_TYPE coord;
    uint8_t _pad_at_0022[9];
    wchar_t title[21];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_MINIHOUSEBUILD_CMD) == 64, "PROTO_NC_BRIEFINFO_MINIHOUSEBUILD_CMD size drift");

struct PROTO_NC_BRIEFINFO_MINIHOUSE_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_MINIHOUSEBUILD_CMD_______0_bytes___ minihouse;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_MINIHOUSE_CMD) == 1, "PROTO_NC_BRIEFINFO_MINIHOUSE_CMD size drift");

struct PROTO_NC_BRIEFINFO_MOB_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_REGENMOB_CMD_______0_bytes___ mobs;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_MOB_CMD) == 1, "PROTO_NC_BRIEFINFO_MOB_CMD size drift");

struct PROTO_NC_BRIEFINFO_MOVER_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_REGENMOVER_CMD_______0_bytes___ Movers;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_MOVER_CMD) == 1, "PROTO_NC_BRIEFINFO_MOVER_CMD size drift");

struct PROTO_NC_BRIEFINFO_PET_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_REGENPET_CMD_______0_bytes___ Pets;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_PET_CMD) == 1, "PROTO_NC_BRIEFINFO_PET_CMD size drift");

struct PROTO_NC_BRIEFINFO_PLAYER_INFO_APPEAR_CMD {
    uint8_t _pad_at_0000[2];
    Name5 sID;
    uint8_t _pad_at_0002[20];
    CHARTITLE_BRIEFINFO CharTitle;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_PLAYER_INFO_APPEAR_CMD) == 30, "PROTO_NC_BRIEFINFO_PLAYER_INFO_APPEAR_CMD size drift");

struct PROTO_NC_BRIEFINFO_PLAYER_LIST_INFO_APPEAR_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_BRIEFINFO_PLAYER_INFO_APPEAR_CMD_______0_bytes___ PlayerInfo;
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_PLAYER_LIST_INFO_APPEAR_CMD) == 1, "PROTO_NC_BRIEFINFO_PLAYER_LIST_INFO_APPEAR_CMD size drift");

struct PROTO_NC_BRIEFINFO_REGENMOB_CMD {
    uint8_t _pad_at_0000[5];
    SHINE_COORD_TYPE coord;
    uint8_t _pad_at_0005[10];
    PROTO_NC_BRIEFINFO_REGENMOB_CMD___unnamed_type_flag_ flag;
    uint8_t _pad_at_000f[103];
    wchar_t sAnimation[32];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_REGENMOB_CMD) == 153, "PROTO_NC_BRIEFINFO_REGENMOB_CMD size drift");

struct PROTO_NC_BRIEFINFO_REGENMOVER_CMD {
    uint8_t _pad_at_0000[10];
    SHINE_COORD_TYPE nCoord;
    uint8_t _pad_at_000a[9];
    ABNORMAL_STATE_BIT AbstateBit;
    uint8_t _pad_at_0013[104];
    uint16_t nSlotHandle[10];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_REGENMOVER_CMD) == 143, "PROTO_NC_BRIEFINFO_REGENMOVER_CMD size drift");

struct PROTO_NC_BRIEFINFO_REGENPET_CMD {
    uint8_t _pad_at_0000[6];
    SHINE_COORD_TYPE XYDir;
    uint8_t _pad_at_0006[9];
    Name4 sPetName;
    uint8_t _pad_at_000f[16];
    wchar_t sAnimationIndex[32];
};
static_assert(sizeof(PROTO_NC_BRIEFINFO_REGENPET_CMD) == 63, "PROTO_NC_BRIEFINFO_REGENPET_CMD size drift");

struct PROTO_NC_BRIEFINFO_UNEQUIP_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_BRIEFINFO_UNEQUIP_CMD) == 3, "PROTO_NC_BRIEFINFO_UNEQUIP_CMD size drift");

struct PROTO_NC_CHARGED_BOOTHSLOTSIZE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHARGED_BOOTHSLOTSIZE_CMD) == 1, "PROTO_NC_CHARGED_BOOTHSLOTSIZE_CMD size drift");

struct PROTO_NC_CHARGED_BUFFTERMINATE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHARGED_BUFFTERMINATE_CMD) == 4, "PROTO_NC_CHARGED_BUFFTERMINATE_CMD size drift");

struct PROTO_NC_CHARGED_DELETEWEAPONTITLE_CMD {
    ITEM_INVEN licenseitem;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHARGED_DELETEWEAPONTITLE_CMD) == 2, "PROTO_NC_CHARGED_DELETEWEAPONTITLE_CMD size drift");

struct PROTO_NC_CHARGED_RESETBUFF_CMD { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_CHARGED_RESETBUFF_CMD) == 14, "PROTO_NC_CHARGED_RESETBUFF_CMD size drift");

struct PROTO_NC_CHARGED_SETBUFF_CMD {
    uint8_t _pad_at_0000[4];
    SHINE_ITEM_REGISTNUMBER ItemKey;
    uint8_t _pad_at_0004[10];
    PROTO_CHARGEDBUFF_INFO ChargedBuff;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_CHARGED_SETBUFF_CMD) == 32, "PROTO_NC_CHARGED_SETBUFF_CMD size drift");

struct PROTO_NC_CHARGED_SKILLEMPOW_INITIALIZE_DB_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[2];
    SHINE_ITEM_REGISTNUMBER restatitemkey;
    uint8_t _tail[13];
};
static_assert(sizeof(PROTO_NC_CHARGED_SKILLEMPOW_INITIALIZE_DB_REQ) == 21, "PROTO_NC_CHARGED_SKILLEMPOW_INITIALIZE_DB_REQ size drift");

struct PROTO_NC_CHARGED_STAT_INITIALIZE_DB_FAIL_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHARGED_STAT_INITIALIZE_DB_FAIL_ACK) == 10, "PROTO_NC_CHARGED_STAT_INITIALIZE_DB_FAIL_ACK size drift");

struct PROTO_NC_CHARGED_STAT_INITIALIZE_DB_SUC_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHARGED_STAT_INITIALIZE_DB_SUC_ACK) == 8, "PROTO_NC_CHARGED_STAT_INITIALIZE_DB_SUC_ACK size drift");

struct PROTO_NC_CHARGED_STAT_INITIALIZE_FAIL_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHARGED_STAT_INITIALIZE_FAIL_CMD) == 2, "PROTO_NC_CHARGED_STAT_INITIALIZE_FAIL_CMD size drift");

struct PROTO_NC_CHARGED_STAT_INITIALIZE_SUC_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHARGED_STAT_INITIALIZE_SUC_CMD) == 1, "PROTO_NC_CHARGED_STAT_INITIALIZE_SUC_CMD size drift");

struct PROTO_NC_CHARSAVE_ALL_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_ALL_ACK) == 6, "PROTO_NC_CHARSAVE_ALL_ACK size drift");

struct PROTO_NC_CHARSAVE_ABSTATE_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
    uint8_t _pad_at_0006[2];
    ABSTATEREADBLOCK_______0_bytes___ abstate;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_ABSTATE_REQ) == 8, "PROTO_NC_CHARSAVE_ABSTATE_REQ size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_ABSTATE_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHARSAVE_ABSTATE_REQ abstate;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_ABSTATE_CMD) == 10, "PROTO_NC_CHARSAVE_2WLDMAN_ABSTATE_CMD size drift");

struct PROTO_NC_CHARSAVE_LEVEL_CMD { uint8_t data[17]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_LEVEL_CMD) == 17, "PROTO_NC_CHARSAVE_LEVEL_CMD size drift");

struct PROTO_NC_CHARSAVE_LOCATION_CMD {
    uint8_t _pad_at_0000[4];
    Name3 map;
    uint8_t _pad_at_0004[12];
    SHINE_XY_TYPE coord;
    uint8_t _pad_at_0010[12];
    Name3 map_kq;
    uint8_t _pad_at_001c[12];
    SHINE_XY_TYPE coord_kq;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_LOCATION_CMD) == 48, "PROTO_NC_CHARSAVE_LOCATION_CMD size drift");

struct PROTO_NC_CHARSAVE_CHARSTAT_CMD {
    uint8_t _pad_at_0000[28];
    CHARSTATDISTSTR statdistribute;
    uint8_t _tail[6];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_CHARSTAT_CMD) == 34, "PROTO_NC_CHARSAVE_CHARSTAT_CMD size drift");

struct PROTO_NC_CHARSAVE_ALL_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
    PROTO_NC_CHARSAVE_LEVEL_CMD level;
    PROTO_NC_CHARSAVE_LOCATION_CMD location;
    PROTO_NC_CHARSAVE_CHARSTAT_CMD stat;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_ALL_REQ) == 105, "PROTO_NC_CHARSAVE_ALL_REQ size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_ALL_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHARSAVE_ALL_REQ all;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_ALL_CMD) == 107, "PROTO_NC_CHARSAVE_2WLDMAN_ALL_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_CHAT_COLOR_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_CHAT_COLOR_CMD) == 6, "PROTO_NC_CHARSAVE_2WLDMAN_CHAT_COLOR_CMD size drift");

struct PROTO_NC_CHAR_CHESTINFO_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
    uint8_t _pad_at_0006[2];
    uint16_t loc[0];
};
static_assert(sizeof(PROTO_NC_CHAR_CHESTINFO_REQ) == 8, "PROTO_NC_CHAR_CHESTINFO_REQ size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_CHESTINFO_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHAR_CHESTINFO_REQ chest;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_CHESTINFO_CMD) == 10, "PROTO_NC_CHARSAVE_2WLDMAN_CHESTINFO_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_COININFO_CMD { uint8_t data[22]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_COININFO_CMD) == 22, "PROTO_NC_CHARSAVE_2WLDMAN_COININFO_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_GAME_CMD {
    uint8_t _pad_at_0000[6];
    PROTO_GAMEDATA_CMD game;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_GAME_CMD) == 11, "PROTO_NC_CHARSAVE_2WLDMAN_GAME_CMD size drift");

struct PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_ACK {
    uint8_t _pad_at_0000[2];
    ActionCooltime_______0_bytes___ group;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_ACK) == 2, "PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_ACK size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_ITEMACTIONCOOLTIME_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_ACK ActionCoolTime;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_ITEMACTIONCOOLTIME_CMD) == 6, "PROTO_NC_CHARSAVE_2WLDMAN_ITEMACTIONCOOLTIME_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD___unnamed_type_PacketOrder_ {
    uint32_t  nPacketOrderNum;
    uint32_t  nIsLastOfInven;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD___unnamed_type_PacketOrder_) == 1, "PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD___unnamed_type_PacketOrder_ size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD {
    uint8_t _pad_at_0000[6];
    PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD___unnamed_type_PacketOrder_ PacketOrder;
    uint8_t _pad_at_0007[1];
    PROTO_ITEM_CMD itemstr;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD) == 9, "PROTO_NC_CHARSAVE_2WLDMAN_ITEM_CMD size drift");

struct PROTO_NC_CHAR_LINKFROM_CMD {
    uint8_t _pad_at_0000[4];
    Name3 map;
    uint8_t _pad_at_0004[12];
    SHINE_XY_TYPE coord;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_CHAR_LINKFROM_CMD) == 24, "PROTO_NC_CHAR_LINKFROM_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_LINK_FROM_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHAR_LINKFROM_CMD linkfrom;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_LINK_FROM_CMD) == 26, "PROTO_NC_CHARSAVE_2WLDMAN_LINK_FROM_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_MISC_CMD { uint8_t data[18]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_MISC_CMD) == 18, "PROTO_NC_CHARSAVE_2WLDMAN_MISC_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_PET_LINK_RESUMMON_CMD { uint8_t data[23]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_PET_LINK_RESUMMON_CMD) == 23, "PROTO_NC_CHARSAVE_2WLDMAN_PET_LINK_RESUMMON_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD__tagQUESTDOING {
    uint8_t _pad_at_0000[6];
    PLAYER_QUEST_INFO_______0_bytes___ QuestDoingArray;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD__tagQUESTDOING) == 6, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD__tagQUESTDOING size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD__tagQUESTDOING questdoing;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD) == 8, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DOING_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD__tagQUESTDONE {
    uint8_t _pad_at_0000[12];
    PLAYER_QUEST_DONE_INFO_______0_bytes___ QuestDoneArray;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD__tagQUESTDONE) == 12, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD__tagQUESTDONE size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD__tagQUESTDONE questdone;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD) == 14, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_DONE_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD__tagQUESTREAD {
    uint8_t _pad_at_0000[6];
    uint16_t QuestReadIDArray[0];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD__tagQUESTREAD) == 6, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD__tagQUESTREAD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD__tagQUESTREAD questread;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD) == 8, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_READ_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD__tagQUESTREPEAT {
    uint8_t _pad_at_0000[6];
    PLAYER_QUEST_INFO_______0_bytes___ QuestRepeatArray;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD__tagQUESTREPEAT) == 6, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD__tagQUESTREPEAT size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD__tagQUESTREPEAT questrepeat;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD) == 8, "PROTO_NC_CHARSAVE_2WLDMAN_QUEST_REPEAT_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_SINGLE_OPTION_CMD { uint8_t data[17]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_SINGLE_OPTION_CMD) == 17, "PROTO_NC_CHARSAVE_2WLDMAN_SINGLE_OPTION_CMD size drift");

struct PROTO_NC_CHARSAVE_SKILL_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
    uint8_t _pad_at_0006[2];
    PROTO_SKILLREADBLOCK_______0_bytes___ skill;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_SKILL_REQ) == 8, "PROTO_NC_CHARSAVE_SKILL_REQ size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_SKILL_CMD {
    uint8_t _pad_at_0000[2];
    PARTMARK PartMark;
    uint8_t _pad_at_0002[3];
    PROTO_NC_CHARSAVE_SKILL_REQ skill;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_SKILL_CMD) == 13, "PROTO_NC_CHARSAVE_2WLDMAN_SKILL_CMD size drift");

struct PROTO_NC_CHARSAVE_2WLDMAN_TITLE_CMD {
    uint8_t _pad_at_0000[6];
    CHARACTER_TITLE_READBLOCK CTData;
    uint8_t _tail[1063];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_2WLDMAN_TITLE_CMD) == 1069, "PROTO_NC_CHARSAVE_2WLDMAN_TITLE_CMD size drift");

struct PROTO_NC_CHARSAVE_CHAT_COLOR_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_CHAT_COLOR_CMD) == 6, "PROTO_NC_CHARSAVE_CHAT_COLOR_CMD size drift");

struct PROTO_NC_CHARSAVE_DB_UI_STATE_SAVE_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_DB_UI_STATE_SAVE_ACK) == 8, "PROTO_NC_CHARSAVE_DB_UI_STATE_SAVE_ACK size drift");

struct PROTO_NC_CHARSAVE_DB_UI_STATE_SAVE_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_DB_UI_STATE_SAVE_REQ) == 7, "PROTO_NC_CHARSAVE_DB_UI_STATE_SAVE_REQ size drift");

struct PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_REQ {
    uint8_t _pad_at_0000[2];
    ActionCooltime_______0_bytes___ group;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_REQ) == 2, "PROTO_NC_CHARSAVE_ITEMACTIONCOOLTIME_REQ size drift");

struct PROTO_NC_CHARSAVE_PKCOUNT_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_PKCOUNT_CMD) == 8, "PROTO_NC_CHARSAVE_PKCOUNT_CMD size drift");

struct PROTO_NC_CHARSAVE_QUEST_DOING_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
    uint8_t _pad_at_0006[2];
    PLAYER_QUEST_INFO_______0_bytes___ QuestDoingArray;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_QUEST_DOING_REQ) == 8, "PROTO_NC_CHARSAVE_QUEST_DOING_REQ size drift");

struct PROTO_NC_CHARSAVE_REST_EXP_LAST_EXEC_TIME_SAVE_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_REST_EXP_LAST_EXEC_TIME_SAVE_REQ) == 6, "PROTO_NC_CHARSAVE_REST_EXP_LAST_EXEC_TIME_SAVE_REQ size drift");

struct PROTO_NC_CHARSAVE_SELL_ITEM_INFO_CMD {
    uint8_t _pad_at_0000[7];
    PROTO_SELL_ITEM_INFO_SERVER_______0_bytes___ SellItemList;
};
static_assert(sizeof(PROTO_NC_CHARSAVE_SELL_ITEM_INFO_CMD) == 7, "PROTO_NC_CHARSAVE_SELL_ITEM_INFO_CMD size drift");

struct PROTO_NC_CHARSAVE_SET_CHAT_BLOCK_SPAMER_DB_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_SET_CHAT_BLOCK_SPAMER_DB_CMD) == 12, "PROTO_NC_CHARSAVE_SET_CHAT_BLOCK_SPAMER_DB_CMD size drift");

struct PROTO_NC_CHARSAVE_SET_CHAT_BLOCK_SPAMER_WM_CMD { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_SET_CHAT_BLOCK_SPAMER_WM_CMD) == 14, "PROTO_NC_CHARSAVE_SET_CHAT_BLOCK_SPAMER_WM_CMD size drift");

struct PROTO_NC_CHARSAVE_TITLE_REQ {
    PROTO_NC_CHARSAVE_ALL_ACK handle;
    CHARACTER_TITLE_DB_SAVE CTData;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_TITLE_REQ) == 8, "PROTO_NC_CHARSAVE_TITLE_REQ size drift");

struct PROTO_NC_CHARSAVE_UI_STATE_SAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_UI_STATE_SAVE_ACK) == 2, "PROTO_NC_CHARSAVE_UI_STATE_SAVE_ACK size drift");

struct PROTO_NC_CHARSAVE_UI_STATE_SAVE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHARSAVE_UI_STATE_SAVE_REQ) == 1, "PROTO_NC_CHARSAVE_UI_STATE_SAVE_REQ size drift");

struct PROTO_NC_CHARSAVE_USEITEM_MINIMON_INFO_DB_CMD {
    uint8_t _pad_at_0000[4];
    USEITEM_MINIMON_INFO UseItemMinimonInfo;
    uint8_t _pad_at_0004[50];
    uint8_t DelSlotList_Normal[12];
    uint8_t DelSlotList_Charged[12];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_USEITEM_MINIMON_INFO_DB_CMD) == 78, "PROTO_NC_CHARSAVE_USEITEM_MINIMON_INFO_DB_CMD size drift");

struct PROTO_NC_CHARSAVE_USEITEM_MINIMON_INFO_WORLD_CMD {
    uint8_t _pad_at_0000[6];
    USEITEM_MINIMON_INFO UseItemMinimonInfo;
    uint8_t _tail[50];
};
static_assert(sizeof(PROTO_NC_CHARSAVE_USEITEM_MINIMON_INFO_WORLD_CMD) == 56, "PROTO_NC_CHARSAVE_USEITEM_MINIMON_INFO_WORLD_CMD size drift");

struct PROTO_NC_CHAR_ABSTATE_CMD {
    uint8_t _pad_at_0000[6];
    ABSTATEREADBLOCK_______0_bytes___ abstate;
};
static_assert(sizeof(PROTO_NC_CHAR_ABSTATE_CMD) == 6, "PROTO_NC_CHAR_ABSTATE_CMD size drift");

struct PROTO_NC_CHAR_ADMIN_LEVEL_INFORM_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_ADMIN_LEVEL_INFORM_CMD) == 1, "PROTO_NC_CHAR_ADMIN_LEVEL_INFORM_CMD size drift");

struct PROTO_NC_CHAR_ANI_FILE_CHECK_CMD {
    Name8 Checksum;
    uint8_t _pad_at_0000[32];
    Name8 SubDirectory;
    uint8_t _pad_at_0020[32];
    Name60Byte Filename;
    uint8_t _tail[60];
};
static_assert(sizeof(PROTO_NC_CHAR_ANI_FILE_CHECK_CMD) == 124, "PROTO_NC_CHAR_ANI_FILE_CHECK_CMD size drift");

struct PROTO_NC_CHAR_ARENA_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_ARENA_CMD) == 1, "PROTO_NC_CHAR_ARENA_CMD size drift");

struct PROTO_NC_CHAR_BASEPARAMCHANGE_CMD {
    uint8_t _pad_at_0000[1];
    CHAR_PARAMCHANGE_CMD_______0_bytes___ param;
};
static_assert(sizeof(PROTO_NC_CHAR_BASEPARAMCHANGE_CMD) == 1, "PROTO_NC_CHAR_BASEPARAMCHANGE_CMD size drift");

struct PROTO_NC_CHAR_BASE_CMD__LoginLocation {
    Name3 currentmap;
    uint8_t _pad_at_0000[12];
    SHINE_COORD_TYPE currentcoord;
    uint8_t _tail[9];
};
static_assert(sizeof(PROTO_NC_CHAR_BASE_CMD__LoginLocation) == 21, "PROTO_NC_CHAR_BASE_CMD__LoginLocation size drift");

struct PROTO_NC_CHAR_BASE_CMD {
    uint8_t _pad_at_0000[4];
    Name5 charid;
    uint8_t _pad_at_0004[62];
    PROTO_NC_CHAR_BASE_CMD__LoginLocation logininfo;
    CHARSTATDISTSTR statdistribute;
    uint8_t _pad_at_0057[14];
    PROTO_NC_CHAR_BASE_CMD___unnamed_type_flags_ flags;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_BASE_CMD) == 105, "PROTO_NC_CHAR_BASE_CMD size drift");

struct PROTO_NC_CHAR_BASE_CMD___unnamed_type_flags____unnamed_type_str_ {
    uint32_t  skillempower_can_reset;
    uint32_t  restunion;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_BASE_CMD___unnamed_type_flags____unnamed_type_str_) == 4, "PROTO_NC_CHAR_BASE_CMD___unnamed_type_flags____unnamed_type_str_ size drift");

struct PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD {
    uint8_t _pad_at_0000[6];
    PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD__CardBookmarkInfo_______0_bytes___ ViewList;
};
static_assert(sizeof(PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD) == 6, "PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD size drift");

struct PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD__CardBookmarkInfo { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD__CardBookmarkInfo) == 4, "PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD__CardBookmarkInfo size drift");

struct PROTO_NC_CHAR_CARDCOLLECT_CMD {
    uint8_t _pad_at_0000[6];
    PROTO_NC_CHAR_CARDCOLLECT_CMD__CardInform_______0_bytes___ CardList;
};
static_assert(sizeof(PROTO_NC_CHAR_CARDCOLLECT_CMD) == 6, "PROTO_NC_CHAR_CARDCOLLECT_CMD size drift");

struct PROTO_NC_CHAR_CARDCOLLECT_CMD__CardInform { uint8_t data[11]; };
static_assert(sizeof(PROTO_NC_CHAR_CARDCOLLECT_CMD__CardInform) == 11, "PROTO_NC_CHAR_CARDCOLLECT_CMD__CardInform size drift");

struct PROTO_NC_CHAR_CARDCOLLECT_REWARD_CMD {
    uint8_t _pad_at_0000[6];
    uint16_t RewardID[0];
};
static_assert(sizeof(PROTO_NC_CHAR_CARDCOLLECT_REWARD_CMD) == 6, "PROTO_NC_CHAR_CARDCOLLECT_REWARD_CMD size drift");

struct PROTO_NC_CHAR_CENCHANGE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_CENCHANGE_CMD) == 8, "PROTO_NC_CHAR_CENCHANGE_CMD size drift");

struct PROTO_NC_CHAR_CHANGEBYCONDITION_PARAM_CMD {
    uint8_t _pad_at_0000[6];
    CHAR_CHANGEBYCONDITION_PARAM_______0_bytes___ aParam;
};
static_assert(sizeof(PROTO_NC_CHAR_CHANGEBYCONDITION_PARAM_CMD) == 6, "PROTO_NC_CHAR_CHANGEBYCONDITION_PARAM_CMD size drift");

struct PROTO_NC_CHAR_CHARDATAFAIL_ACK {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHAR_CHARDATAFAIL_ACK) == 4, "PROTO_NC_CHAR_CHARDATAFAIL_ACK size drift");

struct PROTO_NC_CHAR_CHARDATA_ACK {
    NETPACKETHEADER netpacketheader;
};
static_assert(sizeof(PROTO_NC_CHAR_CHARDATA_ACK) == 2, "PROTO_NC_CHAR_CHARDATA_ACK size drift");

struct PROTO_NC_CHAR_CHARDATA_REQ {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_CHAR_CHARDATA_REQ) == 14, "PROTO_NC_CHAR_CHARDATA_REQ size drift");

struct PROTO_NC_CHAR_CHARGEDBUFF_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_CHARGEDBUFF_INFO_______0_bytes___ ChargedBuff;
};
static_assert(sizeof(PROTO_NC_CHAR_CHARGEDBUFF_CMD) == 2, "PROTO_NC_CHAR_CHARGEDBUFF_CMD size drift");

struct PROTO_NC_CHAR_CHARGEDBUFF_ERASE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_CHARGEDBUFF_ERASE_ACK) == 2, "PROTO_NC_CHAR_CHARGEDBUFF_ERASE_ACK size drift");

struct PROTO_NC_CHAR_CHARGEDBUFF_ERASE_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_CHARGEDBUFF_ERASE_REQ) == 4, "PROTO_NC_CHAR_CHARGEDBUFF_ERASE_REQ size drift");

struct PROTO_NC_CHAR_CHAT_COLOR_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_CHAT_COLOR_CMD) == 6, "PROTO_NC_CHAR_CHAT_COLOR_CMD size drift");

struct PROTO_NC_CHAR_CHESTINFO_CMD {
    uint8_t _pad_at_0000[2];
    uint16_t location[0];
};
static_assert(sizeof(PROTO_NC_CHAR_CHESTINFO_CMD) == 2, "PROTO_NC_CHAR_CHESTINFO_CMD size drift");

struct PROTO_NC_CHAR_CLASSCHANGE_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_CLASSCHANGE_ACK) == 7, "PROTO_NC_CHAR_CLASSCHANGE_ACK size drift");

struct PROTO_NC_CHAR_CLASSCHANGE_CMD {
    NETPACKETZONEHEADER header;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_CHAR_CLASSCHANGE_CMD) == 9, "PROTO_NC_CHAR_CLASSCHANGE_CMD size drift");

struct PROTO_NC_CHAR_CLASSCHANGE_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHAR_CLASSCHANGE_REQ) == 8, "PROTO_NC_CHAR_CLASSCHANGE_REQ size drift");

struct PROTO_NC_CHAR_CLIENT_AUTO_PICK_ACK { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_AUTO_PICK_ACK) == 3, "PROTO_NC_CHAR_CLIENT_AUTO_PICK_ACK size drift");

struct PROTO_NC_CHAR_CLIENT_AUTO_PICK_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_AUTO_PICK_CMD) == 3, "PROTO_NC_CHAR_CLIENT_AUTO_PICK_CMD size drift");

struct PROTO_NC_CHAR_CLIENT_AUTO_PICK_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_AUTO_PICK_REQ) == 1, "PROTO_NC_CHAR_CLIENT_AUTO_PICK_REQ size drift");

struct PROTO_NC_CHAR_CLIENT_CHARTITLE_CMD {
    uint8_t _pad_at_0000[6];
    CT_INFO_______0_bytes___ TitleArray;
};
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_CHARTITLE_CMD) == 6, "PROTO_NC_CHAR_CLIENT_CHARTITLE_CMD size drift");

struct PROTO_NC_CHAR_CLIENT_ITEM_CMD___unnamed_type_flag_ {
    uint32_t  invenclear;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_ITEM_CMD___unnamed_type_flag_) == 1, "PROTO_NC_CHAR_CLIENT_ITEM_CMD___unnamed_type_flag_ size drift");

struct PROTO_NC_CHAR_CLIENT_ITEM_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHAR_CLIENT_ITEM_CMD___unnamed_type_flag_ flag;
    PROTO_ITEMPACKET_INFORM_______0_bytes___ ItemArray;
};
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_ITEM_CMD) == 3, "PROTO_NC_CHAR_CLIENT_ITEM_CMD size drift");

struct PROTO_NC_CHAR_SKILLCLIENT_CMD {
    uint8_t _pad_at_0000[6];
    PROTO_SKILLREADBLOCKCLIENT_______0_bytes___ skill;
};
static_assert(sizeof(PROTO_NC_CHAR_SKILLCLIENT_CMD) == 6, "PROTO_NC_CHAR_SKILLCLIENT_CMD size drift");

struct PROTO_NC_CHAR_CLIENT_SKILL_CMD {
    uint8_t _pad_at_0000[1];
    PARTMARK PartMark;
    uint8_t _pad_at_0001[3];
    PROTO_NC_CHAR_SKILLCLIENT_CMD skill;
};
static_assert(sizeof(PROTO_NC_CHAR_CLIENT_SKILL_CMD) == 10, "PROTO_NC_CHAR_CLIENT_SKILL_CMD size drift");

struct PROTO_NC_CHAR_COININFO_CMD { uint8_t data[16]; };
static_assert(sizeof(PROTO_NC_CHAR_COININFO_CMD) == 16, "PROTO_NC_CHAR_COININFO_CMD size drift");

struct PROTO_NC_CHAR_DATATRANSMISSION_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Proto_CharDataStruct data;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_DATATRANSMISSION_RNG) == 27, "PROTO_NC_CHAR_DATATRANSMISSION_RNG size drift");

struct PROTO_NC_CHAR_DB_AUTO_PICK_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_CHAR_DB_AUTO_PICK_CMD) == 5, "PROTO_NC_CHAR_DB_AUTO_PICK_CMD size drift");

struct PROTO_NC_CHAR_DB_NEWBIE_GUIDE_VIEW_SET_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_CHAR_DB_NEWBIE_GUIDE_VIEW_SET_CMD) == 5, "PROTO_NC_CHAR_DB_NEWBIE_GUIDE_VIEW_SET_CMD size drift");

struct PROTO_NC_CHAR_DB_REST_EXP_LAST_EXEC_TIME_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_DB_REST_EXP_LAST_EXEC_TIME_CMD) == 8, "PROTO_NC_CHAR_DB_REST_EXP_LAST_EXEC_TIME_CMD size drift");

struct PROTO_NC_CHAR_DEADMENU_CMD {
    uint8_t _pad_at_0000[5];
    DeadMenuType eMenuType;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_DEADMENU_CMD) == 9, "PROTO_NC_CHAR_DEADMENU_CMD size drift");

struct PROTO_NC_CHAR_EMBLEM_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_EMBLEM_CMD) == 1, "PROTO_NC_CHAR_EMBLEM_CMD size drift");

struct PROTO_NC_CHAR_EMPTY_INSTANCE_DUNGEON_RNG {
    ZONERINGLINKAGESTART Start;
    uint8_t _pad_at_0000[7];
    INSTANCE_DUNGEON__CATEGORY Category;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_EMPTY_INSTANCE_DUNGEON_RNG) == 11, "PROTO_NC_CHAR_EMPTY_INSTANCE_DUNGEON_RNG size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_CHANGE_DAY_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_CHANGE_DAY_CMD) == 1, "PROTO_NC_CHAR_EVENT_ATTENDANCE_CHANGE_DAY_CMD size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_CMD) == 1, "PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_CMD size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_DB_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_DB_ACK) == 6, "PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_DB_ACK size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_DB_REQ {
    uint8_t _pad_at_0000[4];
    tm tCheckTime;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_DB_REQ) == 40, "PROTO_NC_CHAR_EVENT_ATTENDANCE_CHECK_DB_REQ size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_CLIENT_CMD {
    tm tEventStart;
    uint8_t _pad_at_0000[37];
    uint8_t AttendanceArray[28];
    uint8_t _pad_at_0041[1];
    uint8_t RewardList[0];
};
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_CLIENT_CMD) == 66, "PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_CLIENT_CMD size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_DB_ACK {
    uint8_t _pad_at_0000[11];
    tm_______1008_bytes___ AttendanceArray;
    uint8_t _pad_at_000b[1009];
    uint8_t RewardList[0];
};
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_DB_ACK) == 1020, "PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_DB_ACK size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_DB_REQ {
    uint8_t _pad_at_0000[4];
    tm tmEventStartDate;
    uint8_t _pad_at_0004[36];
    tm tmEventEndDate;
    uint8_t _tail[40];
};
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_DB_REQ) == 80, "PROTO_NC_CHAR_EVENT_ATTENDANCE_LIST_DB_REQ size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_ACK) == 4, "PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_ACK size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_DB_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_DB_ACK) == 8, "PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_DB_ACK size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_DB_REQ {
    uint8_t _pad_at_0000[5];
    tm tmEventDay;
    uint8_t _pad_at_0005[37];
    tm tmCheckStartDay;
    uint8_t _pad_at_002a[36];
    tm tmCheckEndDay;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_DB_REQ) == 114, "PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_DB_REQ size drift");

struct PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_REQ) == 2, "PROTO_NC_CHAR_EVENT_ATTENDANCE_REWARD_REQ size drift");

struct PROTO_NC_CHAR_EXP_CHANGED_CMD { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_CHAR_EXP_CHANGED_CMD) == 14, "PROTO_NC_CHAR_EXP_CHANGED_CMD size drift");

struct PROTO_NC_CHAR_FAMECHANGE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_FAMECHANGE_CMD) == 4, "PROTO_NC_CHAR_FAMECHANGE_CMD size drift");

struct PROTO_NC_CHAR_FAMESAVE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_FAMESAVE_CMD) == 8, "PROTO_NC_CHAR_FAMESAVE_CMD size drift");

struct PROTO_NC_CHAR_FREESTAT_SET_DB_ACK {
    NETPACKETZONEHEADER header;
    uint8_t nFreeStat[5];
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_FREESTAT_SET_DB_ACK) == 15, "PROTO_NC_CHAR_FREESTAT_SET_DB_ACK size drift");

struct PROTO_NC_CHAR_FREESTAT_SET_DB_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[1];
    uint8_t nFreeStat[5];
    uint8_t _pad_at_000c[3];
    PROTO_NC_CHAR_FREESTAT_SET_DB_REQ___unnamed_type_DecItemInfo________0_bytes___ DecItemInfo;
};
static_assert(sizeof(PROTO_NC_CHAR_FREESTAT_SET_DB_REQ) == 15, "PROTO_NC_CHAR_FREESTAT_SET_DB_REQ size drift");

struct PROTO_NC_CHAR_FREESTAT_SET_DB_REQ___unnamed_type_DecItemInfo_ {
    uint8_t _pad_at_0000[1];
    SHINE_ITEM_REGISTNUMBER nItmeKey;
    uint8_t _tail[11];
};
static_assert(sizeof(PROTO_NC_CHAR_FREESTAT_SET_DB_REQ___unnamed_type_DecItemInfo_) == 12, "PROTO_NC_CHAR_FREESTAT_SET_DB_REQ___unnamed_type_DecItemInfo_ size drift");

struct PROTO_NC_CHAR_FRIEND_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHAR_FRIEND_CMD_INFO_______0_bytes___ friend_array;
};
static_assert(sizeof(PROTO_NC_CHAR_FRIEND_CMD) == 2, "PROTO_NC_CHAR_FRIEND_CMD size drift");

struct PROTO_NC_CHAR_FRIEND_CMD_INFO {
    uint8_t _pad_at_0000[4];
    Name5 charid;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_CHAR_FRIEND_CMD_INFO) == 25, "PROTO_NC_CHAR_FRIEND_CMD_INFO size drift");

struct PROTO_NC_CHAR_GET_CHAT_BLOCK_SPAMER_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_GET_CHAT_BLOCK_SPAMER_CMD) == 8, "PROTO_NC_CHAR_GET_CHAT_BLOCK_SPAMER_CMD size drift");

struct PROTO_NC_CHAR_GET_CHAT_BLOCK_SPAMER_DB_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_CHAR_GET_CHAT_BLOCK_SPAMER_DB_CMD) == 12, "PROTO_NC_CHAR_GET_CHAT_BLOCK_SPAMER_DB_CMD size drift");

struct PROTO_NC_CHAR_ITEM_CMD___unnamed_type_PacketOrder_ {
    uint32_t  nPacketOrderNum;
    uint32_t  nIsLastOfInven;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_ITEM_CMD___unnamed_type_PacketOrder_) == 1, "PROTO_NC_CHAR_ITEM_CMD___unnamed_type_PacketOrder_ size drift");

struct PROTO_NC_CHAR_ITEM_CMD {
    PROTO_NC_CHAR_ITEM_CMD___unnamed_type_PacketOrder_ PacketOrder;
    uint8_t _pad_at_0001[1];
    PROTO_ITEM_CMD ItemCmd;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_ITEM_CMD) == 3, "PROTO_NC_CHAR_ITEM_CMD size drift");

struct PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[7];
    PROTO_NC_CHAR_ITEM_CMD ItemCmd;
};
static_assert(sizeof(PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_ACK) == 16, "PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_ACK size drift");

struct PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_NUM_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[7];
    PROTO_NC_CHAR_ITEM_CMD ItemCmd;
};
static_assert(sizeof(PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_NUM_ACK) == 16, "PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_NUM_ACK size drift");

struct PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_NUM_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_NUM_REQ) == 16, "PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_NUM_REQ size drift");

struct PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_REQ) == 11, "PROTO_NC_CHAR_GET_ITEMLIST_BY_TYPE_REQ size drift");

struct PROTO_NC_CHAR_GUILD_ACADEMY_CMD {
    uint8_t _pad_at_0000[5];
    GUILD_ACADEMY_CLIENT_______0_bytes___ GuildAcademy;
};
static_assert(sizeof(PROTO_NC_CHAR_GUILD_ACADEMY_CMD) == 5, "PROTO_NC_CHAR_GUILD_ACADEMY_CMD size drift");

struct PROTO_NC_CHAR_GUILD_ACADEMY_ZONE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_GUILD_ACADEMY_ZONE_CMD) == 4, "PROTO_NC_CHAR_GUILD_ACADEMY_ZONE_CMD size drift");

struct PROTO_NC_CHAR_GUILD_CMD {
    uint8_t _pad_at_0000[4];
    GUILD_CLIENT_______0_bytes___ Guild;
};
static_assert(sizeof(PROTO_NC_CHAR_GUILD_CMD) == 4, "PROTO_NC_CHAR_GUILD_CMD size drift");

struct PROTO_NC_CHAR_HOUSE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_HOUSE_CMD) == 1, "PROTO_NC_CHAR_HOUSE_CMD size drift");

struct PROTO_NC_CHAR_KICKPLAYEROUT_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[8];
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_KICKPLAYEROUT_RNG) == 28, "PROTO_NC_CHAR_KICKPLAYEROUT_RNG size drift");

struct PROTO_NC_CHAR_KQMAP_CMD {
    uint8_t _pad_at_0000[4];
    Name3 sKQMapName;
    uint8_t _pad_at_0004[12];
    SHINE_XY_TYPE nKQCoord;
    uint8_t _pad_at_0010[8];
    SHINE_DATETIME dKQDate;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_KQMAP_CMD) == 28, "PROTO_NC_CHAR_KQMAP_CMD size drift");

struct PROTO_NC_CHAR_LEVEL_CHANGED_CMD { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_CHAR_LEVEL_CHANGED_CMD) == 7, "PROTO_NC_CHAR_LEVEL_CHANGED_CMD size drift");

struct PROTO_NC_CHAR_LOGINFAIL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_LOGINFAIL_ACK) == 2, "PROTO_NC_CHAR_LOGINFAIL_ACK size drift");

struct PROTO_NC_CHAR_LOGIN_ACK {
    Name4 zoneip;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_CHAR_LOGIN_ACK) == 18, "PROTO_NC_CHAR_LOGIN_ACK size drift");

struct PROTO_NC_CHAR_LOGIN_DB {
    uint8_t _pad_at_0000[4];
    MAPPOS mappos;
    uint8_t _pad_at_0004[32];
    Name5 spawnapps;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_LOGIN_DB) == 56, "PROTO_NC_CHAR_LOGIN_DB size drift");

struct PROTO_NC_CHAR_LOGIN_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_LOGIN_REQ) == 1, "PROTO_NC_CHAR_LOGIN_REQ size drift");

struct PROTO_NC_CHAR_LOGOUT_DB {
    uint8_t _pad_at_0000[4];
    MAPPOS mappos;
    uint8_t _tail[31];
};
static_assert(sizeof(PROTO_NC_CHAR_LOGOUT_DB) == 35, "PROTO_NC_CHAR_LOGOUT_DB size drift");

struct PROTO_NC_CHAR_MAPLOGIN_ACK {
    uint8_t _pad_at_0000[2];
    CHAR_PARAMETER_DATA param;
    uint8_t _pad_at_0002[232];
    SHINE_XY_TYPE logincoord;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_CHAR_MAPLOGIN_ACK) == 242, "PROTO_NC_CHAR_MAPLOGIN_ACK size drift");

struct PROTO_NC_CHAR_MASPUP_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_MASPUP_CMD) == 1, "PROTO_NC_CHAR_MASPUP_CMD size drift");

struct PROTO_NC_CHAR_MYSTERYVAULT_UI_STATE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_MYSTERYVAULT_UI_STATE_CMD) == 1, "PROTO_NC_CHAR_MYSTERYVAULT_UI_STATE_CMD size drift");

struct PROTO_NC_CHAR_NEWBIE_GUIDE_VIEW_LIST_CMD {
    uint8_t _pad_at_0000[1];
    uint8_t nGuideViewList[0];
};
static_assert(sizeof(PROTO_NC_CHAR_NEWBIE_GUIDE_VIEW_LIST_CMD) == 1, "PROTO_NC_CHAR_NEWBIE_GUIDE_VIEW_LIST_CMD size drift");

struct PROTO_NC_CHAR_NEWBIE_GUIDE_VIEW_SET_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_NEWBIE_GUIDE_VIEW_SET_CMD) == 1, "PROTO_NC_CHAR_NEWBIE_GUIDE_VIEW_SET_CMD size drift");

struct PROTO_NC_CHAR_OPTION_GAME {
    uint8_t Data[64];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GAME) == 64, "PROTO_NC_CHAR_OPTION_GAME size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_GAME_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_GAME Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_GAME_ACK) == 67, "PROTO_NC_CHAR_OPTION_DB_GET_GAME_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_GAME_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_GAME_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_GAME_REQ size drift");

struct PROTO_NC_CHAR_OPTION_KEYMAPPING {
    uint8_t Data[308];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_KEYMAPPING) == 308, "PROTO_NC_CHAR_OPTION_KEYMAPPING size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_KEYMAPPING_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_KEYMAPPING Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_KEYMAPPING_ACK) == 311, "PROTO_NC_CHAR_OPTION_DB_GET_KEYMAPPING_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_KEYMAPPING_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_KEYMAPPING_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_KEYMAPPING_REQ size drift");

struct PROTO_NC_CHAR_OPTION_SHORTCUTDATA {
    uint8_t Data[1024];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SHORTCUTDATA) == 1024, "PROTO_NC_CHAR_OPTION_SHORTCUTDATA size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTDATA_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_SHORTCUTDATA Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTDATA_ACK) == 1027, "PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTDATA_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTDATA_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTDATA_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTDATA_REQ size drift");

struct PROTO_NC_CHAR_OPTION_SHORTCUTSIZE {
    uint8_t Data[24];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SHORTCUTSIZE) == 24, "PROTO_NC_CHAR_OPTION_SHORTCUTSIZE size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTSIZE_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_SHORTCUTSIZE Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTSIZE_ACK) == 27, "PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTSIZE_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTSIZE_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTSIZE_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_SHORTCUTSIZE_REQ size drift");

struct PROTO_NC_CHAR_OPTION_SOUND {
    uint8_t Data[1];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SOUND) == 1, "PROTO_NC_CHAR_OPTION_SOUND size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_SOUND_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_SOUND Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_SOUND_ACK) == 4, "PROTO_NC_CHAR_OPTION_DB_GET_SOUND_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_SOUND_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_SOUND_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_SOUND_REQ size drift");

struct PROTO_NC_CHAR_OPTION_VIDEO {
    uint8_t Data[60];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_VIDEO) == 60, "PROTO_NC_CHAR_OPTION_VIDEO size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_VIDEO_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_VIDEO Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_VIDEO_ACK) == 63, "PROTO_NC_CHAR_OPTION_DB_GET_VIDEO_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_VIDEO_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_VIDEO_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_VIDEO_REQ size drift");

struct PROTO_NC_CHAR_OPTION_WINDOWPOS {
    uint8_t Data[392];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_WINDOWPOS) == 392, "PROTO_NC_CHAR_OPTION_WINDOWPOS size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_WINDOWPOS_ACK {
    uint8_t _pad_at_0000[3];
    PROTO_NC_CHAR_OPTION_WINDOWPOS Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_WINDOWPOS_ACK) == 395, "PROTO_NC_CHAR_OPTION_DB_GET_WINDOWPOS_ACK size drift");

struct PROTO_NC_CHAR_OPTION_DB_GET_WINDOWPOS_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_GET_WINDOWPOS_REQ) == 6, "PROTO_NC_CHAR_OPTION_DB_GET_WINDOWPOS_REQ size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_GAME_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_GAME Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_GAME_CMD) == 68, "PROTO_NC_CHAR_OPTION_DB_SET_GAME_CMD size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_KEYMAPPING_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_KEYMAPPING Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_KEYMAPPING_CMD) == 312, "PROTO_NC_CHAR_OPTION_DB_SET_KEYMAPPING_CMD size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_SHORTCUTDATA_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_SHORTCUTDATA Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_SHORTCUTDATA_CMD) == 1028, "PROTO_NC_CHAR_OPTION_DB_SET_SHORTCUTDATA_CMD size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_SHORTCUTSIZE_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_SHORTCUTSIZE Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_SHORTCUTSIZE_CMD) == 28, "PROTO_NC_CHAR_OPTION_DB_SET_SHORTCUTSIZE_CMD size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_SOUND_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_SOUND Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_SOUND_CMD) == 5, "PROTO_NC_CHAR_OPTION_DB_SET_SOUND_CMD size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_VIDEO_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_VIDEO Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_VIDEO_CMD) == 64, "PROTO_NC_CHAR_OPTION_DB_SET_VIDEO_CMD size drift");

struct PROTO_NC_CHAR_OPTION_DB_SET_WINDOWPOS_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_WINDOWPOS Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_DB_SET_WINDOWPOS_CMD) == 396, "PROTO_NC_CHAR_OPTION_DB_SET_WINDOWPOS_CMD size drift");

struct PROTO_NC_CHAR_OPTION_GET_ALL_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_ALL_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_ALL_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_GAME_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_GAME Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_GAME_ACK) == 65, "PROTO_NC_CHAR_OPTION_GET_GAME_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_GAME_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_GAME_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_GAME_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_KEYMAPPING_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_KEYMAPPING Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_KEYMAPPING_ACK) == 309, "PROTO_NC_CHAR_OPTION_GET_KEYMAPPING_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_KEYMAPPING_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_KEYMAPPING_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_KEYMAPPING_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_SHORTCUTDATA_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_SHORTCUTDATA Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_SHORTCUTDATA_ACK) == 1025, "PROTO_NC_CHAR_OPTION_GET_SHORTCUTDATA_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_SHORTCUTDATA_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_SHORTCUTDATA_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_SHORTCUTDATA_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_SHORTCUTSIZE_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_SHORTCUTSIZE Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_SHORTCUTSIZE_ACK) == 25, "PROTO_NC_CHAR_OPTION_GET_SHORTCUTSIZE_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_SHORTCUTSIZE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_SHORTCUTSIZE_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_SHORTCUTSIZE_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_SOUND_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_SOUND Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_SOUND_ACK) == 2, "PROTO_NC_CHAR_OPTION_GET_SOUND_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_SOUND_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_SOUND_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_SOUND_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_VIDEO_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_VIDEO Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_VIDEO_ACK) == 61, "PROTO_NC_CHAR_OPTION_GET_VIDEO_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_VIDEO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_VIDEO_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_VIDEO_REQ size drift");

struct PROTO_NC_CHAR_OPTION_GET_WINDOWPOS_ACK {
    uint8_t _pad_at_0000[1];
    PROTO_NC_CHAR_OPTION_WINDOWPOS Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_WINDOWPOS_ACK) == 393, "PROTO_NC_CHAR_OPTION_GET_WINDOWPOS_ACK size drift");

struct PROTO_NC_CHAR_OPTION_GET_WINDOWPOS_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_GET_WINDOWPOS_REQ) == 1, "PROTO_NC_CHAR_OPTION_GET_WINDOWPOS_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_DATA_TYPE_CMD {
    uint8_t _pad_at_0000[4];
    CHAR_OPTION_DATA_TYPE DataType;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_DATA_TYPE_CMD) == 8, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_DATA_TYPE_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_ETC3_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_ETC3_CMD) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_ETC3_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_ETC4_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_ETC4_CMD) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_ETC4_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD {
    uint8_t _pad_at_0000[2];
    GAME_OPTION_DATA_______0_bytes___ GameOptionData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_GAMEOPTION_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD DBGameOptionData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_GAMEOPTION_CMD) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_GAMEOPTION_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD {
    uint8_t _pad_at_0000[2];
    KEY_MAP_DATA_______0_bytes___ KeyMapData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_KEYMAP_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD DBKeyMapData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_KEYMAP_CMD) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_KEYMAP_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_GET_SHORTCUTDATA_CMD {
    uint8_t _pad_at_0000[2];
    SHORT_CUT_DATA_______0_bytes___ ShortCutData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_GET_SHORTCUTDATA_CMD) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_GET_SHORTCUTDATA_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_SHORTCUTDATA_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_SHORTCUTDATA_CMD DBShortCutData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_SHORTCUTDATA_CMD) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_GET_SHORTCUTDATA_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC3_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC3_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC3_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC3_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC3_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC3_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC4_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC4_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC4_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC4_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC4_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_ETC4_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_GAMEOPTION_ACK {
    uint8_t _pad_at_0000[6];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD DBGameOptionData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_GAMEOPTION_ACK) == 8, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_GAMEOPTION_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_GAMEOPTION_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_GAMEOPTION_REQ) == 4, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_GAMEOPTION_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_KEYMAP_ACK {
    uint8_t _pad_at_0000[6];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD DBKeyMapData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_KEYMAP_ACK) == 8, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_KEYMAP_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_KEYMAP_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_KEYMAP_REQ) == 4, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_KEYMAP_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_SHORTCUTDATA_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_SHORTCUTDATA_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_SHORTCUTDATA_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_SHORTCUTDATA_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_SHORTCUTDATA_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_INIT_SHORTCUTDATA_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC3_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC3_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC3_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC3_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC3_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC3_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC4_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC4_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC4_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC4_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC4_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_ETC4_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_GAMEOPTION_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_GAMEOPTION_ACK) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_GAMEOPTION_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_GAMEOPTION_REQ {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD DBGameOptionData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_GAMEOPTION_REQ) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_GAMEOPTION_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_KEYMAP_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_KEYMAP_ACK) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_KEYMAP_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_KEYMAP_REQ {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD DBKeyMapData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_KEYMAP_REQ) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_KEYMAP_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_SHORTCUTDATA_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_SHORTCUTDATA_ACK) == 6, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_SHORTCUTDATA_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_REQ {
    uint8_t _pad_at_0000[1];
    SHORT_CUT_DATA_______0_bytes___ ShortCutData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_SHORTCUTDATA_REQ {
    uint8_t _pad_at_0000[4];
    PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_REQ DBShortCutData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_SHORTCUTDATA_REQ) == 5, "PROTO_NC_CHAR_OPTION_IMPROVE_DB_SET_SHORTCUTDATA_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_GET_ETC3_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_GET_ETC3_CMD) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_GET_ETC3_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_GET_ETC4_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_GET_ETC4_CMD) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_GET_ETC4_CMD size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC3_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC3_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC3_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC3_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC3_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC3_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC4_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC4_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC4_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC4_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC4_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_ETC4_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_GAMEOPTION_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_GAMEOPTION_CMD DBGameOptionData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_GAMEOPTION_ACK) == 4, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_GAMEOPTION_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_GAMEOPTION_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_GAMEOPTION_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_GAMEOPTION_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_KEYMAP_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_NC_CHAR_OPTION_IMPROVE_GET_KEYMAP_CMD DBKeyMapData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_KEYMAP_ACK) == 4, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_KEYMAP_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_KEYMAP_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_KEYMAP_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_KEYMAP_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_SHORTCUTDATA_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_SHORTCUTDATA_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_SHORTCUTDATA_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_INIT_SHORTCUTDATA_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_INIT_SHORTCUTDATA_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_INIT_SHORTCUTDATA_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC3_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC3_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC3_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC3_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC3_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC3_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC4_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC4_ACK) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC4_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC4_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC4_REQ) == 1, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_ETC4_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_GAMEOPTION_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_GAMEOPTION_ACK) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_GAMEOPTION_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_GAMEOPTION_REQ {
    uint8_t _pad_at_0000[2];
    GAME_OPTION_DATA_______0_bytes___ GameOptionData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_GAMEOPTION_REQ) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_GAMEOPTION_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_KEYMAP_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_KEYMAP_ACK) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_KEYMAP_ACK size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_KEYMAP_REQ {
    uint8_t _pad_at_0000[2];
    KEY_MAP_DATA_______0_bytes___ KeyMapData;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_KEYMAP_REQ) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_KEYMAP_REQ size drift");

struct PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_ACK) == 2, "PROTO_NC_CHAR_OPTION_IMPROVE_SET_SHORTCUTDATA_ACK size drift");

struct PROTO_NC_CHAR_OPTION_LOGIN_BLOCKDATA_ERR_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_OPTION_LOGIN_BLOCKDATA_ERR_REQ) == 4, "PROTO_NC_CHAR_OPTION_LOGIN_BLOCKDATA_ERR_REQ size drift");

struct PROTO_NC_CHAR_OPTION_SET_GAME_CMD {
    PROTO_NC_CHAR_OPTION_GAME Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_GAME_CMD) == 64, "PROTO_NC_CHAR_OPTION_SET_GAME_CMD size drift");

struct PROTO_NC_CHAR_OPTION_SET_KEYMAPPING_CMD {
    PROTO_NC_CHAR_OPTION_KEYMAPPING Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_KEYMAPPING_CMD) == 308, "PROTO_NC_CHAR_OPTION_SET_KEYMAPPING_CMD size drift");

struct PROTO_NC_CHAR_OPTION_SET_SHORTCUTDATA_CMD {
    PROTO_NC_CHAR_OPTION_SHORTCUTDATA Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_SHORTCUTDATA_CMD) == 1024, "PROTO_NC_CHAR_OPTION_SET_SHORTCUTDATA_CMD size drift");

struct PROTO_NC_CHAR_OPTION_SET_SHORTCUTSIZE_CMD {
    PROTO_NC_CHAR_OPTION_SHORTCUTSIZE Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_SHORTCUTSIZE_CMD) == 24, "PROTO_NC_CHAR_OPTION_SET_SHORTCUTSIZE_CMD size drift");

struct PROTO_NC_CHAR_OPTION_SET_SOUND_CMD {
    PROTO_NC_CHAR_OPTION_SOUND Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_SOUND_CMD) == 1, "PROTO_NC_CHAR_OPTION_SET_SOUND_CMD size drift");

struct PROTO_NC_CHAR_OPTION_SET_VIDEO_CMD {
    PROTO_NC_CHAR_OPTION_VIDEO Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_VIDEO_CMD) == 60, "PROTO_NC_CHAR_OPTION_SET_VIDEO_CMD size drift");

struct PROTO_NC_CHAR_OPTION_SET_WINDOWPOS_CMD {
    PROTO_NC_CHAR_OPTION_WINDOWPOS Data;
};
static_assert(sizeof(PROTO_NC_CHAR_OPTION_SET_WINDOWPOS_CMD) == 392, "PROTO_NC_CHAR_OPTION_SET_WINDOWPOS_CMD size drift");

struct PROTO_NC_CHAR_PET_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_PET_CMD) == 1, "PROTO_NC_CHAR_PET_CMD size drift");

struct PROTO_NC_CHAR_PLAYERBANNED_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_PLAYERBANNED_RNG) == 27, "PROTO_NC_CHAR_PLAYERBANNED_RNG size drift");

struct PROTO_NC_CHAR_PLAYERFOUND_BY_NORMAL_USER_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Name3 map;
    uint8_t _pad_at_0007[12];
    SHINE_XY_TYPE coord;
    uint8_t _pad_at_0013[8];
    Name5 charid;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_CHAR_PLAYERFOUND_BY_NORMAL_USER_RNG) == 49, "PROTO_NC_CHAR_PLAYERFOUND_BY_NORMAL_USER_RNG size drift");

struct PROTO_NC_CHAR_PLAYERFOUND_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Name3 map;
    uint8_t _pad_at_0007[12];
    SHINE_XY_TYPE coord;
    uint8_t _pad_at_0013[8];
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_PLAYERFOUND_RNG) == 47, "PROTO_NC_CHAR_PLAYERFOUND_RNG size drift");

struct PROTO_NC_CHAR_PLAYERSEARCH_BY_NORMAL_USER_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_PLAYERSEARCH_BY_NORMAL_USER_RNG) == 27, "PROTO_NC_CHAR_PLAYERSEARCH_BY_NORMAL_USER_RNG size drift");

struct PROTO_NC_CHAR_PLAYERSEARCH_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_PLAYERSEARCH_RNG) == 27, "PROTO_NC_CHAR_PLAYERSEARCH_RNG size drift");

struct PROTO_NC_CHAR_PLAYERSUMMON_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[7];
    Name5 charid;
    uint8_t _pad_at_0007[20];
    Name3 map;
    uint8_t _pad_at_001b[12];
    SHINE_XY_TYPE coord;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_CHAR_PLAYERSUMMON_RNG) == 47, "PROTO_NC_CHAR_PLAYERSUMMON_RNG size drift");

struct PROTO_NC_CHAR_POLYMORPH_CMD {
    uint8_t _pad_at_0000[4];
    ABSTATEINDEX AbstateIndex;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_POLYMORPH_CMD) == 8, "PROTO_NC_CHAR_POLYMORPH_CMD size drift");

struct PROTO_NC_CHAR_PROMOTE_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_PROMOTE_ACK) == 1, "PROTO_NC_CHAR_PROMOTE_ACK size drift");

struct PROTO_NC_CHAR_PROMOTE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_PROMOTE_REQ) == 1, "PROTO_NC_CHAR_PROMOTE_REQ size drift");

struct PROTO_NC_CHAR_QUEST_DOING_CMD {
    uint8_t _pad_at_0000[6];
    PLAYER_QUEST_INFO_______0_bytes___ QuestDoingArray;
};
static_assert(sizeof(PROTO_NC_CHAR_QUEST_DOING_CMD) == 6, "PROTO_NC_CHAR_QUEST_DOING_CMD size drift");

struct PROTO_NC_CHAR_QUEST_DONE_CMD {
    uint8_t _pad_at_0000[12];
    PLAYER_QUEST_DONE_INFO_______0_bytes___ QuestDoneArray;
};
static_assert(sizeof(PROTO_NC_CHAR_QUEST_DONE_CMD) == 12, "PROTO_NC_CHAR_QUEST_DONE_CMD size drift");

struct PROTO_NC_CHAR_QUEST_READ_CMD {
    uint8_t _pad_at_0000[6];
    uint16_t QuestReadIDArray[0];
};
static_assert(sizeof(PROTO_NC_CHAR_QUEST_READ_CMD) == 6, "PROTO_NC_CHAR_QUEST_READ_CMD size drift");

struct PROTO_NC_CHAR_QUEST_REPEAT_CMD {
    uint8_t _pad_at_0000[6];
    PLAYER_QUEST_INFO_______0_bytes___ QuestRepeatArray;
};
static_assert(sizeof(PROTO_NC_CHAR_QUEST_REPEAT_CMD) == 6, "PROTO_NC_CHAR_QUEST_REPEAT_CMD size drift");

struct PROTO_NC_CHAR_REBIRTH_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_REBIRTH_CMD) == 1, "PROTO_NC_CHAR_REBIRTH_CMD size drift");

struct PROTO_NC_CHAR_REBIRTH_REJECT_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_REBIRTH_REJECT_CMD) == 1, "PROTO_NC_CHAR_REBIRTH_REJECT_CMD size drift");

struct PROTO_NC_CHAR_ZONE_CHARDATA_REQ {
    uint8_t _pad_at_0000[2];
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAR_ZONE_CHARDATA_REQ) == 22, "PROTO_NC_CHAR_ZONE_CHARDATA_REQ size drift");

struct PROTO_NC_CHAR_REGISTNUMBER_ACK {
    uint8_t _pad_at_0000[8];
    PROTO_NC_CHAR_ZONE_CHARDATA_REQ loginreq;
};
static_assert(sizeof(PROTO_NC_CHAR_REGISTNUMBER_ACK) == 30, "PROTO_NC_CHAR_REGISTNUMBER_ACK size drift");

struct PROTO_NC_CHAR_REGISTNUMBER_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    NETPACKETZONEHEADER netpacketzoneheader;
    PROTO_NC_CHAR_REGISTNUMBER_ACK ack;
};
static_assert(sizeof(PROTO_NC_CHAR_REGISTNUMBER_ACK_SEND) == 39, "PROTO_NC_CHAR_REGISTNUMBER_ACK_SEND size drift");

struct PROTO_NC_CHAR_REGISTNUMBER_REQ {
    PROTO_NC_CHAR_ZONE_CHARDATA_REQ loginreq;
};
static_assert(sizeof(PROTO_NC_CHAR_REGISTNUMBER_REQ) == 22, "PROTO_NC_CHAR_REGISTNUMBER_REQ size drift");

struct PROTO_NC_CHAR_REGNUM_VARIFICATION_ACK { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_CHAR_REGNUM_VARIFICATION_ACK) == 7, "PROTO_NC_CHAR_REGNUM_VARIFICATION_ACK size drift");

struct PROTO_NC_CHAR_REGNUM_VARIFICATION_REQ {
    uint8_t _pad_at_0000[2];
    Name5 zone_charid;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_CHAR_REGNUM_VARIFICATION_REQ) == 26, "PROTO_NC_CHAR_REGNUM_VARIFICATION_REQ size drift");

struct PROTO_NC_CHAR_REVIVESAME_CMD {
    uint8_t _pad_at_0000[2];
    SHINE_XY_TYPE location;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_CHAR_REVIVESAME_CMD) == 10, "PROTO_NC_CHAR_REVIVESAME_CMD size drift");

struct PROTO_NC_CHAR_REVIVEOTHER_CMD {
    PROTO_NC_CHAR_REVIVESAME_CMD link;
    PROTO_NC_CHAR_LOGIN_ACK sock;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHAR_REVIVEOTHER_CMD) == 30, "PROTO_NC_CHAR_REVIVEOTHER_CMD size drift");

struct PROTO_NC_CHAR_SEAWAR_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_SEAWAR_CMD) == 1, "PROTO_NC_CHAR_SEAWAR_CMD size drift");

struct PROTO_NC_CHAR_SELL_ITEM_INFO_ZONE_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_SELL_ITEM_INFO_SERVER_______0_bytes___ SellItemList;
};
static_assert(sizeof(PROTO_NC_CHAR_SELL_ITEM_INFO_ZONE_CMD) == 1, "PROTO_NC_CHAR_SELL_ITEM_INFO_ZONE_CMD size drift");

struct PROTO_NC_CHAR_SET_STYLE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_ACK) == 2, "PROTO_NC_CHAR_SET_STYLE_ACK size drift");

struct PROTO_NC_CHAR_SET_STYLE_DB_ACK {
    uint8_t _pad_at_0000[8];
    PROTO_AVATAR_SHAPE_INFO Info;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_DB_ACK) == 12, "PROTO_NC_CHAR_SET_STYLE_DB_ACK size drift");

struct PROTO_NC_CHAR_SET_STYLE_DB_REQ {
    uint8_t _pad_at_0000[6];
    PROTO_AVATAR_SHAPE_INFO Info;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_DB_REQ) == 10, "PROTO_NC_CHAR_SET_STYLE_DB_REQ size drift");

struct PROTO_NC_CHAR_SET_STYLE_GET_INFO_ACK {
    uint8_t _pad_at_0000[2];
    STYLE_ITEM_COUNTS_______24_bytes___ Items;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_GET_INFO_ACK) == 26, "PROTO_NC_CHAR_SET_STYLE_GET_INFO_ACK size drift");

struct PROTO_NC_CHAR_SET_STYLE_GET_INFO_DB_ACK {
    uint8_t _pad_at_0000[8];
    STYLE_ITEM_COUNTS_______24_bytes___ Items;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_GET_INFO_DB_ACK) == 32, "PROTO_NC_CHAR_SET_STYLE_GET_INFO_DB_ACK size drift");

struct PROTO_NC_CHAR_SET_STYLE_GET_INFO_DB_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_GET_INFO_DB_REQ) == 6, "PROTO_NC_CHAR_SET_STYLE_GET_INFO_DB_REQ size drift");

struct PROTO_NC_CHAR_SET_STYLE_GET_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_GET_INFO_REQ) == 1, "PROTO_NC_CHAR_SET_STYLE_GET_INFO_REQ size drift");

struct PROTO_NC_CHAR_SET_STYLE_REQ {
    PROTO_AVATAR_SHAPE_INFO Info;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_SET_STYLE_REQ) == 4, "PROTO_NC_CHAR_SET_STYLE_REQ size drift");

struct PROTO_NC_CHAR_SINGLE_OPTION_CMD { uint8_t data[15]; };
static_assert(sizeof(PROTO_NC_CHAR_SINGLE_OPTION_CMD) == 15, "PROTO_NC_CHAR_SINGLE_OPTION_CMD size drift");

struct PROTO_NC_CHAR_SKILL_CMD {
    uint8_t _pad_at_0000[4];
    PARTMARK PartMark;
    uint8_t _pad_at_0004[5];
    PROTO_SKILLREADBLOCK_______0_bytes___ skill;
};
static_assert(sizeof(PROTO_NC_CHAR_SKILL_CMD) == 9, "PROTO_NC_CHAR_SKILL_CMD size drift");

struct PROTO_NC_CHAR_SKILL_PASSIVE_CMD {
    uint8_t _pad_at_0000[2];
    uint16_t passive[0];
};
static_assert(sizeof(PROTO_NC_CHAR_SKILL_PASSIVE_CMD) == 2, "PROTO_NC_CHAR_SKILL_PASSIVE_CMD size drift");

struct PROTO_NC_CHAR_SOMEONEGUILDACADEMYCHANGE_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_SOMEONEGUILDACADEMYCHANGE_CMD) == 6, "PROTO_NC_CHAR_SOMEONEGUILDACADEMYCHANGE_CMD size drift");

struct PROTO_NC_CHAR_SOMEONEGUILDCHANGE_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_SOMEONEGUILDCHANGE_CMD) == 6, "PROTO_NC_CHAR_SOMEONEGUILDCHANGE_CMD size drift");

struct PROTO_NC_CHAR_SOMEONEPROMOTE_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_CHAR_SOMEONEPROMOTE_CMD) == 3, "PROTO_NC_CHAR_SOMEONEPROMOTE_CMD size drift");

struct PROTO_NC_CHAR_STAT_DECPOINTFAIL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_DECPOINTFAIL_ACK) == 2, "PROTO_NC_CHAR_STAT_DECPOINTFAIL_ACK size drift");

struct PROTO_NC_CHAR_STAT_DECPOINTFAIL_DB_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_STAT_DECPOINTFAIL_DB_ACK) == 10, "PROTO_NC_CHAR_STAT_DECPOINTFAIL_DB_ACK size drift");

struct PROTO_NC_CHAR_STAT_DECPOINTSUC_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_DECPOINTSUC_ACK) == 1, "PROTO_NC_CHAR_STAT_DECPOINTSUC_ACK size drift");

struct PROTO_NC_CHAR_STAT_DECPOINTSUC_DB_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_CHAR_STAT_DECPOINTSUC_DB_ACK) == 9, "PROTO_NC_CHAR_STAT_DECPOINTSUC_DB_ACK size drift");

struct PROTO_NC_CHAR_STAT_DECPOINT_DB_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[3];
    SHINE_ITEM_REGISTNUMBER restatitemkey;
    uint8_t _tail[13];
};
static_assert(sizeof(PROTO_NC_CHAR_STAT_DECPOINT_DB_REQ) == 22, "PROTO_NC_CHAR_STAT_DECPOINT_DB_REQ size drift");

struct PROTO_NC_CHAR_STAT_DECPOINT_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_DECPOINT_REQ) == 1, "PROTO_NC_CHAR_STAT_DECPOINT_REQ size drift");

struct PROTO_NC_CHAR_STAT_INCPOINTFAIL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_INCPOINTFAIL_ACK) == 2, "PROTO_NC_CHAR_STAT_INCPOINTFAIL_ACK size drift");

struct PROTO_NC_CHAR_STAT_INCPOINTFAIL_DB_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHAR_STAT_INCPOINTFAIL_DB_ACK) == 8, "PROTO_NC_CHAR_STAT_INCPOINTFAIL_DB_ACK size drift");

struct PROTO_NC_CHAR_STAT_INCPOINTSUC_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_INCPOINTSUC_ACK) == 1, "PROTO_NC_CHAR_STAT_INCPOINTSUC_ACK size drift");

struct PROTO_NC_CHAR_STAT_INCPOINTSUC_DB_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_STAT_INCPOINTSUC_DB_ACK) == 7, "PROTO_NC_CHAR_STAT_INCPOINTSUC_DB_ACK size drift");

struct PROTO_NC_CHAR_STAT_INCPOINT_DB_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_STAT_INCPOINT_DB_REQ) == 7, "PROTO_NC_CHAR_STAT_INCPOINT_DB_REQ size drift");

struct PROTO_NC_CHAR_STAT_INCPOINT_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_INCPOINT_REQ) == 1, "PROTO_NC_CHAR_STAT_INCPOINT_REQ size drift");

struct PROTO_NC_CHAR_STAT_REMAINPOINT_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_STAT_REMAINPOINT_CMD) == 1, "PROTO_NC_CHAR_STAT_REMAINPOINT_CMD size drift");

struct PROTO_NC_CHAR_SUPPORT_REWARD_CMD {
    uint8_t _pad_at_0000[4];
    USER_TYPE eUserType;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_SUPPORT_REWARD_CMD) == 8, "PROTO_NC_CHAR_SUPPORT_REWARD_CMD size drift");

struct PROTO_NC_CHAR_TUTORIAL_DOING_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_DOING_CMD) == 1, "PROTO_NC_CHAR_TUTORIAL_DOING_CMD size drift");

struct PROTO_NC_CHAR_TUTORIAL_FREESTAT_INIT_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_FREESTAT_INIT_ACK) == 6, "PROTO_NC_CHAR_TUTORIAL_FREESTAT_INIT_ACK size drift");

struct PROTO_NC_CHAR_TUTORIAL_FREESTAT_INIT_REQ {
    uint8_t _pad_at_0000[5];
    uint8_t nFreeStat[5];
};
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_FREESTAT_INIT_REQ) == 10, "PROTO_NC_CHAR_TUTORIAL_FREESTAT_INIT_REQ size drift");

struct PROTO_NC_CHAR_TUTORIAL_INFO_WORLD_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_TUTORIAL_INFO TutorialInfo;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_INFO_WORLD_CMD) == 9, "PROTO_NC_CHAR_TUTORIAL_INFO_WORLD_CMD size drift");

struct PROTO_NC_CHAR_TUTORIAL_INFO_ZONE_CMD {
    uint8_t _pad_at_0000[6];
    PROTO_TUTORIAL_INFO TutorialInfo;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_INFO_ZONE_CMD) == 11, "PROTO_NC_CHAR_TUTORIAL_INFO_ZONE_CMD size drift");

struct PROTO_NC_CHAR_TUTORIAL_MAKE_ITEM_ACK { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_MAKE_ITEM_ACK) == 9, "PROTO_NC_CHAR_TUTORIAL_MAKE_ITEM_ACK size drift");

struct PROTO_NC_CHAR_TUTORIAL_MAKE_ITEM_REQ { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_MAKE_ITEM_REQ) == 12, "PROTO_NC_CHAR_TUTORIAL_MAKE_ITEM_REQ size drift");

struct PROTO_NC_CHAR_TUTORIAL_POPUP_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_POPUP_ACK) == 1, "PROTO_NC_CHAR_TUTORIAL_POPUP_ACK size drift");

struct PROTO_NC_CHAR_TUTORIAL_POPUP_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_POPUP_REQ) == 1, "PROTO_NC_CHAR_TUTORIAL_POPUP_REQ size drift");

struct PROTO_NC_CHAR_TUTORIAL_STEP_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_STEP_ACK) == 1, "PROTO_NC_CHAR_TUTORIAL_STEP_ACK size drift");

struct PROTO_NC_CHAR_TUTORIAL_STEP_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_STEP_REQ) == 1, "PROTO_NC_CHAR_TUTORIAL_STEP_REQ size drift");

struct PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_ACK {
    uint8_t _pad_at_0000[4];
    PROTO_TUTORIAL_INFO TutorialInfo;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_ACK) == 9, "PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_ACK size drift");

struct PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_CMD {
    uint8_t _pad_at_0000[4];
    PROTO_TUTORIAL_INFO TutorialInfo;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_CMD) == 9, "PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_CMD size drift");

struct PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_REQ {
    uint8_t _pad_at_0000[8];
    PROTO_TUTORIAL_INFO TutorialInfo;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_REQ) == 13, "PROTO_NC_CHAR_TUTORIAL_STEP_SAVE_REQ size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_OFF_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_OFF_ACK) == 1, "PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_OFF_ACK size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_OFF_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_OFF_REQ) == 1, "PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_OFF_REQ size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_ON_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_ON_ACK) == 2, "PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_ON_ACK size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_ON_REQ {
    uint16_t ChargedItemList[12];
};
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_ON_REQ) == 24, "PROTO_NC_CHAR_USEITEM_MINIMON_CHARGED_ITEM_ON_REQ size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_INFO_CLIENT_CMD {
    USEITEM_MINIMON_INFO UseItemMinimonInfo;
    uint8_t _tail[50];
};
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_INFO_CLIENT_CMD) == 50, "PROTO_NC_CHAR_USEITEM_MINIMON_INFO_CLIENT_CMD size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_INFO_CMD {
    uint8_t _pad_at_0000[6];
    USEITEM_MINIMON_INFO UseItemMinimonInfo;
    uint8_t _tail[50];
};
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_INFO_CMD) == 56, "PROTO_NC_CHAR_USEITEM_MINIMON_INFO_CMD size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_INFO_ZONE_CMD {
    uint8_t _pad_at_0000[6];
    USEITEM_MINIMON_INFO UseItemMinimonInfo;
    uint8_t _tail[50];
};
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_INFO_ZONE_CMD) == 56, "PROTO_NC_CHAR_USEITEM_MINIMON_INFO_ZONE_CMD size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_OFF_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_OFF_ACK) == 1, "PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_OFF_ACK size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_OFF_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_OFF_REQ) == 1, "PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_OFF_REQ size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_ON_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_ON_ACK) == 2, "PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_ON_ACK size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_ON_REQ {
    uint16_t NormalItemList[12];
};
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_ON_REQ) == 24, "PROTO_NC_CHAR_USEITEM_MINIMON_NORMAL_ITEM_ON_REQ size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_NOTICE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_NOTICE_CMD) == 4, "PROTO_NC_CHAR_USEITEM_MINIMON_NOTICE_CMD size drift");

struct PROTO_NC_CHAR_USEITEM_MINIMON_USE_BROAD_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_CHAR_USEITEM_MINIMON_USE_BROAD_CMD) == 3, "PROTO_NC_CHAR_USEITEM_MINIMON_USE_BROAD_CMD size drift");

struct PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Status_ {
    uint32_t  Main;
    uint32_t  Sub;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Status_) == 1, "PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Status_ size drift");

struct PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Partner_ {
    Name5 Name;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Partner_) == 24, "PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Partner_ size drift");

struct PROTO_NC_CHAR_WEDDINGDATA_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[2];
    PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Status_ Status;
    ShineDateTime When;
    uint8_t _pad_at_0009[4];
    ShineDateTime SubWhen;
    ShineDateTime ApplicationLimit;
    ShineDateTime DelayLimit;
    ShineDateTime DivorceLimit;
    ShineDateTime NewlyLimit;
    uint8_t _pad_at_000d[4];
    PROTO_NC_CHAR_WEDDINGDATA_ACK___unnamed_type_Partner_ Partner;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDINGDATA_ACK) == 43, "PROTO_NC_CHAR_WEDDINGDATA_ACK size drift");

struct PROTO_NC_CHAR_WEDDINGDATA_REQ {
    NETPACKETZONEHEADER header;
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDINGDATA_REQ) == 6, "PROTO_NC_CHAR_WEDDINGDATA_REQ size drift");

struct PROTO_NC_CHAR_WEDDING_CANCEL_WEDDING { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_CANCEL_WEDDING) == 4, "PROTO_NC_CHAR_WEDDING_CANCEL_WEDDING size drift");

struct PROTO_NC_CHAR_WEDDING_DIVORCE_CANCEL_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_DIVORCE_CANCEL_ACK) == 16, "PROTO_NC_CHAR_WEDDING_DIVORCE_CANCEL_ACK size drift");

struct PROTO_NC_CHAR_WEDDING_DIVORCE_CANCEL_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_DIVORCE_CANCEL_REQ) == 11, "PROTO_NC_CHAR_WEDDING_DIVORCE_CANCEL_REQ size drift");

struct PROTO_NC_CHAR_WEDDING_DIVORCE_DO_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_DIVORCE_DO_REQ) == 11, "PROTO_NC_CHAR_WEDDING_DIVORCE_DO_REQ size drift");

struct PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK___unnamed_type_PartnerInfo_ {
    uint8_t _pad_at_0000[2];
    ShineDateTime LastConnect;
    uint8_t _tail[6];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK___unnamed_type_PartnerInfo_) == 8, "PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK___unnamed_type_PartnerInfo_ size drift");

struct PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK {
    NETPACKETZONEHEADER header;
    PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK___unnamed_type_PartnerInfo_ PartnerInfo;
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK) == 14, "PROTO_NC_CHAR_WEDDING_PARTNER_INFO_ACK size drift");

struct PROTO_NC_CHAR_WEDDING_PARTNER_INFO_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PARTNER_INFO_REQ) == 10, "PROTO_NC_CHAR_WEDDING_PARTNER_INFO_REQ size drift");

struct PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG___unnamed_type_PartnerInfo_ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG___unnamed_type_PartnerInfo_) == 8, "PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG___unnamed_type_PartnerInfo_ size drift");

struct PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG {
    ZONERINGLINKAGESTART Start;
    uint8_t _pad_at_0000[7];
    PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG___unnamed_type_PartnerInfo_ PartnerInfo;
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG) == 15, "PROTO_NC_CHAR_WEDDING_PARTNER_INFO_RNG size drift");

struct PROTO_NC_CHAR_WEDDING_PARTNER_SUMMON_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[11];
    Name3 map;
    uint8_t _pad_at_000b[12];
    SHINE_XY_TYPE coord;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PARTNER_SUMMON_RNG) == 35, "PROTO_NC_CHAR_WEDDING_PARTNER_SUMMON_RNG size drift");

struct PROTO_NC_CHAR_WEDDING_PROPOSE_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PROPOSE_ACK) == 14, "PROTO_NC_CHAR_WEDDING_PROPOSE_ACK size drift");

struct PROTO_NC_CHAR_WEDDING_PROPOSE_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_PROPOSE_REQ) == 10, "PROTO_NC_CHAR_WEDDING_PROPOSE_REQ size drift");

struct PROTO_NC_CHAR_WEDDING_REFRESH_INFO_RNG {
    ZONERINGLINKAGESTART Start;
    uint8_t _tail[7];
};
static_assert(sizeof(PROTO_NC_CHAR_WEDDING_REFRESH_INFO_RNG) == 7, "PROTO_NC_CHAR_WEDDING_REFRESH_INFO_RNG size drift");

struct PROTO_NC_CHAR_WORLD_AUTO_PICK_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAR_WORLD_AUTO_PICK_CMD) == 1, "PROTO_NC_CHAR_WORLD_AUTO_PICK_CMD size drift");

struct PROTO_NC_CHAR_WORLD_REST_EXP_LAST_EXEC_TIME_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_WORLD_REST_EXP_LAST_EXEC_TIME_CMD) == 4, "PROTO_NC_CHAR_WORLD_REST_EXP_LAST_EXEC_TIME_CMD size drift");

struct PROTO_NC_CHAR_ZONE_AUTO_PICK_CMD {
    NETPACKETZONEHEADER header;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_CHAR_ZONE_AUTO_PICK_CMD) == 9, "PROTO_NC_CHAR_ZONE_AUTO_PICK_CMD size drift");

struct PROTO_NC_CHAR_ZONE_CHARDATAFAIL_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    NETPACKETZONEHEADER header;
    PROTO_ERRORCODE ack;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CHAR_ZONE_CHARDATAFAIL_ACK_SEND) == 11, "PROTO_NC_CHAR_ZONE_CHARDATAFAIL_ACK_SEND size drift");

struct PROTO_NC_CHAR_ZONE_CHARDATA_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAR_ZONE_CHARDATA_ACK) == 2, "PROTO_NC_CHAR_ZONE_CHARDATA_ACK size drift");

struct PROTO_NC_CHAR_ZONE_CHARDATA_ACK_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    NETPACKETZONEHEADER header;
    PROTO_NC_CHAR_ZONE_CHARDATA_ACK ack;
};
static_assert(sizeof(PROTO_NC_CHAR_ZONE_CHARDATA_ACK_SEND) == 11, "PROTO_NC_CHAR_ZONE_CHARDATA_ACK_SEND size drift");

struct PROTO_NC_CHAR_ZONE_CHAT_COLOR_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAR_ZONE_CHAT_COLOR_CMD) == 8, "PROTO_NC_CHAR_ZONE_CHAT_COLOR_CMD size drift");

struct PROTO_NC_CHAR_ZONE_GUILD_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAR_ZONE_GUILD_CMD) == 4, "PROTO_NC_CHAR_ZONE_GUILD_CMD size drift");

struct PROTO_NC_CHAT_RESTRICT_ADD_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_CHAT_RESTRICT_INFO ChatRestrictData;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_ADD_ACK) == 24, "PROTO_NC_CHAT_RESTRICT_ADD_ACK size drift");

struct PROTO_NC_CHAT_RESTRICT_ADD_REQ {
    Name5 sChatRestrictCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_ADD_REQ) == 20, "PROTO_NC_CHAT_RESTRICT_ADD_REQ size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_ADD_ACK {
    uint8_t _pad_at_0000[4];
    PROTO_CHAT_RESTRICT_INFO ChatRestrictData;
    uint8_t _tail[26];
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_ADD_ACK) == 30, "PROTO_NC_CHAT_RESTRICT_DB_ADD_ACK size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_ADD_REQ {
    uint8_t _pad_at_0000[6];
    Name5 sChatRestrictCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_ADD_REQ) == 26, "PROTO_NC_CHAT_RESTRICT_DB_ADD_REQ size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_DEL_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_DEL_ACK) == 8, "PROTO_NC_CHAT_RESTRICT_DB_DEL_ACK size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_DEL_ALL_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_DEL_ALL_ACK) == 4, "PROTO_NC_CHAT_RESTRICT_DB_DEL_ALL_ACK size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_DEL_ALL_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_DEL_ALL_REQ) == 6, "PROTO_NC_CHAT_RESTRICT_DB_DEL_ALL_REQ size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_DEL_REQ { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_DEL_REQ) == 10, "PROTO_NC_CHAT_RESTRICT_DB_DEL_REQ size drift");

struct PROTO_NC_CHAT_RESTRICT_DB_LIST_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_CHAT_RESTRICT_DB_INFO_______0_bytes___ ChatRestrictData;
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DB_LIST_CMD) == 2, "PROTO_NC_CHAT_RESTRICT_DB_LIST_CMD size drift");

struct PROTO_NC_CHAT_RESTRICT_DEL_ACK {
    uint8_t _pad_at_0000[2];
    Name5 sChatRestrictCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DEL_ACK) == 22, "PROTO_NC_CHAT_RESTRICT_DEL_ACK size drift");

struct PROTO_NC_CHAT_RESTRICT_DEL_ALL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DEL_ALL_ACK) == 2, "PROTO_NC_CHAT_RESTRICT_DEL_ALL_ACK size drift");

struct PROTO_NC_CHAT_RESTRICT_DEL_ALL_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DEL_ALL_REQ) == 1, "PROTO_NC_CHAT_RESTRICT_DEL_ALL_REQ size drift");

struct PROTO_NC_CHAT_RESTRICT_DEL_REQ {
    Name5 sChatRestrictCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_DEL_REQ) == 20, "PROTO_NC_CHAT_RESTRICT_DEL_REQ size drift");

struct PROTO_NC_CHAT_RESTRICT_LIST_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_CHAT_RESTRICT_INFO_______0_bytes___ ChatRestrictData;
};
static_assert(sizeof(PROTO_NC_CHAT_RESTRICT_LIST_CMD) == 2, "PROTO_NC_CHAT_RESTRICT_LIST_CMD size drift");

struct PROTO_NC_CHER_EVENT_ATTENDANCE_CHANGE_START_CMD {
    tm tEventStart;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_CHER_EVENT_ATTENDANCE_CHANGE_START_CMD) == 36, "PROTO_NC_CHER_EVENT_ATTENDANCE_CHANGE_START_CMD size drift");

struct PROTO_NC_COLLECT_BOOKMARK_REGIST_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_COLLECT_BOOKMARK_REGIST_ACK) == 6, "PROTO_NC_COLLECT_BOOKMARK_REGIST_ACK size drift");

struct PROTO_NC_COLLECT_BOOKMARK_REGIST_DB_ACK { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_COLLECT_BOOKMARK_REGIST_DB_ACK) == 12, "PROTO_NC_COLLECT_BOOKMARK_REGIST_DB_ACK size drift");

struct PROTO_NC_COLLECT_BOOKMARK_REGIST_DB_REQ { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_COLLECT_BOOKMARK_REGIST_DB_REQ) == 10, "PROTO_NC_COLLECT_BOOKMARK_REGIST_DB_REQ size drift");

struct PROTO_NC_COLLECT_BOOKMARK_REGIST_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_COLLECT_BOOKMARK_REGIST_REQ) == 4, "PROTO_NC_COLLECT_BOOKMARK_REGIST_REQ size drift");

struct PROTO_NC_COLLECT_CARDOPEN_CMD {
    uint8_t _pad_at_0000[3];
    SHINE_ITEM_STRUCT CardInform;
    uint8_t _tail[103];
};
static_assert(sizeof(PROTO_NC_COLLECT_CARDOPEN_CMD) == 106, "PROTO_NC_COLLECT_CARDOPEN_CMD size drift");

struct PROTO_NC_COLLECT_CARDREGIST_ACK { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_COLLECT_CARDREGIST_ACK) == 10, "PROTO_NC_COLLECT_CARDREGIST_ACK size drift");

struct PROTO_NC_COLLECT_CARDREGIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_COLLECT_CARDREGIST_REQ) == 1, "PROTO_NC_COLLECT_CARDREGIST_REQ size drift");

struct PROTO_NC_COLLECT_CHARACTERDB_UP_GET_CARDCOUNT_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_COLLECT_CHARACTERDB_UP_GET_CARDCOUNT_CMD) == 1, "PROTO_NC_COLLECT_CHARACTERDB_UP_GET_CARDCOUNT_CMD size drift");

struct PROTO_NC_COLLECT_PEEPING_COLLECT_ACK {
    Name5 charname;
    uint8_t _pad_at_0000[22];
    PROTO_NC_CHAR_CARDCOLLECT_CMD collection;
};
static_assert(sizeof(PROTO_NC_COLLECT_PEEPING_COLLECT_ACK) == 28, "PROTO_NC_COLLECT_PEEPING_COLLECT_ACK size drift");

struct PROTO_NC_COLLECT_PEEPING_COLLECT_BOOKMARK_ACK {
    Name5 charname;
    uint8_t _pad_at_0000[22];
    PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD collectionview;
};
static_assert(sizeof(PROTO_NC_COLLECT_PEEPING_COLLECT_BOOKMARK_ACK) == 28, "PROTO_NC_COLLECT_PEEPING_COLLECT_BOOKMARK_ACK size drift");

struct PROTO_NC_COLLECT_PEEPING_DB_COLLECT_ACK {
    uint8_t _pad_at_0000[6];
    Name5 targetcharname;
    uint8_t _pad_at_0006[22];
    PROTO_NC_CHAR_CARDCOLLECT_CMD collection;
};
static_assert(sizeof(PROTO_NC_COLLECT_PEEPING_DB_COLLECT_ACK) == 34, "PROTO_NC_COLLECT_PEEPING_DB_COLLECT_ACK size drift");

struct PROTO_NC_COLLECT_PEEPING_DB_COLLECT_BOOKMARK_ACK {
    uint8_t _pad_at_0000[6];
    Name5 targetcharname;
    uint8_t _pad_at_0006[22];
    PROTO_NC_CHAR_CARDCOLLECT_BOOKMARK_CMD collectionview;
};
static_assert(sizeof(PROTO_NC_COLLECT_PEEPING_DB_COLLECT_BOOKMARK_ACK) == 34, "PROTO_NC_COLLECT_PEEPING_DB_COLLECT_BOOKMARK_ACK size drift");

struct PROTO_NC_COLLECT_PEEPING_DB_REQ {
    uint8_t _pad_at_0000[6];
    Name5 targetcharname;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_COLLECT_PEEPING_DB_REQ) == 26, "PROTO_NC_COLLECT_PEEPING_DB_REQ size drift");

struct PROTO_NC_COLLECT_PEEPING_REQ {
    Name5 charname;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_COLLECT_PEEPING_REQ) == 20, "PROTO_NC_COLLECT_PEEPING_REQ size drift");

struct PROTO_NC_COLLECT_REGIST_ACK {
    uint8_t _pad_at_0000[8];
    PROTO_NC_COLLECT_CARDREGIST_ACK CardInfo;
};
static_assert(sizeof(PROTO_NC_COLLECT_REGIST_ACK) == 18, "PROTO_NC_COLLECT_REGIST_ACK size drift");

struct PROTO_NC_COLLECT_REGIST_REQ {
    uint8_t _pad_at_0000[8];
    SHINE_ITEM_REGISTNUMBER CardKey;
    uint8_t _pad_at_0008[8];
    PROTO_NC_COLLECT_CARDREGIST_ACK CardInfo;
};
static_assert(sizeof(PROTO_NC_COLLECT_REGIST_REQ) == 26, "PROTO_NC_COLLECT_REGIST_REQ size drift");

struct PROTO_NC_COLLECT_REWARD_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_COLLECT_REWARD_ACK) == 4, "PROTO_NC_COLLECT_REWARD_ACK size drift");

struct PROTO_NC_COLLECT_REWARD_DB_ACK { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_COLLECT_REWARD_DB_ACK) == 10, "PROTO_NC_COLLECT_REWARD_DB_ACK size drift");

struct PROTO_NC_COLLECT_REWARD_DB_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_COLLECT_REWARD_DB_REQ) == 8, "PROTO_NC_COLLECT_REWARD_DB_REQ size drift");

struct PROTO_NC_COLLECT_REWARD_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_COLLECT_REWARD_REQ) == 4, "PROTO_NC_COLLECT_REWARD_REQ size drift");

struct PROTO_NC_CT_ADD_FRIEND_CMD {
    NETPACKETZONEHEADER header;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CT_ADD_FRIEND_CMD) == 8, "PROTO_NC_CT_ADD_FRIEND_CMD size drift");

struct PROTO_NC_CT_CHARTTING_CMD {
    NETPACKETZONEHEADER header;
};
static_assert(sizeof(PROTO_NC_CT_CHARTTING_CMD) == 6, "PROTO_NC_CT_CHARTTING_CMD size drift");

struct PROTO_NC_CT_DB_SET_CMD {
    NETPACKETZONEHEADER header;
    CT_INFO Info;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CT_DB_SET_CMD) == 8, "PROTO_NC_CT_DB_SET_CMD size drift");

struct PROTO_NC_CT_LUASCRIPT_SET_WORLD_CMD {
    uint8_t _pad_at_0000[4];
    CT_INFO CTInfo;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CT_LUASCRIPT_SET_WORLD_CMD) == 6, "PROTO_NC_CT_LUASCRIPT_SET_WORLD_CMD size drift");

struct PROTO_NC_CT_LUASCRIPT_SET_ZONE_CMD {
    uint8_t _pad_at_0000[4];
    CT_INFO CTInfo;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CT_LUASCRIPT_SET_ZONE_CMD) == 6, "PROTO_NC_CT_LUASCRIPT_SET_ZONE_CMD size drift");

struct PROTO_NC_CT_SET_CMD {
    CT_INFO Info;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CT_SET_CMD) == 2, "PROTO_NC_CT_SET_CMD size drift");

struct PROTO_NC_CT_SET_CURRENT_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CT_SET_CURRENT_ACK) == 6, "PROTO_NC_CT_SET_CURRENT_ACK size drift");

struct PROTO_NC_CT_SET_CURRENT_DB_CMD {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[4];
    CT_INFO UseTitle;
    uint8_t _pad_at_000a[2];
    CT_INFO UseAbleTitle;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_CT_SET_CURRENT_DB_CMD) == 14, "PROTO_NC_CT_SET_CURRENT_DB_CMD size drift");

struct PROTO_NC_CT_SET_CURRENT_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_CT_SET_CURRENT_REQ) == 4, "PROTO_NC_CT_SET_CURRENT_REQ size drift");

struct PROTO_NC_CT_SET_SOMEONECHANGE_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_CT_SET_SOMEONECHANGE_CMD) == 6, "PROTO_NC_CT_SET_SOMEONECHANGE_CMD size drift");

struct PROTO_NC_DATA_PRISON_ADD_GM_ACK {
    uint8_t _pad_at_0000[8];
    Name5 sImprison;
    uint8_t _pad_at_0008[22];
    wchar_t sReason[16];
    wchar_t sRemark[64];
};
static_assert(sizeof(PROTO_NC_DATA_PRISON_ADD_GM_ACK) == 110, "PROTO_NC_DATA_PRISON_ADD_GM_ACK size drift");

struct PROTO_NC_DATA_PRISON_ADD_GM_REQ {
    uint8_t _pad_at_0000[2];
    Name256Byte sGmUserID;
    uint8_t _pad_at_0002[260];
    Name5 sImprison;
    uint8_t _pad_at_0106[22];
    wchar_t sReason[16];
    wchar_t sRemark[64];
};
static_assert(sizeof(PROTO_NC_DATA_PRISON_ADD_GM_REQ) == 364, "PROTO_NC_DATA_PRISON_ADD_GM_REQ size drift");

struct PROTO_NC_DATA_PRISON_ALTER_GM_ACK {
    uint8_t _pad_at_0000[8];
    Name5 sImprison;
    uint8_t _pad_at_0008[22];
    wchar_t sReason[16];
    wchar_t sRemark[64];
};
static_assert(sizeof(PROTO_NC_DATA_PRISON_ALTER_GM_ACK) == 110, "PROTO_NC_DATA_PRISON_ALTER_GM_ACK size drift");

struct PROTO_NC_DATA_PRISON_ALTER_GM_REQ {
    uint8_t _pad_at_0000[2];
    Name256Byte sGmUserID;
    uint8_t _pad_at_0002[260];
    Name5 sImprison;
    uint8_t _pad_at_0106[22];
    wchar_t sReason[16];
    wchar_t sRemark[64];
};
static_assert(sizeof(PROTO_NC_DATA_PRISON_ALTER_GM_REQ) == 364, "PROTO_NC_DATA_PRISON_ALTER_GM_REQ size drift");

struct PROTO_NC_DATA_PRISON_GET_ACK {
    uint8_t _pad_at_0000[4];
    wchar_t sReason[16];
    wchar_t sRemark[64];
};
static_assert(sizeof(PROTO_NC_DATA_PRISON_GET_ACK) == 84, "PROTO_NC_DATA_PRISON_GET_ACK size drift");

struct PROTO_NC_DATA_PRISON_GET_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_DATA_PRISON_GET_REQ) == 6, "PROTO_NC_DATA_PRISON_GET_REQ size drift");

struct PROTO_NC_DATA_PRISON_UPDATE_MIN_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_DATA_PRISON_UPDATE_MIN_CMD) == 6, "PROTO_NC_DATA_PRISON_UPDATE_MIN_CMD size drift");

struct PROTO_NC_DATA_REPORT_ADD_ACK {
    uint8_t _pad_at_0000[4];
    Name5 sHarmer;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_DATA_REPORT_ADD_ACK) == 28, "PROTO_NC_DATA_REPORT_ADD_ACK size drift");

struct PROTO_NC_DATA_REPORT_ADD_REQ {
    uint8_t _pad_at_0000[7];
    Name5 sReporterCharID;
    uint8_t _pad_at_0007[20];
    Name5 sHarmer;
    uint8_t _pad_at_001b[20];
    uint8_t byReportType[16];
    uint8_t byReason[256];
    uint8_t _pad_at_013f[2];
    uint8_t byChatLog[2048];
};
static_assert(sizeof(PROTO_NC_DATA_REPORT_ADD_REQ) == 2369, "PROTO_NC_DATA_REPORT_ADD_REQ size drift");

struct PROTO_NC_DATA_REPORT_CANCEL_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_DATA_REPORT_CANCEL_ACK) == 8, "PROTO_NC_DATA_REPORT_CANCEL_ACK size drift");

struct PROTO_NC_DATA_REPORT_CANCEL_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_DATA_REPORT_CANCEL_REQ) == 6, "PROTO_NC_DATA_REPORT_CANCEL_REQ size drift");

struct PROTO_NC_DATA_REPORT_GET_ACK {
    uint8_t _pad_at_0000[9];
    uint8_t byRemark[128];
};
static_assert(sizeof(PROTO_NC_DATA_REPORT_GET_ACK) == 137, "PROTO_NC_DATA_REPORT_GET_ACK size drift");

struct PROTO_NC_DATA_REPORT_GET_REQ { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_DATA_REPORT_GET_REQ) == 7, "PROTO_NC_DATA_REPORT_GET_REQ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_ADD_ACK_ { uint8_t data[31]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_ADD_ACK_) == 31, "PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_ADD_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_CANCEL_ACK_ { uint8_t data[11]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_CANCEL_ACK_) == 11, "PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_CANCEL_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_GET_ACK_ { uint8_t data[140]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_GET_ACK_) == 140, "PROTO_NC_DATA_SEND1_PROTO_NC_DATA_REPORT_GET_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_MISC_CONNECTFROMWHERE_DB_ACK_ { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_MISC_CONNECTFROMWHERE_DB_ACK_) == 12, "PROTO_NC_DATA_SEND1_PROTO_NC_MISC_CONNECTFROMWHERE_DB_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_MISC_EVENT_DONE_MUNSANG_ACC2WM_ { uint8_t data[18]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_MISC_EVENT_DONE_MUNSANG_ACC2WM_) == 18, "PROTO_NC_DATA_SEND1_PROTO_NC_MISC_EVENT_DONE_MUNSANG_ACC2WM_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_MISC_EVENT_L20_DB_ACK_ { uint8_t data[16]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_MISC_EVENT_L20_DB_ACK_) == 16, "PROTO_NC_DATA_SEND1_PROTO_NC_MISC_EVENT_L20_DB_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_USER_GER_IS_IP_BLOCK_ACK_ { uint8_t data[293]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_USER_GER_IS_IP_BLOCK_ACK_) == 293, "PROTO_NC_DATA_SEND1_PROTO_NC_USER_GER_IS_IP_BLOCK_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_USER_IS_IP_BLOCK_ACK_ { uint8_t data[278]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_USER_IS_IP_BLOCK_ACK_) == 278, "PROTO_NC_DATA_SEND1_PROTO_NC_USER_IS_IP_BLOCK_ACK_ size drift");

struct PROTO_NC_DATA_SEND1_PROTO_NC_USER_TW_IS_IP_BLOCK_ACK_ { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_DATA_SEND1_PROTO_NC_USER_TW_IS_IP_BLOCK_ACK_) == 14, "PROTO_NC_DATA_SEND1_PROTO_NC_USER_TW_IS_IP_BLOCK_ACK_ size drift");

struct PROTO_NC_DICE_TAISAI_BETTING_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BETTING_ACK) == 4, "PROTO_NC_DICE_TAISAI_BETTING_ACK size drift");

struct PROTO_NC_DICE_TAISAI_BETTING_CANCEL_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BETTING_CANCEL_ACK) == 4, "PROTO_NC_DICE_TAISAI_BETTING_CANCEL_ACK size drift");

struct PROTO_NC_DICE_TAISAI_BETTING_CANCEL_CMD {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiBetting BettingCancelInfo;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BETTING_CANCEL_CMD) == 10, "PROTO_NC_DICE_TAISAI_BETTING_CANCEL_CMD size drift");

struct PROTO_NC_DICE_TAISAI_BETTING_CANCEL_REQ {
    DiceTaiSaiBetting BettingCancelInfo;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BETTING_CANCEL_REQ) == 10, "PROTO_NC_DICE_TAISAI_BETTING_CANCEL_REQ size drift");

struct PROTO_NC_DICE_TAISAI_BETTING_CMD {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiBetting BettingInfo;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BETTING_CMD) == 10, "PROTO_NC_DICE_TAISAI_BETTING_CMD size drift");

struct PROTO_NC_DICE_TAISAI_BETTING_REQ {
    DiceTaiSaiBetting BettingInfo;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BETTING_REQ) == 10, "PROTO_NC_DICE_TAISAI_BETTING_REQ size drift");

struct PROTO_NC_DICE_TAISAI_BET_START_CMD {
    DICE_TAISAI_GAME_MODE bModeType;
    uint8_t _pad_at_0000[4];
    DiceTaiSaiInfo CurrentRollingDice;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BET_START_CMD) == 7, "PROTO_NC_DICE_TAISAI_BET_START_CMD size drift");

struct PROTO_NC_DICE_TAISAI_BOARD_FOLD_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BOARD_FOLD_CMD) == 1, "PROTO_NC_DICE_TAISAI_BOARD_FOLD_CMD size drift");

struct PROTO_NC_DICE_TAISAI_BOARD_FOLD_RESERVE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BOARD_FOLD_RESERVE_CMD) == 1, "PROTO_NC_DICE_TAISAI_BOARD_FOLD_RESERVE_CMD size drift");

struct PROTO_NC_DICE_TAISAI_BOARD_PITCH_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_BOARD_PITCH_CMD) == 1, "PROTO_NC_DICE_TAISAI_BOARD_PITCH_CMD size drift");

struct PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_ACK {
    uint8_t _pad_at_0000[6];
    NETPACKETZONEHEADER header;
    SHINE_ITEM_REGISTNUMBER nActiveDiceTaiSaiKey;
    uint8_t _pad_at_000c[10];
    DiceRollApplyResult_______0_bytes___ DiceRollResult;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_ACK) == 22, "PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_ACK size drift");

struct PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_LOG_CMD {
    NETPACKETZONEHEADER header;
    SHINE_ITEM_REGISTNUMBER nActiveDiceTaiSaiKey;
    uint8_t _pad_at_0006[14];
    DiceRollApplyResultLog_______0_bytes___ DiceRollResultLog;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_LOG_CMD) == 20, "PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_LOG_CMD size drift");

struct PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_REQ {
    NETPACKETZONEHEADER header;
    SHINE_ITEM_REGISTNUMBER nActiveDiceTaiSaiKey;
    uint8_t _pad_at_0006[8];
    DiceTaiSaiInfo DiceNum;
    uint8_t _pad_at_000e[5];
    DiceRollApplyResult_______0_bytes___ DiceRollResult;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_REQ) == 19, "PROTO_NC_DICE_TAISAI_DB_DICE_ROLL_RESULT_REQ size drift");

struct PROTO_NC_DICE_TAISAI_DB_EXPECT_INCOME_MONEY_ACK {
    uint8_t _pad_at_0000[2];
    NETPACKETZONEHEADER header;
    ITEM_INVEN nInvenSlot;
    uint8_t _pad_at_0008[2];
    SHINE_ITEM_REGISTNUMBER nTaiSaiItemKey;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_EXPECT_INCOME_MONEY_ACK) == 30, "PROTO_NC_DICE_TAISAI_DB_EXPECT_INCOME_MONEY_ACK size drift");

struct PROTO_NC_DICE_TAISAI_DB_EXPECT_INCOME_MONEY_REQ {
    NETPACKETZONEHEADER header;
    ITEM_INVEN nInvenSlot;
    uint8_t _pad_at_0006[2];
    SHINE_ITEM_REGISTNUMBER nTaiSaiItemKey;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_EXPECT_INCOME_MONEY_REQ) == 26, "PROTO_NC_DICE_TAISAI_DB_EXPECT_INCOME_MONEY_REQ size drift");

struct PROTO_NC_DICE_TAISAI_DB_ITEM_ID_CHANGE_ACK {
    uint8_t _pad_at_0000[2];
    NETPACKETZONEHEADER header;
    ITEM_INVEN nInvenSlot;
    uint8_t _pad_at_0008[4];
    SHINE_ITEM_REGISTNUMBER nDiceTaiSaiKey;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_ITEM_ID_CHANGE_ACK) == 32, "PROTO_NC_DICE_TAISAI_DB_ITEM_ID_CHANGE_ACK size drift");

struct PROTO_NC_DICE_TAISAI_DB_ITEM_ID_CHANGE_REQ {
    NETPACKETZONEHEADER header;
    ITEM_INVEN nInvenSlot;
    uint8_t _pad_at_0006[4];
    SHINE_ITEM_REGISTNUMBER nDiceTaiSaiKey;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_ITEM_ID_CHANGE_REQ) == 32, "PROTO_NC_DICE_TAISAI_DB_ITEM_ID_CHANGE_REQ size drift");

struct PROTO_NC_DICE_TAISAI_DB_RANK_ACK {
    uint8_t _pad_at_0000[2];
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0008[5];
    DiceRankInfo_______0_bytes___ Rank;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_RANK_ACK) == 13, "PROTO_NC_DICE_TAISAI_DB_RANK_ACK size drift");

struct PROTO_NC_DICE_TAISAI_DB_RANK_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[4];
    SHINE_ITEM_REGISTNUMBER nTaiSaiItemKey;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_RANK_REQ) == 18, "PROTO_NC_DICE_TAISAI_DB_RANK_REQ size drift");

struct PROTO_NC_DICE_TAISAI_DB_RECEIPT_INCOME_MONEY_ACK {
    uint8_t _pad_at_0000[4];
    NETPACKETZONEHEADER header;
    ITEM_INVEN nInvenSlot;
    uint8_t _pad_at_000a[2];
    SHINE_ITEM_REGISTNUMBER nTaiSaiItemKey;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_RECEIPT_INCOME_MONEY_ACK) == 28, "PROTO_NC_DICE_TAISAI_DB_RECEIPT_INCOME_MONEY_ACK size drift");

struct PROTO_NC_DICE_TAISAI_DB_RECEIPT_INCOME_MONEY_REQ {
    uint8_t _pad_at_0000[2];
    NETPACKETZONEHEADER header;
    ITEM_INVEN nInvenSlot;
    uint8_t _pad_at_0008[2];
    SHINE_ITEM_REGISTNUMBER nTaiSaiItemKey;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DB_RECEIPT_INCOME_MONEY_REQ) == 18, "PROTO_NC_DICE_TAISAI_DB_RECEIPT_INCOME_MONEY_REQ size drift");

struct PROTO_NC_DICE_TAISAI_DICE_ROLL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DICE_ROLL_ACK) == 2, "PROTO_NC_DICE_TAISAI_DICE_ROLL_ACK size drift");

struct PROTO_NC_DICE_TAISAI_DICE_ROLL_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DICE_ROLL_CMD) == 2, "PROTO_NC_DICE_TAISAI_DICE_ROLL_CMD size drift");

struct PROTO_NC_DICE_TAISAI_DICE_ROLL_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DICE_ROLL_REQ) == 1, "PROTO_NC_DICE_TAISAI_DICE_ROLL_REQ size drift");

struct PROTO_NC_DICE_TAISAI_DICE_ROLL_RESULT_CMD {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiInfo nDiceInfo;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DICE_ROLL_RESULT_CMD) == 5, "PROTO_NC_DICE_TAISAI_DICE_ROLL_RESULT_CMD size drift");

struct PROTO_NC_DICE_TAISAI_DICE_ROLL_RESULT_EMOTION_CMD {
    uint8_t _pad_at_0000[1];
    EmotionInfo_______0_bytes___ Emotion;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_DICE_ROLL_RESULT_EMOTION_CMD) == 1, "PROTO_NC_DICE_TAISAI_DICE_ROLL_RESULT_EMOTION_CMD size drift");

struct PROTO_NC_DICE_TAISAI_EXPECT_INCOME_MONEY_ACK {
    uint8_t _pad_at_0000[2];
    ITEM_INVEN nInvenSlot;
    uint8_t _tail[14];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_EXPECT_INCOME_MONEY_ACK) == 16, "PROTO_NC_DICE_TAISAI_EXPECT_INCOME_MONEY_ACK size drift");

struct PROTO_NC_DICE_TAISAI_EXPECT_INCOME_MONEY_REQ {
    ITEM_INVEN nInvenSlot;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_EXPECT_INCOME_MONEY_REQ) == 2, "PROTO_NC_DICE_TAISAI_EXPECT_INCOME_MONEY_REQ size drift");

struct PROTO_NC_DICE_TAISAI_GAME_BETTING_INFO_CMD {
    uint8_t _pad_at_0000[3];
    BettingInfo_______0_bytes___ Betting;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_BETTING_INFO_CMD) == 3, "PROTO_NC_DICE_TAISAI_GAME_BETTING_INFO_CMD size drift");

struct PROTO_NC_DICE_TAISAI_GAME_JOIN_ACK {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiInfo_______21_bytes___ DiceHistory;
    uint8_t _pad_at_0002[21];
    DICE_TAISAI_GAME_STATUS nGameStatus;
    uint8_t _pad_at_0017[4];
    DICE_TAISAI_GAME_MODE bModeType;
    uint8_t _pad_at_001b[23];
    uint16_t nGamerHnd[0];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_JOIN_ACK) == 50, "PROTO_NC_DICE_TAISAI_GAME_JOIN_ACK size drift");

struct PROTO_NC_DICE_TAISAI_GAME_JOIN_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_JOIN_CMD) == 2, "PROTO_NC_DICE_TAISAI_GAME_JOIN_CMD size drift");

struct PROTO_NC_DICE_TAISAI_GAME_JOIN_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_JOIN_REQ) == 1, "PROTO_NC_DICE_TAISAI_GAME_JOIN_REQ size drift");

struct PROTO_NC_DICE_TAISAI_GAME_LEAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_LEAVE_ACK) == 2, "PROTO_NC_DICE_TAISAI_GAME_LEAVE_ACK size drift");

struct PROTO_NC_DICE_TAISAI_GAME_LEAVE_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_LEAVE_CMD) == 3, "PROTO_NC_DICE_TAISAI_GAME_LEAVE_CMD size drift");

struct PROTO_NC_DICE_TAISAI_GAME_LEAVE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_LEAVE_REQ) == 1, "PROTO_NC_DICE_TAISAI_GAME_LEAVE_REQ size drift");

struct PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_ACK {
    uint8_t _pad_at_0000[2];
    DICE_TAISAI_GAME_MODE bModeType;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_ACK) == 6, "PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_ACK size drift");

struct PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_CMD {
    DICE_TAISAI_GAME_MODE bModeType;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_CMD) == 4, "PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_CMD size drift");

struct PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_REQ) == 1, "PROTO_NC_DICE_TAISAI_GAME_MODE_CHANGE_REQ size drift");

struct PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_ACK) == 2, "PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_ACK size drift");

struct PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_CMD {
    uint8_t _pad_at_0000[1];
    LargeAmountInfo_______0_bytes___ LargeAmount;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_CMD) == 1, "PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_CMD size drift");

struct PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_REQ) == 4, "PROTO_NC_DICE_TAISAI_LARGE_AMOUNT_REQ size drift");

struct PROTO_NC_DICE_TAISAI_RANK_ACK {
    uint8_t _pad_at_0000[3];
    DiceRankInfo_______480_bytes___ RankHistory;
    uint8_t _pad_at_0003[481];
    DiceRankInfo_______0_bytes___ RankCurr;
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_RANK_ACK) == 484, "PROTO_NC_DICE_TAISAI_RANK_ACK size drift");

struct PROTO_NC_DICE_TAISAI_RANK_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_RANK_REQ) == 1, "PROTO_NC_DICE_TAISAI_RANK_REQ size drift");

struct PROTO_NC_DICE_TAISAI_RECEIPT_INCOME_MONEY_ACK {
    uint8_t _pad_at_0000[2];
    ITEM_INVEN nInvenSlot;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_RECEIPT_INCOME_MONEY_ACK) == 12, "PROTO_NC_DICE_TAISAI_RECEIPT_INCOME_MONEY_ACK size drift");

struct PROTO_NC_DICE_TAISAI_RECEIPT_INCOME_MONEY_REQ {
    ITEM_INVEN nInvenSlot;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_DICE_TAISAI_RECEIPT_INCOME_MONEY_REQ) == 2, "PROTO_NC_DICE_TAISAI_RECEIPT_INCOME_MONEY_REQ size drift");

struct PROTO_NC_DICE_TAISAI_TIMER_CMD { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_DICE_TAISAI_TIMER_CMD) == 7, "PROTO_NC_DICE_TAISAI_TIMER_CMD size drift");

struct PROTO_NC_EVENT_ADD_EVENT_ACK {
    uint8_t _pad_at_0000[2];
    GM_EVENT_DATA EventData;
    uint8_t _tail[1363];
};
static_assert(sizeof(PROTO_NC_EVENT_ADD_EVENT_ACK) == 1365, "PROTO_NC_EVENT_ADD_EVENT_ACK size drift");

struct PROTO_NC_EVENT_ADD_EVENT_REQ {
    GM_EVENT_DATA EventData;
    uint8_t _tail[1363];
};
static_assert(sizeof(PROTO_NC_EVENT_ADD_EVENT_REQ) == 1363, "PROTO_NC_EVENT_ADD_EVENT_REQ size drift");

struct PROTO_NC_EVENT_ADD_UPDATE_EVENT_CMD {
    GM_EVENT_DATA EventData;
    uint8_t _tail[1363];
};
static_assert(sizeof(PROTO_NC_EVENT_ADD_UPDATE_EVENT_CMD) == 1363, "PROTO_NC_EVENT_ADD_UPDATE_EVENT_CMD size drift");

struct PROTO_NC_EVENT_DEL_EVENT_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_EVENT_DEL_EVENT_ACK) == 4, "PROTO_NC_EVENT_DEL_EVENT_ACK size drift");

struct PROTO_NC_EVENT_DEL_EVENT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_EVENT_DEL_EVENT_CMD) == 2, "PROTO_NC_EVENT_DEL_EVENT_CMD size drift");

struct PROTO_NC_EVENT_DEL_EVENT_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_EVENT_DEL_EVENT_REQ) == 2, "PROTO_NC_EVENT_DEL_EVENT_REQ size drift");

struct PROTO_NC_EVENT_GET_ALL_EVENT_INFO_ACK {
    uint8_t _pad_at_0000[6];
    GM_EVENT_DATA EventData;
    uint8_t _tail[1364];
};
static_assert(sizeof(PROTO_NC_EVENT_GET_ALL_EVENT_INFO_ACK) == 1370, "PROTO_NC_EVENT_GET_ALL_EVENT_INFO_ACK size drift");

struct PROTO_NC_EVENT_GET_ALL_EVENT_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_EVENT_GET_ALL_EVENT_INFO_REQ) == 1, "PROTO_NC_EVENT_GET_ALL_EVENT_INFO_REQ size drift");

struct PROTO_NC_EVENT_SET_ALL_READY_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_EVENT_SET_ALL_READY_ACK) == 4, "PROTO_NC_EVENT_SET_ALL_READY_ACK size drift");

struct PROTO_NC_EVENT_SET_ALL_READY_REQ { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_EVENT_SET_ALL_READY_REQ) == 3, "PROTO_NC_EVENT_SET_ALL_READY_REQ size drift");

struct PROTO_NC_EVENT_UPDATE_EVENT_ACK {
    uint8_t _pad_at_0000[2];
    GM_EVENT_DATA EventData;
    uint8_t _tail[1363];
};
static_assert(sizeof(PROTO_NC_EVENT_UPDATE_EVENT_ACK) == 1365, "PROTO_NC_EVENT_UPDATE_EVENT_ACK size drift");

struct PROTO_NC_EVENT_UPDATE_EVENT_REQ {
    GM_EVENT_DATA EventData;
    uint8_t _tail[1363];
};
static_assert(sizeof(PROTO_NC_EVENT_UPDATE_EVENT_REQ) == 1363, "PROTO_NC_EVENT_UPDATE_EVENT_REQ size drift");

struct PROTO_NC_FRIEND_ADD_CMD {
    PROTO_FRIEND_INFO friendinfo;
    uint8_t _tail[72];
};
static_assert(sizeof(PROTO_NC_FRIEND_ADD_CMD) == 72, "PROTO_NC_FRIEND_ADD_CMD size drift");

struct PROTO_NC_FRIEND_CLASS_CHANGE_CMD {
    Name5 charid;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_FRIEND_CLASS_CHANGE_CMD) == 21, "PROTO_NC_FRIEND_CLASS_CHANGE_CMD size drift");

struct PROTO_NC_FRIEND_DB_DEL_ACK {
    uint8_t _pad_at_0000[6];
    Name5 charid;
    uint8_t _pad_at_0006[20];
    Name5 friendid;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_FRIEND_DB_DEL_ACK) == 48, "PROTO_NC_FRIEND_DB_DEL_ACK size drift");

struct PROTO_NC_FRIEND_DB_DEL_REQ {
    uint8_t _pad_at_0000[6];
    Name5 charid;
    uint8_t _pad_at_0006[20];
    Name5 friendid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_DB_DEL_REQ) == 46, "PROTO_NC_FRIEND_DB_DEL_REQ size drift");

struct PROTO_NC_FRIEND_DB_GET_ACK {
    uint8_t _pad_at_0000[12];
    PROTO_FRIEND_INFO friendinfo;
    uint8_t _tail[72];
};
static_assert(sizeof(PROTO_NC_FRIEND_DB_GET_ACK) == 84, "PROTO_NC_FRIEND_DB_GET_ACK size drift");

struct PROTO_NC_FRIEND_DB_GET_REQ { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_FRIEND_DB_GET_REQ) == 10, "PROTO_NC_FRIEND_DB_GET_REQ size drift");

struct PROTO_NC_FRIEND_DB_POINT { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_FRIEND_DB_POINT) == 8, "PROTO_NC_FRIEND_DB_POINT size drift");

struct PROTO_NC_FRIEND_DB_POINT_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_FRIEND_DB_POINT_______0_bytes___ pointinfo;
};
static_assert(sizeof(PROTO_NC_FRIEND_DB_POINT_CMD) == 2, "PROTO_NC_FRIEND_DB_POINT_CMD size drift");

struct PROTO_NC_FRIEND_DB_SET_ACK { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_FRIEND_DB_SET_ACK) == 14, "PROTO_NC_FRIEND_DB_SET_ACK size drift");

struct PROTO_NC_FRIEND_DB_SET_REQ { uint8_t data[13]; };
static_assert(sizeof(PROTO_NC_FRIEND_DB_SET_REQ) == 13, "PROTO_NC_FRIEND_DB_SET_REQ size drift");

struct PROTO_NC_FRIEND_DEL_ACK {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name5 friendid;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_FRIEND_DEL_ACK) == 42, "PROTO_NC_FRIEND_DEL_ACK size drift");

struct PROTO_NC_FRIEND_DEL_CMD {
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_DEL_CMD) == 20, "PROTO_NC_FRIEND_DEL_CMD size drift");

struct PROTO_NC_FRIEND_DEL_REQ {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name5 friendid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_DEL_REQ) == 40, "PROTO_NC_FRIEND_DEL_REQ size drift");

struct PROTO_NC_FRIEND_FIND_FRIENDS_ACK {
    uint8_t _pad_at_0000[4];
    PROTO_FRIEND_INFO_______0_bytes___ friendinfo;
};
static_assert(sizeof(PROTO_NC_FRIEND_FIND_FRIENDS_ACK) == 4, "PROTO_NC_FRIEND_FIND_FRIENDS_ACK size drift");

struct PROTO_NC_FRIEND_FIND_FRIENDS_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_FRIEND_FIND_FRIENDS_REQ) == 1, "PROTO_NC_FRIEND_FIND_FRIENDS_REQ size drift");

struct PROTO_NC_FRIEND_GET_DIFF_FRIEND_POINT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_FRIEND_GET_DIFF_FRIEND_POINT_CMD) == 2, "PROTO_NC_FRIEND_GET_DIFF_FRIEND_POINT_CMD size drift");

struct PROTO_NC_FRIEND_LEVEL_CMD {
    Name5 charid;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_FRIEND_LEVEL_CMD) == 21, "PROTO_NC_FRIEND_LEVEL_CMD size drift");

struct PROTO_NC_FRIEND_LIST_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_FRIEND_INFO_______0_bytes___ friendinfo;
};
static_assert(sizeof(PROTO_NC_FRIEND_LIST_CMD) == 1, "PROTO_NC_FRIEND_LIST_CMD size drift");

struct PROTO_NC_FRIEND_LOGIN_CMD {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name3 map;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_FRIEND_LOGIN_CMD) == 32, "PROTO_NC_FRIEND_LOGIN_CMD size drift");

struct PROTO_NC_FRIEND_LOGOUT_CMD {
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_LOGOUT_CMD) == 20, "PROTO_NC_FRIEND_LOGOUT_CMD size drift");

struct PROTO_NC_FRIEND_MAP_CMD {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name3 map;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_FRIEND_MAP_CMD) == 32, "PROTO_NC_FRIEND_MAP_CMD size drift");

struct PROTO_NC_FRIEND_PARTY_CMD {
    Name5 charid;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_FRIEND_PARTY_CMD) == 21, "PROTO_NC_FRIEND_PARTY_CMD size drift");

struct PROTO_NC_FRIEND_POINT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_FRIEND_POINT_ACK) == 2, "PROTO_NC_FRIEND_POINT_ACK size drift");

struct PROTO_NC_FRIEND_POINT_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_FRIEND_POINT_REQ) == 1, "PROTO_NC_FRIEND_POINT_REQ size drift");

struct PROTO_NC_FRIEND_REFUSE_CMD {
    Name5 friendid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_REFUSE_CMD) == 20, "PROTO_NC_FRIEND_REFUSE_CMD size drift");

struct PROTO_NC_FRIEND_SET_ACK {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name5 friendid;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_FRIEND_SET_ACK) == 42, "PROTO_NC_FRIEND_SET_ACK size drift");

struct PROTO_NC_FRIEND_SET_CONFIRM_ACK {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name5 friendid;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_FRIEND_SET_CONFIRM_ACK) == 41, "PROTO_NC_FRIEND_SET_CONFIRM_ACK size drift");

struct PROTO_NC_FRIEND_SET_CONFIRM_REQ {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name5 friendid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_SET_CONFIRM_REQ) == 40, "PROTO_NC_FRIEND_SET_CONFIRM_REQ size drift");

struct PROTO_NC_FRIEND_SET_REQ {
    Name5 charid;
    uint8_t _pad_at_0000[20];
    Name5 friendid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_SET_REQ) == 40, "PROTO_NC_FRIEND_SET_REQ size drift");

struct PROTO_NC_FRIEND_SOMEONE_GET_SPECIALITEM_WORLD_CMD {
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_SOMEONE_GET_SPECIALITEM_WORLD_CMD) == 20, "PROTO_NC_FRIEND_SOMEONE_GET_SPECIALITEM_WORLD_CMD size drift");

struct PROTO_NC_FRIEND_SOMEONE_GET_SPECIALITEM_ZONE_CMD {
    Name5 charid;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_FRIEND_SOMEONE_GET_SPECIALITEM_ZONE_CMD) == 20, "PROTO_NC_FRIEND_SOMEONE_GET_SPECIALITEM_ZONE_CMD size drift");

struct PROTO_NC_FRIEND_UES_FRIEND_POINT_ACK { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_FRIEND_UES_FRIEND_POINT_ACK) == 7, "PROTO_NC_FRIEND_UES_FRIEND_POINT_ACK size drift");

struct PROTO_NC_FRIEND_UES_FRIEND_POINT_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_FRIEND_UES_FRIEND_POINT_REQ) == 1, "PROTO_NC_FRIEND_UES_FRIEND_POINT_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_BUY_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_BUY_ACK) == 2, "PROTO_NC_GAMBLE_COIN_BUY_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_BUY_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_BUY_REQ) == 8, "PROTO_NC_GAMBLE_COIN_BUY_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_CHANGE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_CHANGE_CMD) == 8, "PROTO_NC_GAMBLE_COIN_CHANGE_CMD size drift");

struct PROTO_NC_GAMBLE_COIN_DB_ADD_ACK {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_ADD_ACK) == 10, "PROTO_NC_GAMBLE_COIN_DB_ADD_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_DB_ADD_REQ {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_ADD_REQ) == 16, "PROTO_NC_GAMBLE_COIN_DB_ADD_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_DB_BUY_ACK {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_BUY_ACK) == 10, "PROTO_NC_GAMBLE_COIN_DB_BUY_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_DB_BUY_REQ {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[26];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_BUY_REQ) == 32, "PROTO_NC_GAMBLE_COIN_DB_BUY_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_DB_SELL_ACK {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_SELL_ACK) == 10, "PROTO_NC_GAMBLE_COIN_DB_SELL_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_DB_SELL_REQ {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_SELL_REQ) == 24, "PROTO_NC_GAMBLE_COIN_DB_SELL_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_DB_USE_COINITEM_ACK {
    NETPACKETZONEHEADER nHeader;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_USE_COINITEM_ACK) == 18, "PROTO_NC_GAMBLE_COIN_DB_USE_COINITEM_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_DB_USE_COINITEM_REQ {
    NETPACKETZONEHEADER nHeader;
    SHINE_ITEM_REGISTNUMBER nItemReg;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_DB_USE_COINITEM_REQ) == 24, "PROTO_NC_GAMBLE_COIN_DB_USE_COINITEM_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_EXCHANGEMACHINE_UI_CLOSE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_EXCHANGEMACHINE_UI_CLOSE_CMD) == 1, "PROTO_NC_GAMBLE_COIN_EXCHANGEMACHINE_UI_CLOSE_CMD size drift");

struct PROTO_NC_GAMBLE_COIN_EXCHANGEMACHINE_UI_OPEN_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_EXCHANGEMACHINE_UI_OPEN_CMD) == 1, "PROTO_NC_GAMBLE_COIN_EXCHANGEMACHINE_UI_OPEN_CMD size drift");

struct PROTO_NC_GAMBLE_COIN_SELL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_SELL_ACK) == 2, "PROTO_NC_GAMBLE_COIN_SELL_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_SELL_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_SELL_REQ) == 8, "PROTO_NC_GAMBLE_COIN_SELL_REQ size drift");

struct PROTO_NC_GAMBLE_COIN_USE_COINITEM_MESSAGE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_USE_COINITEM_MESSAGE_CMD) == 8, "PROTO_NC_GAMBLE_COIN_USE_COINITEM_MESSAGE_CMD size drift");

struct PROTO_NC_GAMBLE_COIN_VIPCARD_UI_CLOSE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_VIPCARD_UI_CLOSE_CMD) == 1, "PROTO_NC_GAMBLE_COIN_VIPCARD_UI_CLOSE_CMD size drift");

struct PROTO_NC_GAMBLE_COIN_VIPCARD_UI_OPEN_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_VIPCARD_UI_OPEN_ACK) == 2, "PROTO_NC_GAMBLE_COIN_VIPCARD_UI_OPEN_ACK size drift");

struct PROTO_NC_GAMBLE_COIN_VIPCARD_UI_OPEN_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_COIN_VIPCARD_UI_OPEN_REQ) == 1, "PROTO_NC_GAMBLE_COIN_VIPCARD_UI_OPEN_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_ALL_RANK_ACK {
    uint8_t _pad_at_0000[3];
    GDT_DiceRankInfo_______0_bytes___ RankAll;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_ALL_RANK_ACK) == 3, "PROTO_NC_GAMBLE_DICE_TAISAI_ALL_RANK_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_ALL_RANK_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_ALL_RANK_REQ) == 1, "PROTO_NC_GAMBLE_DICE_TAISAI_ALL_RANK_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_ACK) == 4, "PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_ACK) == 4, "PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_CMD {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiBetting BettingCancelInfo;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_CMD) == 10, "PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_REQ {
    DiceTaiSaiBetting BettingCancelInfo;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_REQ) == 10, "PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CANCEL_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CMD {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiBetting BettingInfo;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CMD) == 10, "PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_REQ {
    DiceTaiSaiBetting BettingInfo;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_REQ) == 10, "PROTO_NC_GAMBLE_DICE_TAISAI_BETTING_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_BET_START_CMD {
    DICE_TAISAI_GAME_MODE bModeType;
    uint8_t _pad_at_0000[4];
    DiceTaiSaiInfo CurrentRollingDice;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_BET_START_CMD) == 7, "PROTO_NC_GAMBLE_DICE_TAISAI_BET_START_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_CURR_RANK_ACK {
    uint8_t _pad_at_0000[3];
    GDT_DiceRankInfo_______0_bytes___ RankCurr;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_CURR_RANK_ACK) == 3, "PROTO_NC_GAMBLE_DICE_TAISAI_CURR_RANK_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_CURR_RANK_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_CURR_RANK_REQ) == 1, "PROTO_NC_GAMBLE_DICE_TAISAI_CURR_RANK_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DB_ALL_RANK_ACK {
    uint8_t _pad_at_0000[2];
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0008[1];
    GDT_DiceRankInfo_______0_bytes___ RankAll;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DB_ALL_RANK_ACK) == 9, "PROTO_NC_GAMBLE_DICE_TAISAI_DB_ALL_RANK_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DB_ALL_RANK_REQ {
    NETPACKETZONEHEADER header;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DB_ALL_RANK_REQ) == 6, "PROTO_NC_GAMBLE_DICE_TAISAI_DB_ALL_RANK_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_ACK {
    uint8_t _pad_at_0000[6];
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_000c[2];
    GDT_DiceRollApplyResult_______0_bytes___ DiceRollResult;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_ACK) == 14, "PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_LOG_CMD {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[6];
    GDT_DiceRollApplyResultLog_______0_bytes___ DiceRollResultLog;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_LOG_CMD) == 12, "PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_LOG_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_REQ {
    NETPACKETZONEHEADER header;
    DiceTaiSaiInfo DiceNum;
    uint8_t _pad_at_0006[5];
    GDT_DiceRollApplyResult_______0_bytes___ DiceRollResult;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_REQ) == 11, "PROTO_NC_GAMBLE_DICE_TAISAI_DB_DICE_ROLL_RESULT_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_CMD) == 2, "PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_RESULT_CMD {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiInfo nDiceInfo;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_RESULT_CMD) == 5, "PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_RESULT_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_RESULT_EMOTION_CMD {
    uint8_t _pad_at_0000[1];
    GDT_EmotionInfo_______0_bytes___ Emotion;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_RESULT_EMOTION_CMD) == 1, "PROTO_NC_GAMBLE_DICE_TAISAI_DICE_ROLL_RESULT_EMOTION_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_BETTING_INFO_CMD {
    uint8_t _pad_at_0000[3];
    GDT_BettingInfo_______0_bytes___ Betting;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_BETTING_INFO_CMD) == 3, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_BETTING_INFO_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_ACK {
    uint8_t _pad_at_0000[2];
    DiceTaiSaiInfo_______21_bytes___ DiceHistory;
    uint8_t _pad_at_0002[21];
    DICE_TAISAI_GAME_STATUS nGameStatus;
    uint8_t _pad_at_0017[4];
    DICE_TAISAI_GAME_MODE bModeType;
    uint8_t _pad_at_001b[23];
    uint16_t nGamerHnd[0];
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_ACK) == 50, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_CMD) == 2, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_REQ) == 4, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_JOIN_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_ACK) == 2, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_CMD) == 3, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_REQ) == 1, "PROTO_NC_GAMBLE_DICE_TAISAI_GAME_LEAVE_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_ACK) == 2, "PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_ACK size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_CMD {
    uint8_t _pad_at_0000[1];
    GDT_LargeAmountInfo_______0_bytes___ LargeAmount;
};
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_CMD) == 1, "PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_CMD size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_REQ) == 4, "PROTO_NC_GAMBLE_DICE_TAISAI_LARGE_AMOUNT_REQ size drift");

struct PROTO_NC_GAMBLE_DICE_TAISAI_TIMER_CMD { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_GAMBLE_DICE_TAISAI_TIMER_CMD) == 7, "PROTO_NC_GAMBLE_DICE_TAISAI_TIMER_CMD size drift");

struct PROTO_NC_GAMBLE_ENTER_PLAYER_DIRECT_CMD { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_GAMBLE_ENTER_PLAYER_DIRECT_CMD) == 3, "PROTO_NC_GAMBLE_ENTER_PLAYER_DIRECT_CMD size drift");

struct PROTO_NC_GAMBLE_EXCHANGECOIN_CHANGE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GAMBLE_EXCHANGECOIN_CHANGE_CMD) == 8, "PROTO_NC_GAMBLE_EXCHANGECOIN_CHANGE_CMD size drift");

struct PROTO_NC_GAMBLE_EXCHANGEDCOIN_DB_INFO_ACK { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GAMBLE_EXCHANGEDCOIN_DB_INFO_ACK) == 12, "PROTO_NC_GAMBLE_EXCHANGEDCOIN_DB_INFO_ACK size drift");

struct PROTO_NC_GAMBLE_EXCHANGEDCOIN_DB_INFO_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GAMBLE_EXCHANGEDCOIN_DB_INFO_REQ) == 8, "PROTO_NC_GAMBLE_EXCHANGEDCOIN_DB_INFO_REQ size drift");

struct PROTO_NC_GAMBLE_EXCHANGEDCOIN_INIT_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_EXCHANGEDCOIN_INIT_CMD) == 4, "PROTO_NC_GAMBLE_EXCHANGEDCOIN_INIT_CMD size drift");

struct PROTO_NC_GAMBLE_GAMBLEHOUSE_EXIT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_GAMBLEHOUSE_EXIT_ACK) == 2, "PROTO_NC_GAMBLE_GAMBLEHOUSE_EXIT_ACK size drift");

struct PROTO_NC_GAMBLE_GAMBLEHOUSE_EXIT_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_GAMBLEHOUSE_EXIT_REQ) == 1, "PROTO_NC_GAMBLE_GAMBLEHOUSE_EXIT_REQ size drift");

struct PROTO_NC_GAMBLE_GAMBLEHOUSE_UI_CLOSE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_GAMBLEHOUSE_UI_CLOSE_CMD) == 1, "PROTO_NC_GAMBLE_GAMBLEHOUSE_UI_CLOSE_CMD size drift");

struct PROTO_NC_GAMBLE_GAMBLEHOUSE_UI_OPEN_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_GAMBLEHOUSE_UI_OPEN_CMD) == 1, "PROTO_NC_GAMBLE_GAMBLEHOUSE_UI_OPEN_CMD size drift");

struct PROTO_NC_GAMBLE_PLAYERACT_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GAMBLE_PLAYERACT_CMD) == 6, "PROTO_NC_GAMBLE_PLAYERACT_CMD size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_ACK {
    uint8_t _pad_at_0000[8];
    SLOTMACHINE_JackPotRank_______0_bytes___ RankList;
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_ACK) == 8, "PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ {
    uint8_t _pad_at_0000[1];
    PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ___unnamed_type_MachineIndex________0_bytes___ MachineIndex;
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ___unnamed_type_MachineIndex_ { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ___unnamed_type_MachineIndex_) == 3, "PROTO_NC_GAMBLE_SLOTMACHINE_DB_GAMEINFO_REQ___unnamed_type_MachineIndex_ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_DB_JACKPOT_RANK_UPDATE_CMD {
    uint8_t _pad_at_0000[1];
    SLOTMACHINE_JackPotRank NewJackpot;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_DB_JACKPOT_RANK_UPDATE_CMD) == 25, "PROTO_NC_GAMBLE_SLOTMACHINE_DB_JACKPOT_RANK_UPDATE_CMD size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_DB_RESULT_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_DB_RESULT_ACK) == 10, "PROTO_NC_GAMBLE_SLOTMACHINE_DB_RESULT_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_DB_RESULT_REQ {
    NETPACKETZONEHEADER header;
    uint8_t _pad_at_0006[6];
    wchar_t CardDisplay[10];
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_DB_RESULT_REQ) == 36, "PROTO_NC_GAMBLE_SLOTMACHINE_DB_RESULT_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_GAME_JOIN_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_GAME_JOIN_ACK) == 4, "PROTO_NC_GAMBLE_SLOTMACHINE_GAME_JOIN_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_GAME_JOIN_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_GAME_JOIN_REQ) == 4, "PROTO_NC_GAMBLE_SLOTMACHINE_GAME_JOIN_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_GAME_LEAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_GAME_LEAVE_ACK) == 2, "PROTO_NC_GAMBLE_SLOTMACHINE_GAME_LEAVE_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_GAME_LEAVE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_GAME_LEAVE_REQ) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_GAME_LEAVE_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD {
    uint8_t _pad_at_0000[1];
    PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD___unnamed_type_JackPotList________0_bytes___ JackPotList;
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD___unnamed_type_JackPotList_ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD___unnamed_type_JackPotList_) == 6, "PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTINFO_CMD___unnamed_type_JackPotList_ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTRANKING_ACK {
    uint8_t _pad_at_0000[1];
    SLOTMACHINE_JackPotRank_______0_bytes___ RankList;
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTRANKING_ACK) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTRANKING_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTRANKING_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTRANKING_REQ) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_JACKPOTRANKING_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_SOMEONE_GET_JACKPOT_CMD {
    Name5 charid;
    uint8_t _tail[28];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_SOMEONE_GET_JACKPOT_CMD) == 28, "PROTO_NC_GAMBLE_SLOTMACHINE_SOMEONE_GET_JACKPOT_CMD size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_STAND_UP_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_STAND_UP_CMD) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_STAND_UP_CMD size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_START_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_START_ACK) == 2, "PROTO_NC_GAMBLE_SLOTMACHINE_START_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_START_REQ {
    SLOTMACHINE_BettingLine betting;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_START_REQ) == 4, "PROTO_NC_GAMBLE_SLOTMACHINE_START_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_STOPBUTTON_ACK {
    uint8_t _pad_at_0000[2];
    SLOTMACHINE_ScreenState screen;
    uint8_t _tail[9];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_STOPBUTTON_ACK) == 11, "PROTO_NC_GAMBLE_SLOTMACHINE_STOPBUTTON_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_STOPBUTTON_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_STOPBUTTON_REQ) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_STOPBUTTON_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_WHEELSTOP_ACK {
    uint8_t _pad_at_0000[8];
    SLOTMACHINE_WinState WinLine;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_WHEELSTOP_ACK) == 10, "PROTO_NC_GAMBLE_SLOTMACHINE_WHEELSTOP_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_WHEELSTOP_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_WHEELSTOP_REQ) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_WHEELSTOP_REQ size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_WINRANKING_ACK {
    uint8_t _pad_at_0000[1];
    SLOTMACHINE_JackPotRank_______0_bytes___ RankList;
};
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_WINRANKING_ACK) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_WINRANKING_ACK size drift");

struct PROTO_NC_GAMBLE_SLOTMACHINE_WINRANKING_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GAMBLE_SLOTMACHINE_WINRANKING_REQ) == 1, "PROTO_NC_GAMBLE_SLOTMACHINE_WINRANKING_REQ size drift");

struct PROTO_NC_GAMBLE_TYPE_AND_WHERE_STAND_ACK {
    uint8_t _pad_at_0000[4];
    GAMBLE_TYPE nGambleType;
    uint8_t _tail[5];
};
static_assert(sizeof(PROTO_NC_GAMBLE_TYPE_AND_WHERE_STAND_ACK) == 9, "PROTO_NC_GAMBLE_TYPE_AND_WHERE_STAND_ACK size drift");

struct PROTO_NC_GAMBLE_TYPE_AND_WHERE_STAND_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GAMBLE_TYPE_AND_WHERE_STAND_REQ) == 2, "PROTO_NC_GAMBLE_TYPE_AND_WHERE_STAND_REQ size drift");

struct PROTO_NC_GAMBLE_WORLD_PREVMAPNAME_CMD {
    uint8_t _pad_at_0000[2];
    Name3 sPrevMapName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GAMBLE_WORLD_PREVMAPNAME_CMD) == 18, "PROTO_NC_GAMBLE_WORLD_PREVMAPNAME_CMD size drift");

struct PROTO_NC_GAMBLE_ZONE_PREVMAPNAME_CMD {
    Name3 sPrevMapName;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_GAMBLE_ZONE_PREVMAPNAME_CMD) == 12, "PROTO_NC_GAMBLE_ZONE_PREVMAPNAME_CMD size drift");

struct PROTO_NC_GAMIGO_NEW_TUTORIAL_CHAR_ENTER_GAME {
    uint8_t _pad_at_0000[8];
    PROTO_TUTORIAL_INFO TutorialInfo;
    uint8_t _pad_at_0008[5];
    wchar_t UserID[30];
};
static_assert(sizeof(PROTO_NC_GAMIGO_NEW_TUTORIAL_CHAR_ENTER_GAME) == 43, "PROTO_NC_GAMIGO_NEW_TUTORIAL_CHAR_ENTER_GAME size drift");

struct PROTO_NC_GUILD_ACADEMY_CHAT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CHAT_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_CHAT_ACK size drift");

struct PROTO_NC_GUILD_CHAT_REQ {
    uint8_t _pad_at_0000[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_GUILD_CHAT_REQ) == 2, "PROTO_NC_GUILD_CHAT_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_CHAT_CMD {
    uint8_t _pad_at_0000[4];
    Name5 talker;
    uint8_t _pad_at_0004[20];
    PROTO_NC_GUILD_CHAT_REQ chat;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CHAT_CMD) == 26, "PROTO_NC_GUILD_ACADEMY_CHAT_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_CHAT_REQ {
    uint8_t _pad_at_0000[2];
    uint8_t content[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CHAT_REQ) == 2, "PROTO_NC_GUILD_ACADEMY_CHAT_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_ITEM_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_ITEM_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_ITEM_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_ITEM_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_ITEM_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_ITEM_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_MONEY_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_MONEY_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_MONEY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_MONEY_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_MONEY_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_CLEAR_REWARD_MONEY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_ACADEMY_REWARD_ACK {
    NETPACKETZONEHEADER packheader;
    uint8_t _pad_at_0006[22];
    GUILD_ACADEMY_REWARD_ITEM WantItem;
    uint8_t _pad_at_001c[33];
    EACH_MODIFY_ITEM_______0_bytes___ ModifyItem;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_ACADEMY_REWARD_ACK) == 61, "PROTO_NC_GUILD_ACADEMY_DB_ACADEMY_REWARD_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_ACADEMY_REWARD_REQ {
    NETPACKETZONEHEADER packheader;
    uint8_t _tail[9];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_ACADEMY_REWARD_REQ) == 15, "PROTO_NC_GUILD_ACADEMY_DB_ACADEMY_REWARD_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_ITEM_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_ITEM_ACK) == 4, "PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_ITEM_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_ITEM_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_ITEM_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_ITEM_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_MONEY_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_MONEY_ACK) == 4, "PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_MONEY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_MONEY_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_MONEY_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_DB_CLEAR_REWARD_MONEY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_GRADUATE_ACK {
    uint8_t _pad_at_0000[5];
    GRADUATE_DATA GraduateData;
    uint8_t _tail[64];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_GRADUATE_ACK) == 69, "PROTO_NC_GUILD_ACADEMY_DB_GET_GRADUATE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_GRADUATE_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_GRADUATE_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_DB_GET_GRADUATE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_RANKING_LIST_ACK {
    uint8_t _pad_at_0000[5];
    GUILD_ACADEMY_RANKING_DATA RankData;
    uint8_t _tail[48];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_RANKING_LIST_ACK) == 53, "PROTO_NC_GUILD_ACADEMY_DB_GET_RANKING_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_RANKING_LIST_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_RANKING_LIST_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_DB_GET_RANKING_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_ITEM_ACK {
    uint8_t _pad_at_0000[5];
    GUILD_ACADEMY_REWARD_ITEM_______0_bytes___ RewardItem;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_ITEM_ACK) == 5, "PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_ITEM_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_ITEM_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_ITEM_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_ITEM_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_MONEY_ACK {
    uint8_t _pad_at_0000[5];
    GUILD_ACADEMY_REWARD_MONEY_______0_bytes___ RewardMoney;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_MONEY_ACK) == 5, "PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_MONEY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_MONEY_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_MONEY_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_DB_GET_REWARD_MONEY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_ACK) == 8, "PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_CMD) == 1, "PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_REQ {
    uint8_t _pad_at_0000[10];
    Name5 sName;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_REQ) == 32, "PROTO_NC_GUILD_ACADEMY_DB_GRADUATE_JOIN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_ACK { uint8_t data[16]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_ACK) == 16, "PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_CMD) == 1, "PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_REQ { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_REQ) == 14, "PROTO_NC_GUILD_ACADEMY_DB_LEVEL_UP_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_ACK {
    uint8_t _pad_at_0000[9];
    GUILD_ACADEMY_MEMEBER_INFO_______0_bytes___ AcademyMemberList;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_ACK) == 9, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_GUILD_JOIN_ACK {
    uint8_t _pad_at_0000[6];
    Name5 sInviteCharID;
    uint8_t _tail[27];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_GUILD_JOIN_ACK) == 33, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_GUILD_JOIN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_GUILD_JOIN_REQ {
    uint8_t _pad_at_0000[6];
    Name5 sInviteCharID;
    uint8_t _pad_at_0006[24];
    Name5 sTargetCharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_GUILD_JOIN_REQ) == 51, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_GUILD_JOIN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_JOIN_ACK {
    uint8_t _pad_at_0000[11];
    SHINE_GUILD_ACADEMY_MEMBER_LOGON_INFO dJoinInfo;
    uint8_t _tail[7];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_JOIN_ACK) == 18, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_JOIN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_JOIN_REQ {
    uint8_t _pad_at_0000[10];
    Name5 sCharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_JOIN_REQ) == 32, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_JOIN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_LEAVE_ACK { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_LEAVE_ACK) == 12, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_LEAVE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_LEAVE_REQ {
    uint8_t _pad_at_0000[10];
    Name5 sCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_LEAVE_REQ) == 30, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_LEAVE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_REQ) == 4, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_VANISH_ACK {
    uint8_t _pad_at_0000[2];
    Name5 sCharID;
    uint8_t _tail[30];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_VANISH_ACK) == 32, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_VANISH_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_MEMBER_VANISH_REQ {
    uint8_t _pad_at_0000[2];
    Name5 sCharID;
    uint8_t _tail[28];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_MEMBER_VANISH_REQ) == 30, "PROTO_NC_GUILD_ACADEMY_DB_MEMBER_VANISH_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_NOTIFY_ACK {
    uint8_t _pad_at_0000[14];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_NOTIFY_ACK) == 14, "PROTO_NC_GUILD_ACADEMY_DB_NOTIFY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_NOTIFY_REQ {
    uint8_t _pad_at_0000[8];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_NOTIFY_REQ) == 8, "PROTO_NC_GUILD_ACADEMY_DB_NOTIFY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_RANK_BALANCE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_RANK_BALANCE_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_DB_RANK_BALANCE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_RANK_BALANCE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_RANK_BALANCE_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_DB_RANK_BALANCE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_REWARD_WANT_CMD { uint8_t data[22]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_REWARD_WANT_CMD) == 22, "PROTO_NC_GUILD_ACADEMY_DB_REWARD_WANT_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_ACK {
    uint8_t _pad_at_0000[8];
    Name5 sName;
    uint8_t _tail[28];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_ACK) == 36, "PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_BY_LEAVE_ACK {
    uint8_t _pad_at_0000[10];
    Name5 sOldAcademyMasterName;
    uint8_t _pad_at_000a[24];
    Name5 sNewAcademyMasterName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_BY_LEAVE_ACK) == 54, "PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_BY_LEAVE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_BY_LEAVE_REQ {
    uint8_t _pad_at_0000[8];
    Name5 sOldAcademyMasterName;
    uint8_t _pad_at_0008[24];
    Name5 sNewAcademyMasterName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_BY_LEAVE_REQ) == 52, "PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_BY_LEAVE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_REQ {
    uint8_t _pad_at_0000[6];
    Name5 sName;
    uint8_t _tail[28];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_REQ) == 34, "PROTO_NC_GUILD_ACADEMY_DB_SET_MASTER_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_ITEM_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_ITEM_ACK) == 4, "PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_ITEM_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_ITEM_REQ {
    uint8_t _pad_at_0000[7];
    GUILD_ACADEMY_REWARD_ITEM_______0_bytes___ RewardItem;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_ITEM_REQ) == 7, "PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_ITEM_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_MONEY_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_MONEY_ACK) == 4, "PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_MONEY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_MONEY_REQ {
    uint8_t _pad_at_0000[7];
    GUILD_ACADEMY_REWARD_MONEY_______0_bytes___ RewardMoney;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_MONEY_REQ) == 7, "PROTO_NC_GUILD_ACADEMY_DB_SET_REWARD_MONEY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_DELETE_CMD {
    Name4 Name;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DELETE_CMD) == 16, "PROTO_NC_GUILD_ACADEMY_DELETE_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_DISMISS_CMD {
    Name4 Name;
    uint8_t _pad_at_0000[21];
    tm tm_dDismissDate;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_DISMISS_CMD) == 57, "PROTO_NC_GUILD_ACADEMY_DISMISS_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_GRADUATE_ACK {
    uint8_t _pad_at_0000[3];
    GRADUATE_DATA GraduateData;
    uint8_t _tail[64];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_GRADUATE_ACK) == 67, "PROTO_NC_GUILD_ACADEMY_GET_GRADUATE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_GRADUATE_REQ {
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_GRADUATE_REQ) == 16, "PROTO_NC_GUILD_ACADEMY_GET_GRADUATE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_RANKING_LIST_ACK {
    uint8_t _pad_at_0000[3];
    GUILD_ACADEMY_RANKING_DATA RankData;
    uint8_t _tail[48];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_RANKING_LIST_ACK) == 51, "PROTO_NC_GUILD_ACADEMY_GET_RANKING_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_RANKING_LIST_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_RANKING_LIST_REQ) == 4, "PROTO_NC_GUILD_ACADEMY_GET_RANKING_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_REWARD_ITEM_ACK {
    uint8_t _pad_at_0000[3];
    GUILD_ACADEMY_REWARD_ITEM_______0_bytes___ RewardItem;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_REWARD_ITEM_ACK) == 3, "PROTO_NC_GUILD_ACADEMY_GET_REWARD_ITEM_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_REWARD_ITEM_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_REWARD_ITEM_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_GET_REWARD_ITEM_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_REWARD_MONEY_ACK {
    uint8_t _pad_at_0000[3];
    GUILD_ACADEMY_REWARD_MONEY_______0_bytes___ RewardMoney;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_REWARD_MONEY_ACK) == 3, "PROTO_NC_GUILD_ACADEMY_GET_REWARD_MONEY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_GET_REWARD_MONEY_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_GET_REWARD_MONEY_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_GET_REWARD_MONEY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_HISTORY_DB_LIST_ACK {
    uint8_t _pad_at_0000[10];
    GUILD_HISTORY_______0_bytes___ HistoryList;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_HISTORY_DB_LIST_ACK) == 10, "PROTO_NC_GUILD_ACADEMY_HISTORY_DB_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_HISTORY_DB_LIST_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_HISTORY_DB_LIST_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_HISTORY_DB_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_HISTORY_LIST_ACK {
    uint8_t _pad_at_0000[8];
    GUILD_HISTORY_______0_bytes___ HistoryList;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_HISTORY_LIST_ACK) == 8, "PROTO_NC_GUILD_ACADEMY_HISTORY_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_HISTORY_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_HISTORY_LIST_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_HISTORY_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_LIST_ACK {
    uint8_t _pad_at_0000[11];
    SHINE_GUILD_ACADEMY_LIST_______0_bytes___ GuildAcademyList;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_LIST_ACK) == 11, "PROTO_NC_GUILD_ACADEMY_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_LIST_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MASTER_TELEPORT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MASTER_TELEPORT_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_MASTER_TELEPORT_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MASTER_TELEPORT_REQ {
    Name5 sTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MASTER_TELEPORT_REQ) == 20, "PROTO_NC_GUILD_ACADEMY_MASTER_TELEPORT_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_CMD {
    Name5 sChatBanCancelSourceCharID;
    uint8_t _pad_at_0000[20];
    Name5 sChatBanCancelTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_CMD) == 40, "PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_REQ {
    Name5 sChatBanCancelTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_REQ) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CANCEL_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CMD {
    Name5 sChatBanSourceCharID;
    uint8_t _pad_at_0000[20];
    Name5 sChatBanTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CMD) == 40, "PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_REQ {
    Name5 sChatBanTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_REQ) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_CHAT_BAN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_CLASS_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_CLASS_CMD) == 21, "PROTO_NC_GUILD_ACADEMY_MEMBER_CLASS_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_ACK { uint8_t data[18]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_ACK) == 18, "PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_CANCEL_ACK { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_CANCEL_ACK) == 14, "PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_CANCEL_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_CANCEL_REQ { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_CANCEL_REQ) == 12, "PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_CANCEL_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_REQ { uint8_t data[16]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_REQ) == 16, "PROTO_NC_GUILD_ACADEMY_MEMBER_DB_CHAT_BAN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_DB_SAVE_CHAT_BAN_TIME_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_DB_SAVE_CHAT_BAN_TIME_CMD) == 12, "PROTO_NC_GUILD_ACADEMY_MEMBER_DB_SAVE_CHAT_BAN_TIME_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_INVITE_ACK {
    Name5 sInviteTargetCharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_INVITE_ACK) == 22, "PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_INVITE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_INVITE_REQ {
    Name5 sInviteTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_INVITE_REQ) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_INVITE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_ACK {
    Name4 GuildName;
    uint8_t _pad_at_0000[16];
    Name5 sInviteSourceCharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_ACK) == 37, "PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_CMD {
    Name5 sInviteSourceCharID;
    uint8_t _pad_at_0000[20];
    GUILD_MEMBER_CLIENT Member;
    uint8_t _tail[110];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_CMD) == 130, "PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_ERR {
    Name4 GuildName;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_ERR) == 18, "PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_ERR size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_REQ {
    Name4 GuildName;
    uint8_t _pad_at_0000[16];
    Name5 sInviteSourceCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_REQ) == 36, "PROTO_NC_GUILD_ACADEMY_MEMBER_GUILD_JOIN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_INTRO_CMD {
    Name5 CharID;
    uint8_t _pad_at_0000[22];
    wchar_t sMemberIntro[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_INTRO_CMD) == 22, "PROTO_NC_GUILD_ACADEMY_MEMBER_INTRO_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_ACK {
    Name4 GuildName;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_ACK) == 18, "PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_CMD {
    GUILD_ACADEMY_MEMBER_CLIENT Member;
    uint8_t _tail[109];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_CMD) == 109, "PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_REQ {
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_REQ) == 16, "PROTO_NC_GUILD_ACADEMY_MEMBER_JOIN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_CMD) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_MEMBER_LEAVE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LEVEL_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LEVEL_CMD) == 21, "PROTO_NC_GUILD_ACADEMY_MEMBER_LEVEL_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LIST_ACK {
    uint8_t _pad_at_0000[6];
    GUILD_ACADEMY_MEMBER_CLIENT_______0_bytes___ AcademyMemberList;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LIST_ACK) == 6, "PROTO_NC_GUILD_ACADEMY_MEMBER_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LIST_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_MEMBER_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LOGOFF_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LOGOFF_CMD) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_LOGOFF_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_LOGON_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_LOGON_CMD) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_LOGON_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_MAP_CMD {
    Name5 CharID;
    uint8_t _pad_at_0000[20];
    Name3 sMap;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_MAP_CMD) == 32, "PROTO_NC_GUILD_ACADEMY_MEMBER_MAP_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_PARTY_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_PARTY_CMD) == 21, "PROTO_NC_GUILD_ACADEMY_MEMBER_PARTY_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_ACK {
    Name5 CharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_ACK) == 22, "PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_CMD) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_REQ {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_REQ) == 20, "PROTO_NC_GUILD_ACADEMY_MEMBER_VANISH_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MY_ACADEMY_RANK_INFO_ACK { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MY_ACADEMY_RANK_INFO_ACK) == 14, "PROTO_NC_GUILD_ACADEMY_MY_ACADEMY_RANK_INFO_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MY_ACADEMY_RANK_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MY_ACADEMY_RANK_INFO_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_MY_ACADEMY_RANK_INFO_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_MY_GUILD_ACADEMY_INFO_ACK {
    uint8_t _pad_at_0000[2];
    GUILD_ACADEMY_CLIENT_______0_bytes___ GuildAcademyInfo;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MY_GUILD_ACADEMY_INFO_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_MY_GUILD_ACADEMY_INFO_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_MY_GUILD_ACADEMY_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_MY_GUILD_ACADEMY_INFO_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_MY_GUILD_ACADEMY_INFO_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_NOTIFY_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_NOTIFY_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_NOTIFY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_NOTIFY_CMD {
    uint8_t _pad_at_0000[4];
    tm tm_dNotifyDate;
    uint8_t _pad_at_0004[36];
    Name5 sNotifyCharID;
    uint8_t _pad_at_0028[22];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_NOTIFY_CMD) == 62, "PROTO_NC_GUILD_ACADEMY_NOTIFY_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_NOTIFY_REQ {
    uint8_t _pad_at_0000[2];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_NOTIFY_REQ) == 2, "PROTO_NC_GUILD_ACADEMY_NOTIFY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_GRADE_INFO_CMD { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_GRADE_INFO_CMD) == 9, "PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_GRADE_INFO_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_ITEM_INFO_ZONE_RNG {
    ZONERINGLINKAGESTART Start;
    uint8_t _pad_at_0000[12];
    Name5 Charid;
    uint8_t _pad_at_000c[21];
    SHINE_INVEN_SLOT_INFO From;
    uint8_t _pad_at_0021[16];
    SHINE_INVEN_SLOT_INFO To;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_ITEM_INFO_ZONE_RNG) == 65, "PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_ITEM_INFO_ZONE_RNG size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_REWARD_ZONE_RNG {
    ZONERINGLINKAGESTART Start;
    uint8_t _pad_at_0000[11];
    Name5 sCharID;
    uint8_t _pad_at_000b[37];
    EACH_MODIFY_ITEM_______0_bytes___ Reward_ItemInfo;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_REWARD_ZONE_RNG) == 48, "PROTO_NC_GUILD_ACADEMY_REWARDSTORAGE_REWARD_ZONE_RNG size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_CLOSE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_CLOSE_CMD) == 1, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_CLOSE_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_DEPOSIT_CMD {
    uint8_t _pad_at_0000[2];
    Name5 charid;
    uint8_t _tail[39];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_DEPOSIT_CMD) == 41, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_DEPOSIT_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_DEPOSIT_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[15];
    Name5 charid;
    uint8_t _tail[38];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_DEPOSIT_RNG) == 53, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_DEPOSIT_RNG size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_OPEN_ACK {
    uint8_t _pad_at_0000[11];
    PROTO_ITEMPACKET_INFORM_______0_bytes___ itemarray;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_OPEN_ACK) == 11, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_OPEN_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_OPEN_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_OPEN_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_OPEN_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_CMD {
    uint8_t _pad_at_0000[2];
    Name5 charid;
    uint8_t _tail[39];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_CMD) == 41, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_GRADE_ACK {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_GRADE_ACK) == 9, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_GRADE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_GRADE_REQ {
    NETPACKETZONEHEADER netpacketzoneheader;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_GRADE_REQ) == 6, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_GRADE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[15];
    Name5 charid;
    uint8_t _tail[38];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_RNG) == 53, "PROTO_NC_GUILD_ACADEMY_REWARD_STORAGE_WITHDRAW_RNG size drift");

struct PROTO_NC_GUILD_ACADEMY_REWARD_WANT_CMD { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_REWARD_WANT_CMD) == 14, "PROTO_NC_GUILD_ACADEMY_REWARD_WANT_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_MASTER_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_MASTER_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_SET_MASTER_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_MASTER_BY_LEAVE_CMD {
    Name5 sOldAcademyMasterName;
    uint8_t _pad_at_0000[20];
    Name5 sNewAcademyMasterName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_MASTER_BY_LEAVE_CMD) == 40, "PROTO_NC_GUILD_ACADEMY_SET_MASTER_BY_LEAVE_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_MASTER_CMD {
    Name5 sName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_MASTER_CMD) == 20, "PROTO_NC_GUILD_ACADEMY_SET_MASTER_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_MASTER_REQ {
    Name5 sName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_MASTER_REQ) == 20, "PROTO_NC_GUILD_ACADEMY_SET_MASTER_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_REWARD_ITEM_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_REWARD_ITEM_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_SET_REWARD_ITEM_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_REWARD_ITEM_REQ {
    uint8_t _pad_at_0000[1];
    GUILD_ACADEMY_REWARD_ITEM_______0_bytes___ RewardItem;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_REWARD_ITEM_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_SET_REWARD_ITEM_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_REWARD_MONEY_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_REWARD_MONEY_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_SET_REWARD_MONEY_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_SET_REWARD_MONEY_REQ {
    uint8_t _pad_at_0000[1];
    GUILD_ACADEMY_REWARD_MONEY_______0_bytes___ RewardMoney;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_SET_REWARD_MONEY_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_SET_REWARD_MONEY_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_START_DB_ALL_ACK {
    uint8_t _pad_at_0000[5];
    GUILD_ACADEMY_DB_______0_bytes___ GuildAcademyDB;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_START_DB_ALL_ACK) == 5, "PROTO_NC_GUILD_ACADEMY_START_DB_ALL_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_START_DB_ALL_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_START_DB_ALL_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_START_DB_ALL_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_START_DB_GET_RANKING_LIST_ACK {
    uint8_t _pad_at_0000[3];
    GUILD_ACADEMY_START_RANKING_DATA RankData;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_START_DB_GET_RANKING_LIST_ACK) == 11, "PROTO_NC_GUILD_ACADEMY_START_DB_GET_RANKING_LIST_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_START_DB_GET_RANKING_LIST_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_START_DB_GET_RANKING_LIST_REQ) == 4, "PROTO_NC_GUILD_ACADEMY_START_DB_GET_RANKING_LIST_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_START_DB_RANK_BALANCE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_START_DB_RANK_BALANCE_ACK) == 2, "PROTO_NC_GUILD_ACADEMY_START_DB_RANK_BALANCE_ACK size drift");

struct PROTO_NC_GUILD_ACADEMY_START_DB_RANK_BALANCE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_START_DB_RANK_BALANCE_REQ) == 1, "PROTO_NC_GUILD_ACADEMY_START_DB_RANK_BALANCE_REQ size drift");

struct PROTO_NC_GUILD_ACADEMY_WAR_END_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_WAR_END_CMD) == 5, "PROTO_NC_GUILD_ACADEMY_WAR_END_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD__WAR_INFO_LIST_______0_bytes___ WarInfoList;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD) == 2, "PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD__WAR_INFO_LIST { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD__WAR_INFO_LIST) == 5, "PROTO_NC_GUILD_ACADEMY_WAR_INFO_LIST_CMD__WAR_INFO_LIST size drift");

struct PROTO_NC_GUILD_ACADEMY_WAR_START_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_WAR_START_CMD) == 5, "PROTO_NC_GUILD_ACADEMY_WAR_START_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_ZONE_GUILD_ACADEMY_MASTER_BUFF_CMD {
    uint8_t _pad_at_0000[4];
    GUILD_MASTER_BUFF_______0_bytes___ Master;
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_ZONE_GUILD_ACADEMY_MASTER_BUFF_CMD) == 4, "PROTO_NC_GUILD_ACADEMY_ZONE_GUILD_ACADEMY_MASTER_BUFF_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_ZONE_GUILD_BUFF_CMD {
    wchar_t BuffName[32];
    uint32_t Guild[0];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_ZONE_GUILD_BUFF_CMD) == 36, "PROTO_NC_GUILD_ACADEMY_ZONE_GUILD_BUFF_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_ZONE_MASTER_TELEPORT_CMD {
    uint8_t _pad_at_0000[4];
    Name5 sTargetCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_ZONE_MASTER_TELEPORT_CMD) == 24, "PROTO_NC_GUILD_ACADEMY_ZONE_MASTER_TELEPORT_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_GUILD_JOIN_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_GUILD_JOIN_CMD) == 8, "PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_GUILD_JOIN_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_JOIN_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_JOIN_CMD) == 8, "PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_JOIN_CMD size drift");

struct PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_LEAVE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_LEAVE_CMD) == 4, "PROTO_NC_GUILD_ACADEMY_ZONE_MEMBER_LEAVE_CMD size drift");

struct PROTO_NC_GUILD_CHAT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_CHAT_ACK) == 2, "PROTO_NC_GUILD_CHAT_ACK size drift");

struct PROTO_NC_GUILD_CHAT_CMD {
    uint8_t _pad_at_0000[4];
    Name5 talker;
    uint8_t _pad_at_0004[20];
    PROTO_NC_GUILD_CHAT_REQ chat;
};
static_assert(sizeof(PROTO_NC_GUILD_CHAT_CMD) == 26, "PROTO_NC_GUILD_CHAT_CMD size drift");

struct PROTO_NC_GUILD_DB_ACK {
    uint8_t _pad_at_0000[4];
    GUILD_CLIENT GuildClient;
    uint8_t _pad_at_0004[1067];
    GUILD_SERVER GuildServer;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_ACK) == 1091, "PROTO_NC_GUILD_DB_ACK size drift");

struct PROTO_NC_GUILD_DB_ALL_ACK {
    uint8_t _pad_at_0000[5];
    GUILD_DB_______0_bytes___ GuildDB;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_ALL_ACK) == 5, "PROTO_NC_GUILD_DB_ALL_ACK size drift");

struct PROTO_NC_GUILD_DB_ALL_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_ALL_REQ) == 1, "PROTO_NC_GUILD_DB_ALL_REQ size drift");

struct PROTO_NC_GUILD_DB_DELETE_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_DELETE_ACK) == 6, "PROTO_NC_GUILD_DB_DELETE_ACK size drift");

struct PROTO_NC_GUILD_DB_DELETE_CANCEL_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_DELETE_CANCEL_ACK) == 8, "PROTO_NC_GUILD_DB_DELETE_CANCEL_ACK size drift");

struct PROTO_NC_GUILD_DB_DELETE_CANCEL_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_DELETE_CANCEL_REQ) == 6, "PROTO_NC_GUILD_DB_DELETE_CANCEL_REQ size drift");

struct PROTO_NC_GUILD_DB_DELETE_REQ {
    uint8_t _pad_at_0000[4];
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_DELETE_REQ) == 20, "PROTO_NC_GUILD_DB_DELETE_REQ size drift");

struct PROTO_NC_GUILD_DB_DISMISS_ACK { uint8_t data[13]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_DISMISS_ACK) == 13, "PROTO_NC_GUILD_DB_DISMISS_ACK size drift");

struct PROTO_NC_GUILD_DB_DISMISS_REQ { uint8_t data[11]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_DISMISS_REQ) == 11, "PROTO_NC_GUILD_DB_DISMISS_REQ size drift");

struct PROTO_NC_GUILD_DB_GRADE_GROWTH_ACK {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[17];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_GRADE_GROWTH_ACK) == 19, "PROTO_NC_GUILD_DB_GRADE_GROWTH_ACK size drift");

struct PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ {
    NETPACKETHEADER netpacketheader;
    uint8_t _tail[27];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ) == 29, "PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ size drift");

struct PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ req;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ_SEND) == 32, "PROTO_NC_GUILD_DB_GRADE_GROWTH_REQ_SEND size drift");

struct PROTO_NC_GUILD_DB_INTRO_ACK { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_INTRO_ACK) == 12, "PROTO_NC_GUILD_DB_INTRO_ACK size drift");

struct PROTO_NC_GUILD_DB_INTRO_REQ {
    uint8_t _pad_at_0000[12];
    wchar_t sIntro[0];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_INTRO_REQ) == 12, "PROTO_NC_GUILD_DB_INTRO_REQ size drift");

struct PROTO_NC_GUILD_DB_LIST_ACK {
    uint8_t _pad_at_0000[5];
    SHINE_GUILD_LIST_______0_bytes___ GuildList;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_LIST_ACK) == 5, "PROTO_NC_GUILD_DB_LIST_ACK size drift");

struct PROTO_NC_GUILD_DB_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_LIST_REQ) == 1, "PROTO_NC_GUILD_DB_LIST_REQ size drift");

struct PROTO_NC_GUILD_MAKE_REQ {
    Name4 Name;
    uint8_t _pad_at_0000[16];
    Name3 Password;
    uint8_t _tail[13];
};
static_assert(sizeof(PROTO_NC_GUILD_MAKE_REQ) == 29, "PROTO_NC_GUILD_MAKE_REQ size drift");

struct PROTO_NC_GUILD_DB_MAKE_ACK {
    uint8_t _pad_at_0000[6];
    PROTO_NC_GUILD_MAKE_REQ Make;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MAKE_ACK) == 45, "PROTO_NC_GUILD_DB_MAKE_ACK size drift");

struct PROTO_NC_GUILD_DB_MAKE_REQ {
    uint8_t _pad_at_0000[6];
    Name5 sCharID;
    uint8_t _pad_at_0006[20];
    PROTO_NC_GUILD_MAKE_REQ Make;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MAKE_REQ) == 55, "PROTO_NC_GUILD_DB_MAKE_REQ size drift");

struct PROTO_NC_GUILD_DB_MEMBER_ACK {
    uint8_t _pad_at_0000[9];
    GUILD_MEMEBER_INFO_______0_bytes___ MemberList;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_ACK) == 9, "PROTO_NC_GUILD_DB_MEMBER_ACK size drift");

struct PROTO_NC_GUILD_DB_MEMBER_GRADE_ACK {
    uint8_t _pad_at_0000[2];
    Name5 sCharID;
    uint8_t _tail[35];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_GRADE_ACK) == 37, "PROTO_NC_GUILD_DB_MEMBER_GRADE_ACK size drift");

struct PROTO_NC_GUILD_DB_MEMBER_GRADE_REQ {
    uint8_t _pad_at_0000[2];
    Name5 sCharID;
    uint8_t _tail[34];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_GRADE_REQ) == 36, "PROTO_NC_GUILD_DB_MEMBER_GRADE_REQ size drift");

struct PROTO_NC_GUILD_DB_MEMBER_INTRO_ACK { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_INTRO_ACK) == 12, "PROTO_NC_GUILD_DB_MEMBER_INTRO_ACK size drift");

struct PROTO_NC_GUILD_DB_MEMBER_INTRO_REQ {
    uint8_t _pad_at_0000[12];
    wchar_t sMemberIntro[0];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_INTRO_REQ) == 12, "PROTO_NC_GUILD_DB_MEMBER_INTRO_REQ size drift");

struct PROTO_NC_GUILD_DB_MEMBER_JOIN_ACK { uint8_t data[13]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_JOIN_ACK) == 13, "PROTO_NC_GUILD_DB_MEMBER_JOIN_ACK size drift");

struct PROTO_NC_GUILD_DB_MEMBER_JOIN_REQ {
    uint8_t _pad_at_0000[10];
    Name5 sCharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_JOIN_REQ) == 31, "PROTO_NC_GUILD_DB_MEMBER_JOIN_REQ size drift");

struct PROTO_NC_GUILD_DB_MEMBER_LEAVE_ACK { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_LEAVE_ACK) == 12, "PROTO_NC_GUILD_DB_MEMBER_LEAVE_ACK size drift");

struct PROTO_NC_GUILD_DB_MEMBER_LEAVE_REQ {
    uint8_t _pad_at_0000[10];
    Name5 sCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_LEAVE_REQ) == 30, "PROTO_NC_GUILD_DB_MEMBER_LEAVE_REQ size drift");

struct PROTO_NC_GUILD_DB_MEMBER_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_REQ) == 4, "PROTO_NC_GUILD_DB_MEMBER_REQ size drift");

struct PROTO_NC_GUILD_DB_MEMBER_VANISH_ACK {
    uint8_t _pad_at_0000[2];
    Name5 sCharID;
    uint8_t _tail[30];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_VANISH_ACK) == 32, "PROTO_NC_GUILD_DB_MEMBER_VANISH_ACK size drift");

struct PROTO_NC_GUILD_DB_MEMBER_VANISH_REQ {
    uint8_t _pad_at_0000[2];
    Name5 sCharID;
    uint8_t _tail[28];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_MEMBER_VANISH_REQ) == 30, "PROTO_NC_GUILD_DB_MEMBER_VANISH_REQ size drift");

struct PROTO_NC_GUILD_DB_MONEY_ADD_ACK { uint8_t data[36]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MONEY_ADD_ACK) == 36, "PROTO_NC_GUILD_DB_MONEY_ADD_ACK size drift");

struct PROTO_NC_GUILD_DB_MONEY_ADD_REQ { uint8_t data[18]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MONEY_ADD_REQ) == 18, "PROTO_NC_GUILD_DB_MONEY_ADD_REQ size drift");

struct PROTO_NC_GUILD_DB_MONEY_SUB_ACK { uint8_t data[36]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MONEY_SUB_ACK) == 36, "PROTO_NC_GUILD_DB_MONEY_SUB_ACK size drift");

struct PROTO_NC_GUILD_DB_MONEY_SUB_REQ { uint8_t data[18]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_MONEY_SUB_REQ) == 18, "PROTO_NC_GUILD_DB_MONEY_SUB_REQ size drift");

struct PROTO_NC_GUILD_DB_NOTIFY_ACK {
    uint8_t _pad_at_0000[12];
    Name5 sNotifyCharID;
    uint8_t _pad_at_000c[22];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_NOTIFY_ACK) == 34, "PROTO_NC_GUILD_DB_NOTIFY_ACK size drift");

struct PROTO_NC_GUILD_DB_NOTIFY_REQ {
    uint8_t _pad_at_0000[6];
    Name5 sNotifyCharID;
    uint8_t _pad_at_0006[22];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_NOTIFY_REQ) == 28, "PROTO_NC_GUILD_DB_NOTIFY_REQ size drift");

struct PROTO_NC_GUILD_DB_RENAME_ACK {
    uint8_t _pad_at_0000[6];
    Name4 sGuildName;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_RENAME_ACK) == 24, "PROTO_NC_GUILD_DB_RENAME_ACK size drift");

struct PROTO_NC_GUILD_DB_RENAME_REQ {
    uint8_t _pad_at_0000[6];
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_RENAME_REQ) == 22, "PROTO_NC_GUILD_DB_RENAME_REQ size drift");

struct PROTO_NC_GUILD_DB_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_REQ) == 6, "PROTO_NC_GUILD_DB_REQ size drift");

struct PROTO_NC_GUILD_DB_RESULT_WRITE_CMD {
    GUILD_DB_RESULT_WRITE Guild1;
    uint8_t _pad_at_0000[20];
    GUILD_DB_RESULT_WRITE Guild2;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_DB_RESULT_WRITE_CMD) == 40, "PROTO_NC_GUILD_DB_RESULT_WRITE_CMD size drift");

struct PROTO_NC_GUILD_DB_RETYPE_ACK { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_RETYPE_ACK) == 9, "PROTO_NC_GUILD_DB_RETYPE_ACK size drift");

struct PROTO_NC_GUILD_DB_RETYPE_REQ { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_RETYPE_REQ) == 7, "PROTO_NC_GUILD_DB_RETYPE_REQ size drift");

struct PROTO_NC_GUILD_DB_TOKEN_ALL_ACK {
    uint8_t _pad_at_0000[5];
    GUILD_TOKEN_DB_______0_bytes___ GuildTokenDB;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_TOKEN_ALL_ACK) == 5, "PROTO_NC_GUILD_DB_TOKEN_ALL_ACK size drift");

struct PROTO_NC_GUILD_DB_TOKEN_ALL_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_TOKEN_ALL_REQ) == 1, "PROTO_NC_GUILD_DB_TOKEN_ALL_REQ size drift");

struct PROTO_NC_GUILD_DB_WAR_REQ { uint8_t data[22]; };
static_assert(sizeof(PROTO_NC_GUILD_DB_WAR_REQ) == 22, "PROTO_NC_GUILD_DB_WAR_REQ size drift");

struct PROTO_NC_GUILD_DB_WAR_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_NC_GUILD_DB_WAR_REQ WarReq;
};
static_assert(sizeof(PROTO_NC_GUILD_DB_WAR_ACK) == 24, "PROTO_NC_GUILD_DB_WAR_ACK size drift");

struct PROTO_NC_GUILD_DELETE_CMD {
    Name4 Name;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_DELETE_CMD) == 16, "PROTO_NC_GUILD_DELETE_CMD size drift");

struct PROTO_NC_GUILD_DISMISS_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_DISMISS_ACK) == 2, "PROTO_NC_GUILD_DISMISS_ACK size drift");

struct PROTO_NC_GUILD_DISMISS_CMD {
    Name4 Name;
    uint8_t _pad_at_0000[21];
    tm tm_dDismissDate;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_GUILD_DISMISS_CMD) == 57, "PROTO_NC_GUILD_DISMISS_CMD size drift");

struct PROTO_NC_GUILD_DISMISS_REQ {
    Name4 Name;
    uint8_t _pad_at_0000[16];
    Name3 Password;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_GUILD_DISMISS_REQ) == 28, "PROTO_NC_GUILD_DISMISS_REQ size drift");

struct PROTO_NC_GUILD_EMBLEM_CHECK_AVAILABILITY_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_CHECK_AVAILABILITY_ACK) == 2, "PROTO_NC_GUILD_EMBLEM_CHECK_AVAILABILITY_ACK size drift");

struct PROTO_NC_GUILD_EMBLEM_CHECK_AVAILABILITY_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_CHECK_AVAILABILITY_REQ) == 1, "PROTO_NC_GUILD_EMBLEM_CHECK_AVAILABILITY_REQ size drift");

struct PROTO_NC_GUILD_EMBLEM_INFO_CMD {
    GUILD_EMBLEM_INFO EmblemInfo;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_INFO_CMD) == 3, "PROTO_NC_GUILD_EMBLEM_INFO_CMD size drift");

struct PROTO_NC_GUILD_EMBLEM_INFO_DB_ACK {
    uint8_t _pad_at_0000[3];
    GUILD_EMBLEM_INFO_DB_______0_bytes___ EmblemInfo;
};
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_INFO_DB_ACK) == 3, "PROTO_NC_GUILD_EMBLEM_INFO_DB_ACK size drift");

struct PROTO_NC_GUILD_EMBLEM_INFO_DB_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_INFO_DB_REQ) == 1, "PROTO_NC_GUILD_EMBLEM_INFO_DB_REQ size drift");

struct PROTO_NC_GUILD_EMBLEM_INFO_NOTICE_CMD {
    uint8_t _pad_at_0000[4];
    GUILD_EMBLEM_INFO EmblemInfo;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_INFO_NOTICE_CMD) == 6, "PROTO_NC_GUILD_EMBLEM_INFO_NOTICE_CMD size drift");

struct PROTO_NC_GUILD_EMBLEM_LEVELUP_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_LEVELUP_CMD) == 4, "PROTO_NC_GUILD_EMBLEM_LEVELUP_CMD size drift");

struct PROTO_NC_GUILD_EMBLEM_OFF_MSG_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_OFF_MSG_CMD) == 2, "PROTO_NC_GUILD_EMBLEM_OFF_MSG_CMD size drift");

struct PROTO_NC_GUILD_EMBLEM_SAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_SAVE_ACK) == 2, "PROTO_NC_GUILD_EMBLEM_SAVE_ACK size drift");

struct PROTO_NC_GUILD_EMBLEM_SAVE_DB_ACK {
    uint8_t _pad_at_0000[4];
    GUILD_EMBLEM_INFO EmblemInfo;
    uint8_t _tail[6];
};
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_SAVE_DB_ACK) == 10, "PROTO_NC_GUILD_EMBLEM_SAVE_DB_ACK size drift");

struct PROTO_NC_GUILD_EMBLEM_SAVE_DB_REQ {
    uint8_t _pad_at_0000[8];
    GUILD_EMBLEM_INFO EmblemInfo;
    uint8_t _tail[6];
};
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_SAVE_DB_REQ) == 14, "PROTO_NC_GUILD_EMBLEM_SAVE_DB_REQ size drift");

struct PROTO_NC_GUILD_EMBLEM_SAVE_REQ {
    GUILD_EMBLEM_INFO EmblemInfo;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_SAVE_REQ) == 2, "PROTO_NC_GUILD_EMBLEM_SAVE_REQ size drift");

struct PROTO_NC_GUILD_EMBLEM_STATE_DB_ACK { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_STATE_DB_ACK) == 9, "PROTO_NC_GUILD_EMBLEM_STATE_DB_ACK size drift");

struct PROTO_NC_GUILD_EMBLEM_STATE_DB_REQ { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_EMBLEM_STATE_DB_REQ) == 9, "PROTO_NC_GUILD_EMBLEM_STATE_DB_REQ size drift");

struct PROTO_NC_GUILD_GRADE_ACK { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_ACK) == 3, "PROTO_NC_GUILD_GRADE_ACK size drift");

struct PROTO_NC_GUILD_GRADE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_CMD) == 1, "PROTO_NC_GUILD_GRADE_CMD size drift");

struct PROTO_NC_GUILD_GRADE_GROWTH_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_GROWTH_ACK) == 2, "PROTO_NC_GUILD_GRADE_GROWTH_ACK size drift");

struct PROTO_NC_GUILD_GRADE_GROWTH_DATA_ACK { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_GROWTH_DATA_ACK) == 14, "PROTO_NC_GUILD_GRADE_GROWTH_DATA_ACK size drift");

struct PROTO_NC_GUILD_GRADE_GROWTH_DATA_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_GROWTH_DATA_REQ) == 4, "PROTO_NC_GUILD_GRADE_GROWTH_DATA_REQ size drift");

struct PROTO_NC_GUILD_GRADE_GROWTH_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_GROWTH_REQ) == 1, "PROTO_NC_GUILD_GRADE_GROWTH_REQ size drift");

struct PROTO_NC_GUILD_GRADE_GROWTH_ZONE_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_GROWTH_ZONE_ACK) == 8, "PROTO_NC_GUILD_GRADE_GROWTH_ZONE_ACK size drift");

struct PROTO_NC_GUILD_GRADE_GROWTH_ZONE_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_GROWTH_ZONE_REQ) == 6, "PROTO_NC_GUILD_GRADE_GROWTH_ZONE_REQ size drift");

struct PROTO_NC_GUILD_GRADE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_GRADE_REQ) == 1, "PROTO_NC_GUILD_GRADE_REQ size drift");

struct PROTO_NC_GUILD_ZONE_WAR_START_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_WAR_START_CMD) == 8, "PROTO_NC_GUILD_ZONE_WAR_START_CMD size drift");

struct PROTO_NC_GUILD_GUILDWARCONFIRM_ACK {
    PROTO_NC_GUILD_ZONE_WAR_START_CMD guildwarA;
    PROTO_NC_GUILD_ZONE_WAR_START_CMD guildwarB;
};
static_assert(sizeof(PROTO_NC_GUILD_GUILDWARCONFIRM_ACK) == 16, "PROTO_NC_GUILD_GUILDWARCONFIRM_ACK size drift");

struct PROTO_NC_GUILD_GUILDWARCONFIRM_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_GUILDWARCONFIRM_REQ) == 8, "PROTO_NC_GUILD_GUILDWARCONFIRM_REQ size drift");

struct PROTO_NC_GUILD_GUILDWARSTATUS_ACK {
    uint8_t _pad_at_0000[2];
    PROTO_NC_GUILD_ZONE_WAR_START_CMD_______0_bytes___ war;
};
static_assert(sizeof(PROTO_NC_GUILD_GUILDWARSTATUS_ACK) == 2, "PROTO_NC_GUILD_GUILDWARSTATUS_ACK size drift");

struct PROTO_NC_GUILD_GUILDWARSTATUS_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_GUILDWARSTATUS_REQ) == 1, "PROTO_NC_GUILD_GUILDWARSTATUS_REQ size drift");

struct PROTO_NC_GUILD_HISTORY_DB_LIST_ACK {
    uint8_t _pad_at_0000[10];
    GUILD_HISTORY_______0_bytes___ HistoryList;
};
static_assert(sizeof(PROTO_NC_GUILD_HISTORY_DB_LIST_ACK) == 10, "PROTO_NC_GUILD_HISTORY_DB_LIST_ACK size drift");

struct PROTO_NC_GUILD_HISTORY_DB_LIST_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_HISTORY_DB_LIST_REQ) == 6, "PROTO_NC_GUILD_HISTORY_DB_LIST_REQ size drift");

struct PROTO_NC_GUILD_HISTORY_LIST_ACK {
    uint8_t _pad_at_0000[8];
    GUILD_HISTORY_______0_bytes___ HistoryList;
};
static_assert(sizeof(PROTO_NC_GUILD_HISTORY_LIST_ACK) == 8, "PROTO_NC_GUILD_HISTORY_LIST_ACK size drift");

struct PROTO_NC_GUILD_HISTORY_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_HISTORY_LIST_REQ) == 1, "PROTO_NC_GUILD_HISTORY_LIST_REQ size drift");

struct PROTO_NC_GUILD_INFO_ACK { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_INFO_ACK) == 1, "PROTO_NC_GUILD_INFO_ACK size drift");

struct PROTO_NC_GUILD_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_INFO_REQ) == 1, "PROTO_NC_GUILD_INFO_REQ size drift");

struct PROTO_NC_GUILD_LIST_ACK {
    uint8_t _pad_at_0000[7];
    SHINE_GUILD_LIST_NEW_______0_bytes___ GuildList;
};
static_assert(sizeof(PROTO_NC_GUILD_LIST_ACK) == 7, "PROTO_NC_GUILD_LIST_ACK size drift");

struct PROTO_NC_GUILD_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_LIST_REQ) == 1, "PROTO_NC_GUILD_LIST_REQ size drift");

struct PROTO_NC_GUILD_MAKE_ACK {
    uint8_t _pad_at_0000[6];
    Name4 Name;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_MAKE_ACK) == 27, "PROTO_NC_GUILD_MAKE_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_CLASS_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_CLASS_CMD) == 21, "PROTO_NC_GUILD_MEMBER_CLASS_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_EXP_RATIO_CMD {
    Name5 CharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_EXP_RATIO_CMD) == 22, "PROTO_NC_GUILD_MEMBER_EXP_RATIO_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_FLAGS_CMD {
    Name5 CharID;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_FLAGS_CMD) == 24, "PROTO_NC_GUILD_MEMBER_FLAGS_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_GRADE_ACK {
    Name5 CharID;
    uint8_t _tail[23];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_GRADE_ACK) == 23, "PROTO_NC_GUILD_MEMBER_GRADE_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_GRADE_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_GRADE_CMD) == 21, "PROTO_NC_GUILD_MEMBER_GRADE_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_GRADE_REQ {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_GRADE_REQ) == 21, "PROTO_NC_GUILD_MEMBER_GRADE_REQ size drift");

struct PROTO_NC_GUILD_MEMBER_INTRO_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_INTRO_ACK) == 2, "PROTO_NC_GUILD_MEMBER_INTRO_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_INTRO_CMD {
    Name5 CharID;
    uint8_t _pad_at_0000[22];
    wchar_t sMemberIntro[0];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_INTRO_CMD) == 22, "PROTO_NC_GUILD_MEMBER_INTRO_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_INTRO_REQ {
    uint8_t _pad_at_0000[2];
    wchar_t sMemberIntro[0];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_INTRO_REQ) == 2, "PROTO_NC_GUILD_MEMBER_INTRO_REQ size drift");

struct PROTO_NC_GUILD_MEMBER_INVITE_ACK {
    Name5 ToCharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_INVITE_ACK) == 22, "PROTO_NC_GUILD_MEMBER_INVITE_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_INVITE_REQ {
    Name5 ToCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_INVITE_REQ) == 20, "PROTO_NC_GUILD_MEMBER_INVITE_REQ size drift");

struct PROTO_NC_GUILD_MEMBER_JOIN_ACK {
    Name4 GuildName;
    uint8_t _tail[17];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_JOIN_ACK) == 17, "PROTO_NC_GUILD_MEMBER_JOIN_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_JOIN_CMD {
    GUILD_MEMBER_CLIENT Member;
    uint8_t _tail[110];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_JOIN_CMD) == 110, "PROTO_NC_GUILD_MEMBER_JOIN_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_JOIN_ERR {
    Name4 GuildName;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_JOIN_ERR) == 18, "PROTO_NC_GUILD_MEMBER_JOIN_ERR size drift");

struct PROTO_NC_GUILD_MEMBER_JOIN_REQ {
    Name4 GuildName;
    uint8_t _pad_at_0000[16];
    Name5 FromCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_JOIN_REQ) == 36, "PROTO_NC_GUILD_MEMBER_JOIN_REQ size drift");

struct PROTO_NC_GUILD_MEMBER_LEAVE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LEAVE_ACK) == 2, "PROTO_NC_GUILD_MEMBER_LEAVE_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_LEAVE_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LEAVE_CMD) == 20, "PROTO_NC_GUILD_MEMBER_LEAVE_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_LEAVE_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LEAVE_REQ) == 1, "PROTO_NC_GUILD_MEMBER_LEAVE_REQ size drift");

struct PROTO_NC_GUILD_MEMBER_LEVEL_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LEVEL_CMD) == 21, "PROTO_NC_GUILD_MEMBER_LEVEL_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_LIST_ACK {
    uint8_t _pad_at_0000[6];
    GUILD_MEMBER_CLIENT_______0_bytes___ MemberList;
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LIST_ACK) == 6, "PROTO_NC_GUILD_MEMBER_LIST_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LIST_REQ) == 1, "PROTO_NC_GUILD_MEMBER_LIST_REQ size drift");

struct PROTO_NC_GUILD_MEMBER_LOGOFF_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LOGOFF_CMD) == 20, "PROTO_NC_GUILD_MEMBER_LOGOFF_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_LOGON_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_LOGON_CMD) == 20, "PROTO_NC_GUILD_MEMBER_LOGON_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_MAP_CMD {
    Name5 CharID;
    uint8_t _pad_at_0000[20];
    Name3 sMap;
    uint8_t _tail[12];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_MAP_CMD) == 32, "PROTO_NC_GUILD_MEMBER_MAP_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_PARTY_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_PARTY_CMD) == 21, "PROTO_NC_GUILD_MEMBER_PARTY_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_VANISH_ACK {
    Name5 CharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_VANISH_ACK) == 22, "PROTO_NC_GUILD_MEMBER_VANISH_ACK size drift");

struct PROTO_NC_GUILD_MEMBER_VANISH_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_VANISH_CMD) == 20, "PROTO_NC_GUILD_MEMBER_VANISH_CMD size drift");

struct PROTO_NC_GUILD_MEMBER_VANISH_REQ {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_MEMBER_VANISH_REQ) == 20, "PROTO_NC_GUILD_MEMBER_VANISH_REQ size drift");

struct PROTO_NC_GUILD_MOBGUILD_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_MOBGUILD_CMD) == 6, "PROTO_NC_GUILD_MOBGUILD_CMD size drift");

struct PROTO_NC_GUILD_MONEY_ADD_ACK { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_GUILD_MONEY_ADD_ACK) == 10, "PROTO_NC_GUILD_MONEY_ADD_ACK size drift");

struct PROTO_NC_GUILD_MONEY_ADD_CMD {
    Name5 CharID;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_GUILD_MONEY_ADD_CMD) == 36, "PROTO_NC_GUILD_MONEY_ADD_CMD size drift");

struct PROTO_NC_GUILD_MONEY_ADD_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_MONEY_ADD_REQ) == 8, "PROTO_NC_GUILD_MONEY_ADD_REQ size drift");

struct PROTO_NC_GUILD_MONEY_SUB_ACK { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_GUILD_MONEY_SUB_ACK) == 10, "PROTO_NC_GUILD_MONEY_SUB_ACK size drift");

struct PROTO_NC_GUILD_MONEY_SUB_CMD {
    Name5 CharID;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_GUILD_MONEY_SUB_CMD) == 36, "PROTO_NC_GUILD_MONEY_SUB_CMD size drift");

struct PROTO_NC_GUILD_MONEY_SUB_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_MONEY_SUB_REQ) == 8, "PROTO_NC_GUILD_MONEY_SUB_REQ size drift");

struct PROTO_NC_GUILD_MY_GUILD_INFO_ACK {
    uint8_t _pad_at_0000[2];
    GUILD_CLIENT_______0_bytes___ GuildInfo;
};
static_assert(sizeof(PROTO_NC_GUILD_MY_GUILD_INFO_ACK) == 2, "PROTO_NC_GUILD_MY_GUILD_INFO_ACK size drift");

struct PROTO_NC_GUILD_MY_GUILD_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_MY_GUILD_INFO_REQ) == 1, "PROTO_NC_GUILD_MY_GUILD_INFO_REQ size drift");

struct PROTO_NC_GUILD_MY_GUILD_TOKEN_INFO_ACK { uint8_t data[10]; };
static_assert(sizeof(PROTO_NC_GUILD_MY_GUILD_TOKEN_INFO_ACK) == 10, "PROTO_NC_GUILD_MY_GUILD_TOKEN_INFO_ACK size drift");

struct PROTO_NC_GUILD_MY_GUILD_TOKEN_INFO_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_MY_GUILD_TOKEN_INFO_REQ) == 1, "PROTO_NC_GUILD_MY_GUILD_TOKEN_INFO_REQ size drift");

struct PROTO_NC_GUILD_MY_GUILD_TOURNAMENT_MATCH_TIME_ACK {
    uint8_t _pad_at_0000[2];
    GT_COND_INFO GTCondInfo;
    uint8_t _tail[43];
};
static_assert(sizeof(PROTO_NC_GUILD_MY_GUILD_TOURNAMENT_MATCH_TIME_ACK) == 45, "PROTO_NC_GUILD_MY_GUILD_TOURNAMENT_MATCH_TIME_ACK size drift");

struct PROTO_NC_GUILD_MY_GUILD_TOURNAMENT_MATCH_TIME_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_MY_GUILD_TOURNAMENT_MATCH_TIME_REQ) == 1, "PROTO_NC_GUILD_MY_GUILD_TOURNAMENT_MATCH_TIME_REQ size drift");

struct PROTO_NC_GUILD_NAME_ACK {
    uint8_t _pad_at_0000[4];
    Name4 Name;
    uint8_t _pad_at_0004[16];
    GUILD_EMBLEM_INFO EmblemInfo;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_GUILD_NAME_ACK) == 22, "PROTO_NC_GUILD_NAME_ACK size drift");

struct PROTO_NC_GUILD_NAME_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_NAME_REQ) == 4, "PROTO_NC_GUILD_NAME_REQ size drift");

struct PROTO_NC_GUILD_NOTIFY_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_NOTIFY_ACK) == 2, "PROTO_NC_GUILD_NOTIFY_ACK size drift");

struct PROTO_NC_GUILD_NOTIFY_CMD {
    uint8_t _pad_at_0000[4];
    tm tm_dNotifyDate;
    uint8_t _pad_at_0004[36];
    Name5 sNotifyCharID;
    uint8_t _pad_at_0028[22];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_NOTIFY_CMD) == 62, "PROTO_NC_GUILD_NOTIFY_CMD size drift");

struct PROTO_NC_GUILD_NOTIFY_REQ {
    uint8_t _pad_at_0000[2];
    wchar_t sNotify[0];
};
static_assert(sizeof(PROTO_NC_GUILD_NOTIFY_REQ) == 2, "PROTO_NC_GUILD_NOTIFY_REQ size drift");

struct PROTO_NC_GUILD_RENAME_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_RENAME_ACK) == 2, "PROTO_NC_GUILD_RENAME_ACK size drift");

struct PROTO_NC_GUILD_RENAME_CMD {
    uint8_t _pad_at_0000[4];
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_RENAME_CMD) == 20, "PROTO_NC_GUILD_RENAME_CMD size drift");

struct PROTO_NC_GUILD_RENAME_CMD_SEND {
    uint8_t _pad_at_0000[1];
    NETCOMMAND netcmd;
    uint8_t _pad_at_0001[2];
    PROTO_NC_GUILD_RENAME_CMD cmd;
};
static_assert(sizeof(PROTO_NC_GUILD_RENAME_CMD_SEND) == 23, "PROTO_NC_GUILD_RENAME_CMD_SEND size drift");

struct PROTO_NC_GUILD_RENAME_REQ {
    uint8_t _pad_at_0000[1];
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_RENAME_REQ) == 17, "PROTO_NC_GUILD_RENAME_REQ size drift");

struct PROTO_NC_GUILD_RETYPE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_RETYPE_ACK) == 2, "PROTO_NC_GUILD_RETYPE_ACK size drift");

struct PROTO_NC_GUILD_RETYPE_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_RETYPE_CMD) == 5, "PROTO_NC_GUILD_RETYPE_CMD size drift");

struct PROTO_NC_GUILD_RETYPE_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_RETYPE_REQ) == 2, "PROTO_NC_GUILD_RETYPE_REQ size drift");

struct PROTO_NC_GUILD_STORAGEOPEN_ACK {
    uint8_t _pad_at_0000[19];
    PROTO_ITEMPACKET_INFORM_______0_bytes___ itemarray;
};
static_assert(sizeof(PROTO_NC_GUILD_STORAGEOPEN_ACK) == 19, "PROTO_NC_GUILD_STORAGEOPEN_ACK size drift");

struct PROTO_NC_GUILD_STORAGEWITHDRAW_CMD {
    uint8_t _pad_at_0000[2];
    Name5 charid;
    uint8_t _tail[31];
};
static_assert(sizeof(PROTO_NC_GUILD_STORAGEWITHDRAW_CMD) == 33, "PROTO_NC_GUILD_STORAGEWITHDRAW_CMD size drift");

struct PROTO_NC_GUILD_STORAGEWITHDRAW_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[14];
    Name5 charid;
    uint8_t _tail[30];
};
static_assert(sizeof(PROTO_NC_GUILD_STORAGEWITHDRAW_RNG) == 44, "PROTO_NC_GUILD_STORAGEWITHDRAW_RNG size drift");

struct PROTO_NC_GUILD_STORAGE_WITHDRAW_GRADE_ACK {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[3];
};
static_assert(sizeof(PROTO_NC_GUILD_STORAGE_WITHDRAW_GRADE_ACK) == 9, "PROTO_NC_GUILD_STORAGE_WITHDRAW_GRADE_ACK size drift");

struct PROTO_NC_GUILD_STORAGE_WITHDRAW_GRADE_REQ {
    NETPACKETZONEHEADER netpacketzoneheader;
};
static_assert(sizeof(PROTO_NC_GUILD_STORAGE_WITHDRAW_GRADE_REQ) == 6, "PROTO_NC_GUILD_STORAGE_WITHDRAW_GRADE_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENTSTART_CMD { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENTSTART_CMD) == 14, "PROTO_NC_GUILD_TOURNAMENTSTART_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENTSTOPMSG_CMD { uint8_t data[20]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENTSTOPMSG_CMD) == 20, "PROTO_NC_GUILD_TOURNAMENTSTOPMSG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENTSTOP_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENTSTOP_CMD) == 1, "PROTO_NC_GUILD_TOURNAMENTSTOP_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_FINAL_SELECTION_ACK {
    uint8_t _pad_at_0000[7];
    uint32_t nFSGuildNo[0];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_FINAL_SELECTION_ACK) == 7, "PROTO_NC_GUILD_TOURNAMENT_DB_FINAL_SELECTION_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_FINAL_SELECTION_REQ { uint8_t data[7]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_FINAL_SELECTION_REQ) == 7, "PROTO_NC_GUILD_TOURNAMENT_DB_FINAL_SELECTION_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_GET_ACK {
    uint8_t _pad_at_0000[7];
    int32_t MatchTime[9];
    GUILD_TOURNAMENT_LIST_DB_______155_bytes___ TournamentTree;
    uint8_t _tail[161];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_GET_ACK) == 204, "PROTO_NC_GUILD_TOURNAMENT_DB_GET_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_GET_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_GET_REQ) == 4, "PROTO_NC_GUILD_TOURNAMENT_DB_GET_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_ACK { uint8_t data[14]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_ACK) == 14, "PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_LIST_ACK {
    uint8_t _pad_at_0000[11];
    SHINE_GUILD_LIST_NEW_______0_bytes___ JoinGuildList;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_LIST_ACK) == 11, "PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_LIST_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_LIST_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_LIST_REQ) == 6, "PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_LIST_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_NEW_ACK {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[29];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_NEW_ACK) == 35, "PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_NEW_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_NEW_REQ {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[27];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_NEW_REQ) == 33, "PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_NEW_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_REQ { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_REQ) == 12, "PROTO_NC_GUILD_TOURNAMENT_DB_JOIN_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_ACK { uint8_t data[28]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_ACK) == 28, "PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ {
    uint8_t _pad_at_0000[12];
    PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ__ITEM_OPT_______0_bytes___ ItemOpt;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ) == 12, "PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ__ITEM_OPT { uint8_t data[33]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ__ITEM_OPT) == 33, "PROTO_NC_GUILD_TOURNAMENT_DB_REWARD_CREATE_REQ__ITEM_OPT size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_ACK) == 6, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_ACK) == 6, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_REQ {
    uint8_t _pad_at_0000[6];
    GUILD_TOURNAMENT_LIST_DB_______155_bytes___ TournamentTree;
    uint8_t _tail[155];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_REQ) == 161, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_TIME_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_TIME_ACK) == 6, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_TIME_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_TIME_REQ {
    uint8_t _pad_at_0000[6];
    int32_t MatchTime[9];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_TIME_REQ) == 42, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_MATCH_TIME_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_REQ {
    uint8_t _pad_at_0000[7];
    GUILD_TOURNAMENT_LIST_DB_______155_bytes___ TournamentTree;
    uint8_t _tail[155];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_REQ) == 162, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_RESULT_ACK { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_RESULT_ACK) == 9, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_RESULT_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_RESULT_REQ { uint8_t data[11]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_RESULT_REQ) == 11, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_RESULT_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_TYPE_ACK {
    uint8_t _pad_at_0000[8];
    GUILD_TOURNAMENT_LIST_DB_______0_bytes___ FinalSelectionGuild;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_TYPE_ACK) == 8, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_TYPE_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DB_SET_TYPE_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DB_SET_TYPE_REQ) == 8, "PROTO_NC_GUILD_TOURNAMENT_DB_SET_TYPE_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DICEGAME_BEFORE_END_TIME_MSG_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DICEGAME_BEFORE_END_TIME_MSG_CMD) == 4, "PROTO_NC_GUILD_TOURNAMENT_DICEGAME_BEFORE_END_TIME_MSG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DICEGAME_START_CMD {
    uint8_t _pad_at_0000[6];
    Name5 AGuildDelegateName;
    uint8_t _pad_at_0006[26];
    Name5 BGuildDelegateName;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DICEGAME_START_CMD) == 52, "PROTO_NC_GUILD_TOURNAMENT_DICEGAME_START_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_ACK) == 2, "PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_CMD) == 8, "PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_REQ) == 1, "PROTO_NC_GUILD_TOURNAMENT_DICEGAME_THROW_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_END_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_END_CMD) == 12, "PROTO_NC_GUILD_TOURNAMENT_END_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ENTER_LIST_DB_GET_ACK {
    uint8_t _pad_at_0000[5];
    GT_EnterList_______0_bytes___ EnterGuildList;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ENTER_LIST_DB_GET_ACK) == 5, "PROTO_NC_GUILD_TOURNAMENT_ENTER_LIST_DB_GET_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ENTER_LIST_DB_GET_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ENTER_LIST_DB_GET_REQ) == 4, "PROTO_NC_GUILD_TOURNAMENT_ENTER_LIST_DB_GET_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_ACK) == 2, "PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_CMD) == 4, "PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_REQ) == 2, "PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_RESULT_CMD {
    Name5 CIDPlayer;
    uint8_t _pad_at_0000[20];
    Name5 CIDFlag;
    uint8_t _tail[28];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_RESULT_CMD) == 48, "PROTO_NC_GUILD_TOURNAMENT_FLAGCAPTURE_RESULT_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_GOLD_REFUND_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_GOLD_REFUND_CMD) == 8, "PROTO_NC_GUILD_TOURNAMENT_GOLD_REFUND_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_GOLD_REFUND_ZONE_CMD {
    uint8_t _pad_at_0000[3];
    GT_EnterList_______0_bytes___ EnterGuildList;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_GOLD_REFUND_ZONE_CMD) == 3, "PROTO_NC_GUILD_TOURNAMENT_GOLD_REFUND_ZONE_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ITEM_EFFECT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ITEM_EFFECT_CMD) == 2, "PROTO_NC_GUILD_TOURNAMENT_ITEM_EFFECT_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ITEM_FLAG_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ITEM_FLAG_CMD) == 5, "PROTO_NC_GUILD_TOURNAMENT_ITEM_FLAG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ITEM_PICK_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ITEM_PICK_CMD) == 2, "PROTO_NC_GUILD_TOURNAMENT_ITEM_PICK_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD__Memberinfo_______0_bytes___ Members;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD) == 2, "PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD__Memberinfo {
    SHINE_XY_TYPE loc;
    uint8_t _tail[8];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD__Memberinfo) == 8, "PROTO_NC_GUILD_TOURNAMENT_ITEM_SCAN_CMD__Memberinfo size drift");

struct PROTO_NC_GUILD_TOURNAMENT_JOIN_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_JOIN_ACK) == 8, "PROTO_NC_GUILD_TOURNAMENT_JOIN_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_JOIN_LIST_ACK {
    uint8_t _pad_at_0000[9];
    SHINE_GUILD_LIST_NEW_______0_bytes___ JoinGuildList;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_JOIN_LIST_ACK) == 9, "PROTO_NC_GUILD_TOURNAMENT_JOIN_LIST_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_JOIN_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_JOIN_LIST_REQ) == 1, "PROTO_NC_GUILD_TOURNAMENT_JOIN_LIST_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_JOIN_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_JOIN_REQ) == 4, "PROTO_NC_GUILD_TOURNAMENT_JOIN_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_LAST_WINNER_CMD { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_LAST_WINNER_CMD) == 5, "PROTO_NC_GUILD_TOURNAMENT_LAST_WINNER_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_LEAVE_ACK { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_LEAVE_ACK) == 8, "PROTO_NC_GUILD_TOURNAMENT_LEAVE_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_LEAVE_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_LEAVE_REQ) == 4, "PROTO_NC_GUILD_TOURNAMENT_LEAVE_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_LIST_ACK {
    uint8_t _pad_at_0000[38];
    tm tm_Time_Start;
    uint8_t _pad_at_0026[36];
    tm tm_Time_Practic;
    uint8_t _pad_at_004a[36];
    tm tm_Time_PracticEnd;
    uint8_t _pad_at_006e[36];
    tm tm_Time_Match_161;
    uint8_t _pad_at_0092[36];
    tm tm_Time_Match_162;
    uint8_t _pad_at_00b6[36];
    tm tm_Time_Match_8;
    uint8_t _pad_at_00da[36];
    tm tm_Time_Match_4;
    uint8_t _pad_at_00fe[36];
    tm tm_Time_Match_2;
    uint8_t _pad_at_0122[36];
    tm tm_Time_Match_End;
    uint8_t _pad_at_0146[37];
    GUILD_TOURNAMENT_LIST_______651_bytes___ TournamentList;
    uint8_t _tail[651];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_LIST_ACK) == 1014, "PROTO_NC_GUILD_TOURNAMENT_LIST_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_LIST_REQ) == 1, "PROTO_NC_GUILD_TOURNAMENT_LIST_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_MANAGERUSERMSG_CMD {
    Name5 CharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_MANAGERUSERMSG_CMD) == 20, "PROTO_NC_GUILD_TOURNAMENT_MANAGERUSERMSG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_NOTIFY_CMD {
    GUILD_TOURNAMENT_NOTIFY_TYPE Type;
    uint8_t _pad_at_0000[5];
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_NOTIFY_CMD) == 21, "PROTO_NC_GUILD_TOURNAMENT_NOTIFY_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_OBSERVER_ENTER_ACK { uint8_t data[11]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_OBSERVER_ENTER_ACK) == 11, "PROTO_NC_GUILD_TOURNAMENT_OBSERVER_ENTER_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_OBSERVER_ENTER_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_OBSERVER_ENTER_REQ) == 1, "PROTO_NC_GUILD_TOURNAMENT_OBSERVER_ENTER_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_OBSERVER_OUT_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_OBSERVER_OUT_ACK) == 2, "PROTO_NC_GUILD_TOURNAMENT_OBSERVER_OUT_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_OBSERVER_OUT_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_OBSERVER_OUT_REQ) == 1, "PROTO_NC_GUILD_TOURNAMENT_OBSERVER_OUT_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_PLAYERDIEMSG_CMD {
    Name5 VictimCharID;
    uint8_t _pad_at_0000[20];
    Name5 MurderCharID;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_PLAYERDIEMSG_CMD) == 44, "PROTO_NC_GUILD_TOURNAMENT_PLAYERDIEMSG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_PLAYERKILLMSG_CMD {
    Name5 VictimCharID;
    uint8_t _pad_at_0000[20];
    Name5 MurderCharID;
    uint8_t _tail[24];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_PLAYERKILLMSG_CMD) == 44, "PROTO_NC_GUILD_TOURNAMENT_PLAYERKILLMSG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_ACK) == 2, "PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_CMD) == 1, "PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_REQ) == 1, "PROTO_NC_GUILD_TOURNAMENT_RECALL_ENTER_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_CMD) == 8, "PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_DB_SET_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_DB_SET_ACK) == 2, "PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_DB_SET_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_DB_SET_REQ { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_DB_SET_REQ) == 8, "PROTO_NC_GUILD_TOURNAMENT_REFUND_NOTICE_DB_SET_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_RESET_CMD {
    uint8_t _pad_at_0000[5];
    int32_t MatchTime[9];
    GUILD_TOURNAMENT_LIST_DB_______155_bytes___ TournamentTree;
    uint8_t _tail[155];
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_RESET_CMD) == 196, "PROTO_NC_GUILD_TOURNAMENT_RESET_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_RESULT_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_RESULT_CMD) == 12, "PROTO_NC_GUILD_TOURNAMENT_RESULT_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_SCORE_CMD {
    uint8_t _pad_at_0000[17];
    TOURNAMENT_PLAYER_SCORE_______0_bytes___ PlayerScore;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_SCORE_CMD) == 17, "PROTO_NC_GUILD_TOURNAMENT_SCORE_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_SKILLPOINT_CMD { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_SKILLPOINT_CMD) == 2, "PROTO_NC_GUILD_TOURNAMENT_SKILLPOINT_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_STARTMSG_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_STARTMSG_CMD) == 4, "PROTO_NC_GUILD_TOURNAMENT_STARTMSG_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_START_CMD { uint8_t data[17]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_START_CMD) == 17, "PROTO_NC_GUILD_TOURNAMENT_START_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_TYPE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_TYPE_CMD) == 1, "PROTO_NC_GUILD_TOURNAMENT_TYPE_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_USESKILL_ACK { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_USESKILL_ACK) == 4, "PROTO_NC_GUILD_TOURNAMENT_USESKILL_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_USESKILL_CMD { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_USESKILL_CMD) == 6, "PROTO_NC_GUILD_TOURNAMENT_USESKILL_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_USESKILL_REQ { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_USESKILL_REQ) == 2, "PROTO_NC_GUILD_TOURNAMENT_USESKILL_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_FIGHTER_ENTER_CMD { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_FIGHTER_ENTER_CMD) == 9, "PROTO_NC_GUILD_TOURNAMENT_ZONE_FIGHTER_ENTER_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_FIGHTER_OUT_CMD { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_FIGHTER_OUT_CMD) == 9, "PROTO_NC_GUILD_TOURNAMENT_ZONE_FIGHTER_OUT_CMD size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_JOIN_NEW_ACK { uint8_t data[27]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_JOIN_NEW_ACK) == 27, "PROTO_NC_GUILD_TOURNAMENT_ZONE_JOIN_NEW_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_JOIN_NEW_REQ { uint8_t data[25]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_JOIN_NEW_REQ) == 25, "PROTO_NC_GUILD_TOURNAMENT_ZONE_JOIN_NEW_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_MEMBERGRADE_ACK {
    uint8_t _pad_at_0000[9];
    GUILD_TOURNAMENT_MEMBER_GRADE_LIST_______0_bytes___ MemberGradeList;
};
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_MEMBERGRADE_ACK) == 9, "PROTO_NC_GUILD_TOURNAMENT_ZONE_MEMBERGRADE_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_MEMBERGRADE_REQ { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_MEMBERGRADE_REQ) == 5, "PROTO_NC_GUILD_TOURNAMENT_ZONE_MEMBERGRADE_REQ size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_OBSERVER_ENTER_ACK { uint8_t data[5]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_OBSERVER_ENTER_ACK) == 5, "PROTO_NC_GUILD_TOURNAMENT_ZONE_OBSERVER_ENTER_ACK size drift");

struct PROTO_NC_GUILD_TOURNAMENT_ZONE_OBSERVER_ENTER_REQ { uint8_t data[3]; };
static_assert(sizeof(PROTO_NC_GUILD_TOURNAMENT_ZONE_OBSERVER_ENTER_REQ) == 3, "PROTO_NC_GUILD_TOURNAMENT_ZONE_OBSERVER_ENTER_REQ size drift");

struct PROTO_NC_GUILD_WAR_ABLE_LIST_ACK {
    uint8_t _pad_at_0000[5];
    SHINE_GUILD_WAR_ABLE_INFO_______0_bytes___ WarInfoList;
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_ABLE_LIST_ACK) == 5, "PROTO_NC_GUILD_WAR_ABLE_LIST_ACK size drift");

struct PROTO_NC_GUILD_WAR_ABLE_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_WAR_ABLE_LIST_REQ) == 1, "PROTO_NC_GUILD_WAR_ABLE_LIST_REQ size drift");

struct PROTO_NC_GUILD_WAR_ACK { uint8_t data[2]; };
static_assert(sizeof(PROTO_NC_GUILD_WAR_ACK) == 2, "PROTO_NC_GUILD_WAR_ACK size drift");

struct PROTO_NC_GUILD_WAR_COOLDOWN_DONE_CMD { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_WAR_COOLDOWN_DONE_CMD) == 1, "PROTO_NC_GUILD_WAR_COOLDOWN_DONE_CMD size drift");

struct PROTO_NC_GUILD_WAR_END_CMD {
    Name4 EnemyGuildName;
    uint8_t _tail[34];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_END_CMD) == 34, "PROTO_NC_GUILD_WAR_END_CMD size drift");

struct PROTO_NC_GUILD_WAR_LIST_ACK {
    uint8_t _pad_at_0000[5];
    SHINE_GUILD_WAR_INFO_______0_bytes___ WarInfoList;
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_LIST_ACK) == 5, "PROTO_NC_GUILD_WAR_LIST_ACK size drift");

struct PROTO_NC_GUILD_WAR_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_WAR_LIST_REQ) == 1, "PROTO_NC_GUILD_WAR_LIST_REQ size drift");

struct PROTO_NC_GUILD_WAR_REQ {
    Name4 TargetName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_REQ) == 16, "PROTO_NC_GUILD_WAR_REQ size drift");

struct PROTO_NC_GUILD_WAR_SCORE_ACK {
    uint8_t _pad_at_0000[2];
    Name4 EnemyGuildName;
    uint8_t _pad_at_0002[16];
    SHINE_GUILD_SCORE MyScore;
    uint8_t _pad_at_0012[42];
    SHINE_GUILD_SCORE EnemyScore;
    uint8_t _tail[42];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_SCORE_ACK) == 102, "PROTO_NC_GUILD_WAR_SCORE_ACK size drift");

struct PROTO_NC_GUILD_WAR_SCORE_CMD {
    Name4 GuildName1;
    uint8_t _pad_at_0000[16];
    SHINE_GUILD_SCORE GuildScore1;
    uint8_t _pad_at_0010[42];
    Name4 GuildName2;
    uint8_t _pad_at_003a[16];
    SHINE_GUILD_SCORE GuildScore2;
    uint8_t _tail[42];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_SCORE_CMD) == 116, "PROTO_NC_GUILD_WAR_SCORE_CMD size drift");

struct PROTO_NC_GUILD_WAR_SCORE_REQ {
    Name4 GuildNameEnemy;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_SCORE_REQ) == 16, "PROTO_NC_GUILD_WAR_SCORE_REQ size drift");

struct PROTO_NC_GUILD_WAR_START_CMD {
    Name4 WarGuildName;
    uint8_t _pad_at_0000[24];
    tm tm_EndDate;
    uint8_t _tail[36];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_START_CMD) == 60, "PROTO_NC_GUILD_WAR_START_CMD size drift");

struct PROTO_NC_GUILD_WAR_TARGET_CMD {
    SHINE_GUILD_WAR_INFO WarInfo;
    uint8_t _tail[234];
};
static_assert(sizeof(PROTO_NC_GUILD_WAR_TARGET_CMD) == 234, "PROTO_NC_GUILD_WAR_TARGET_CMD size drift");

struct PROTO_NC_GUILD_WORLD_RENAME_ACK {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _pad_at_0006[1];
    Name4 sGuildName;
    uint8_t _tail[18];
};
static_assert(sizeof(PROTO_NC_GUILD_WORLD_RENAME_ACK) == 25, "PROTO_NC_GUILD_WORLD_RENAME_ACK size drift");

struct PROTO_NC_GUILD_WORLD_RENAME_CMD {
    NETPACKETZONEHEADER netpacketzoneheader;
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_WORLD_RENAME_CMD) == 22, "PROTO_NC_GUILD_WORLD_RENAME_CMD size drift");

struct PROTO_NC_GUILD_WORLD_RENAME_REQ {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _pad_at_0006[1];
    Name4 sGuildName;
    uint8_t _tail[16];
};
static_assert(sizeof(PROTO_NC_GUILD_WORLD_RENAME_REQ) == 23, "PROTO_NC_GUILD_WORLD_RENAME_REQ size drift");

struct PROTO_NC_GUILD_WORLD_RETYPE_ACK {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_GUILD_WORLD_RETYPE_ACK) == 10, "PROTO_NC_GUILD_WORLD_RETYPE_ACK size drift");

struct PROTO_NC_GUILD_WORLD_RETYPE_CMD {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[1];
};
static_assert(sizeof(PROTO_NC_GUILD_WORLD_RETYPE_CMD) == 7, "PROTO_NC_GUILD_WORLD_RETYPE_CMD size drift");

struct PROTO_NC_GUILD_WORLD_RETYPE_REQ {
    NETPACKETZONEHEADER netpacketzoneheader;
    uint8_t _tail[2];
};
static_assert(sizeof(PROTO_NC_GUILD_WORLD_RETYPE_REQ) == 8, "PROTO_NC_GUILD_WORLD_RETYPE_REQ size drift");

struct PROTO_NC_GUILD_WORLD_SET_GUILD_TOKEN_CMD { uint8_t data[16]; };
static_assert(sizeof(PROTO_NC_GUILD_WORLD_SET_GUILD_TOKEN_CMD) == 16, "PROTO_NC_GUILD_WORLD_SET_GUILD_TOKEN_CMD size drift");

struct PROTO_NC_GUILD_WORLD_USE_GUILD_TOKEN_CMD { uint8_t data[20]; };
static_assert(sizeof(PROTO_NC_GUILD_WORLD_USE_GUILD_TOKEN_CMD) == 20, "PROTO_NC_GUILD_WORLD_USE_GUILD_TOKEN_CMD size drift");

struct PROTO_NC_GUILD_ZONE_DELETE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_DELETE_CMD) == 4, "PROTO_NC_GUILD_ZONE_DELETE_CMD size drift");

struct PROTO_NC_GUILD_ZONE_LIST_ACK {
    uint8_t _pad_at_0000[3];
    GUILD_ZONE_______0_bytes___ GuildZoneList;
};
static_assert(sizeof(PROTO_NC_GUILD_ZONE_LIST_ACK) == 3, "PROTO_NC_GUILD_ZONE_LIST_ACK size drift");

struct PROTO_NC_GUILD_ZONE_LIST_REQ { uint8_t data[1]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_LIST_REQ) == 1, "PROTO_NC_GUILD_ZONE_LIST_REQ size drift");

struct PROTO_NC_GUILD_ZONE_MAKE_CMD {
    uint8_t _pad_at_0000[4];
    GUILD_ZONE GuildZone;
    uint8_t _tail[49];
};
static_assert(sizeof(PROTO_NC_GUILD_ZONE_MAKE_CMD) == 53, "PROTO_NC_GUILD_ZONE_MAKE_CMD size drift");

struct PROTO_NC_GUILD_ZONE_MEMBER_JOIN_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_MEMBER_JOIN_CMD) == 8, "PROTO_NC_GUILD_ZONE_MEMBER_JOIN_CMD size drift");

struct PROTO_NC_GUILD_ZONE_MEMBER_LEAVE_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_MEMBER_LEAVE_CMD) == 4, "PROTO_NC_GUILD_ZONE_MEMBER_LEAVE_CMD size drift");

struct PROTO_NC_GUILD_ZONE_USE_GUILD_TOKEN_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_USE_GUILD_TOKEN_CMD) == 12, "PROTO_NC_GUILD_ZONE_USE_GUILD_TOKEN_CMD size drift");

struct PROTO_NC_GUILD_ZONE_WAR_END_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_WAR_END_CMD) == 8, "PROTO_NC_GUILD_ZONE_WAR_END_CMD size drift");

struct PROTO_NC_GUILD_ZONE_WAR_KILL_CMD { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_GUILD_ZONE_WAR_KILL_CMD) == 4, "PROTO_NC_GUILD_ZONE_WAR_KILL_CMD size drift");

struct PROTO_NC_HOLY_PROMISE_ADD_CMD {
    uint8_t _pad_at_0000[2];
    PROTO_HOLY_PROMISE_INFO MemberInfo;
    uint8_t _tail[26];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_ADD_CMD) == 28, "PROTO_NC_HOLY_PROMISE_ADD_CMD size drift");

struct PROTO_NC_HOLY_PROMISE_CENTRANSFER_RNG {
    ZONERINGLINKAGESTART start;
    uint8_t _pad_at_0000[15];
    Name5 lower;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_CENTRANSFER_RNG) == 35, "PROTO_NC_HOLY_PROMISE_CENTRANSFER_RNG size drift");

struct PROTO_NC_HOLY_PROMISE_CLIENT_GET_REMAIN_MONEY_CMD { uint8_t data[8]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_CLIENT_GET_REMAIN_MONEY_CMD) == 8, "PROTO_NC_HOLY_PROMISE_CLIENT_GET_REMAIN_MONEY_CMD size drift");

struct PROTO_NC_HOLY_PROMISE_DB_DEL_CHAR_ACK { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_DEL_CHAR_ACK) == 6, "PROTO_NC_HOLY_PROMISE_DB_DEL_CHAR_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_DEL_CHAR_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_DEL_CHAR_REQ) == 4, "PROTO_NC_HOLY_PROMISE_DB_DEL_CHAR_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_DEL_DOWN_ACK {
    uint8_t _pad_at_0000[8];
    Name5 DownCharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_DEL_DOWN_ACK) == 30, "PROTO_NC_HOLY_PROMISE_DB_DEL_DOWN_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_DEL_DOWN_REQ {
    uint8_t _pad_at_0000[8];
    Name5 DownCharID;
    uint8_t _tail[20];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_DEL_DOWN_REQ) == 28, "PROTO_NC_HOLY_PROMISE_DB_DEL_DOWN_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_DEL_UP_ACK { uint8_t data[11]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_DEL_UP_ACK) == 11, "PROTO_NC_HOLY_PROMISE_DB_DEL_UP_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_DEL_UP_REQ { uint8_t data[9]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_DEL_UP_REQ) == 9, "PROTO_NC_HOLY_PROMISE_DB_DEL_UP_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_CEN_REWARD_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_CEN_REWARD_ACK) == 16, "PROTO_NC_HOLY_PROMISE_DB_GET_CEN_REWARD_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_CEN_REWARD_REQ {
    NETPACKETZONEHEADER header;
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_CEN_REWARD_REQ) == 6, "PROTO_NC_HOLY_PROMISE_DB_GET_CEN_REWARD_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_MEMBER_ACK {
    uint8_t _pad_at_0000[8];
    PROTO_HOLY_PROMISE_INFO_DB_______0_bytes___ MemberInfo;
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_MEMBER_ACK) == 8, "PROTO_NC_HOLY_PROMISE_DB_GET_MEMBER_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_MEMBER_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_MEMBER_REQ) == 4, "PROTO_NC_HOLY_PROMISE_DB_GET_MEMBER_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_REMAIN_MONEY_CMD { uint8_t data[12]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_REMAIN_MONEY_CMD) == 12, "PROTO_NC_HOLY_PROMISE_DB_GET_REMAIN_MONEY_CMD size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_UP_ACK {
    uint8_t _pad_at_0000[6];
    PROTO_HOLY_PROMISE_INFO_DB UpMemberInfo;
    uint8_t _tail[42];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_UP_ACK) == 48, "PROTO_NC_HOLY_PROMISE_DB_GET_UP_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_GET_UP_REQ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_GET_UP_REQ) == 4, "PROTO_NC_HOLY_PROMISE_DB_GET_UP_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK {
    uint8_t _pad_at_0000[9];
    PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK___unnamed_type_RewardList________0_bytes___ RewardList;
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK) == 9, "PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK___unnamed_type_RewardList_ { uint8_t data[4]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK___unnamed_type_RewardList_) == 4, "PROTO_NC_HOLY_PROMISE_DB_REWARD_ACK___unnamed_type_RewardList_ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_REWARD_REQ { uint8_t data[6]; };
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_REWARD_REQ) == 6, "PROTO_NC_HOLY_PROMISE_DB_REWARD_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_SET_DATE_ACK {
    uint8_t _pad_at_0000[4];
    PROTO_HOLY_PROMISE_DATE RejoinableDate;
    uint8_t _pad_at_0004[4];
    PROTO_HOLY_PROMISE_DATE MemberAcceptableDate;
    uint8_t _tail[6];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_SET_DATE_ACK) == 14, "PROTO_NC_HOLY_PROMISE_DB_SET_DATE_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_SET_DATE_REQ {
    uint8_t _pad_at_0000[4];
    PROTO_HOLY_PROMISE_DATE RejoinableDate;
    uint8_t _pad_at_0004[4];
    PROTO_HOLY_PROMISE_DATE MemberAcceptableDate;
    uint8_t _tail[4];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_SET_DATE_REQ) == 12, "PROTO_NC_HOLY_PROMISE_DB_SET_DATE_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_SET_UP_ACK {
    PROTO_HOLY_PROMISE_INFO_DB ReqInfo;
    uint8_t _pad_at_0000[42];
    PROTO_HOLY_PROMISE_INFO_DB UpInfo;
    uint8_t _tail[44];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_SET_UP_ACK) == 86, "PROTO_NC_HOLY_PROMISE_DB_SET_UP_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_SET_UP_REQ {
    PROTO_HOLY_PROMISE_INFO_DB ReqInfo;
    uint8_t _pad_at_0000[42];
    PROTO_HOLY_PROMISE_INFO_DB UpInfo;
    uint8_t _tail[42];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_SET_UP_REQ) == 84, "PROTO_NC_HOLY_PROMISE_DB_SET_UP_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DB_WITHDRAW_CEN_REWARD_ACK {
    NETPACKETZONEHEADER header;
    uint8_t _tail[10];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_WITHDRAW_CEN_REWARD_ACK) == 16, "PROTO_NC_HOLY_PROMISE_DB_WITHDRAW_CEN_REWARD_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DB_WITHDRAW_CEN_REWARD_REQ {
    NETPACKETZONEHEADER header;
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DB_WITHDRAW_CEN_REWARD_REQ) == 6, "PROTO_NC_HOLY_PROMISE_DB_WITHDRAW_CEN_REWARD_REQ size drift");

struct PROTO_NC_HOLY_PROMISE_DEL_CMD {
    Name5 CharID;
    uint8_t _tail[21];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DEL_CMD) == 21, "PROTO_NC_HOLY_PROMISE_DEL_CMD size drift");

struct PROTO_NC_HOLY_PROMISE_DEL_DOWN_ACK {
    Name5 DownCharID;
    uint8_t _tail[22];
};
static_assert(sizeof(PROTO_NC_HOLY_PROMISE_DEL_DOWN_ACK) == 22, "PROTO_NC_HOLY_PROMISE_DEL_DOWN_ACK size drift");

struct PROTO_NC_HOLY_PROMISE_DEL_DOWN_REQ {
    Name5 DownCharID;
    uint8_t _tail[20];
};
